{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}eRegQual Birth Outcomes Analysis
       {txt}log:  {res}/Users/cjr/Repos/fhi.eRegQual-birth-outcomes.2020/products/log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}13 May 2020, 16:38:44
{txt}
{com}. 
. // Set up Stata.
. do setup/setup
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Set the random number generator seed.
. set seed 1234
{txt}
{com}. 
. // Set up Stata's path to use the "packages" directory for add-on packages.
. net set ado "./packages"
{txt}
{com}. sysdir set PERSONAL "./packages"
{txt}
{com}. 
. // Specify formats.
. set cformat %9.2f
{txt}
{com}. set pformat %5.2f
{txt}
{com}. set sformat %8.2f
{txt}
{com}. 
. 
{txt}end of do-file

{com}. 
. // Set up globals.
. do globals/globals
{txt}
{com}. version 16.1
{txt}
{com}. 
. // The number of imputations to perform.
. global m_imputations 50
{txt}
{com}. 
. 
{txt}end of do-file

{com}. 
. // Import data and perform imputation.
. do data/import
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Define the path to the data and the signature we expect it to have.
. local fname "data/raw/04May2020_eRegQual birth outcomes.dta"
{txt}
{com}. local signature "6367:756(27238):862839612:1580475191"
{txt}
{com}. 
. frame create original
{txt}
{com}. frame original {c -(}
.   // Load the data and check its signature is as expected.
.   use "`fname'", replace
.   datasignature
  {res}6367:756(27238):862839612:1580475191
{com}.   assert r(datasignature) == "`signature'"
. 
.   // Globals that specify the imputed and regular variables.
.   global imputeds
.   global regulars
. 
.   // Convert the arm variable from string to integer.
.   encode prettyExposure, generate(arm)
.   label variable arm Arm
.   fvset base 1 arm
.   global regulars $regulars arm
. 
.   // Convert the stratification variable from string to integer.
.   encode bookorgdistricthashed, generate(strat_var)
.   label variable strat_var District
.   global regulars $regulars strat_var
. 
.   // Rename and label the cluster identifier variable.
.   rename str_TRIAL_1_Cluster clusterid
{res}{com}.   label variable clusterid Cluster
.   global regulars $regulars clusterid
. 
.   // Rename the components of the composite outcome.
.   rename anemia_at_birth              y1
{res}{com}.   label variable                      y1 "Anemia at birth"
.   rename severehypertension_at_birth  y2
{res}{com}.   label variable                      y2 "Severe hypertension at birth"
.   rename sga_undetected_at_birth      y3
{res}{com}.   label variable                      y3 "SGA undetected at birth"
.   rename malpres_undetected           y4
{res}{com}.   label variable                      y4 "Malpresentation undetected at birth"
.   rename lga                          y5
{res}{com}.   label variable                      y5 "Large for gestational age"
. 
.   // Apply labels to the outcomes.
.   label define yes_no 0 "No" 1 "Yes"
.   label values y* yes_no
. 
.   // Age.
.   replace age = . if age <= 1 // Correct some mis-coded values of the age variable.
{txt}(35 real changes made, 35 to missing)
{com}.   label variable age "Age (years)"
.   global imputeds $imputeds age
. 
.   // BMI.
.   rename bookbmi bmi
{res}{com}.   replace bmi = . if bmi < 15 | bmi > 48 // Same policy as for categorical version.
{txt}(54 real changes made, 54 to missing)
{com}.   label variable bmi "Body mass index"
.   global imputeds $imputeds bmi
. 
.   // Education.
.   label variable education "Education (years)"
.   global imputeds $imputeds education
. 
.   // Income.
.   generate log_income = log(avgincome) // Log to approximately normalize.
{txt}(404 missing values generated)
{com}.   label variable log_income "Monthly household income (ILS; log scale)"
.   global imputeds $imputeds log_income
. 
.   // Lab availability.
.   label variable lab_available "Lab available"
.   global regulars $regulars lab_available
. 
.   // Ultrasound available.
.   label variable us_available "US available"
.   global regulars $regulars us_available
. 
.   // Verify that all of the regular variables are complete, and that each of the
.   // variables to be imputed contain missing values.
.   misstable summarize $regulars
{txt}(variables nonmissing or string)
{com}.   assert r(N_eq_dot) + r(N_gt_dot) == .
.   foreach x of varlist y1-y5 $imputeds {c -(}
{txt}  2{com}.     misstable summarize `x'
{txt}  3{com}.     assert r(N_eq_dot) + r(N_gt_dot) != .
{txt}  4{com}.   {c )-}
{txt}{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y1 {c |}{res}     1,743{txt}{space 10}{res}     4,624{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y2 {c |}{res}     2,258{txt}{space 10}{res}     4,109{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y3 {c |}{res}       752{txt}{space 10}{res}     5,615{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y4 {c |}{res}       875{txt}{space 10}{res}     5,492{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y5 {c |}{res}       752{txt}{space 10}{res}     5,615{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
           age {c |}{res}        69{txt}{space 10}{res}     6,298{txt}  {c |}     32         14          45
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
           bmi {c |}{res}       938{txt}{space 10}{res}     5,429{txt}  {c |}   >500   15.42969    47.98243
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
     education {c |}{res}       203{txt}{space 10}{res}     6,164{txt}  {c |}     25          1          24
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
    log_income {c |}{res}       404{txt}{space 10}{res}     5,963{txt}  {c |}    222  -5.926926    8.922658
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{com}. 
.   // Keep only the variables of interest.
.   keep y* $imputeds $regulars TrialOne_adverse_pregoutc
. {c )-}
{txt}
{com}. 
. 
{txt}end of do-file

{com}. do data/impute
{txt}
{com}. version 16.1
{txt}
{com}. 
. frame copy original imputed, replace
{txt}(note: frame {bf:imputed} not found)

{com}. frame imputed {c -(}
.   // Obtain the sample size (before imputation).
.   local sample_size = _N
. 
.   // Set up the imputation and the roles of the variables.
.   mi set mlong
.   mi register imputed $imputeds y1-y5
{res}{txt}{p}
(3396 {it:m}=0 obs. now marked as incomplete)
{p_end}
{com}.   mi register regular $regulars
. 
.   // Perform imputation. Due to collinearity between the constituent outcome
.   // variables y1-y5, these variables are exluded as predictors for one another.
.   // This is achieved by specifying the noimputed option, followed by the include
.   // option that explicityly lists the imputed variables to include in the
.   // imputation model. Specifying the omit option did not work as expected. It was
.   // not possible to include other variables in the model for the constituent
.   // outcome variables, also due to collinearity.
.   mi impute chained (regress)                                       $imputeds ///
>                     (logit, noimputed include($imputeds strat_var)) y1-y5     ///
>                     = i.arm i.lab_available i.us_available,                   ///
>                     add($m_imputations) 
{res}
{txt}Conditional models:
{p 15 21 2}
{bf:age}: regress age education log_income i.y3 i.y5 i.y4 bmi i.y1 i.y2 ib1.arm i.lab_available i.us_available
{p_end}
{p 9 21 2}
{bf:education}: regress education age log_income i.y3 i.y5 i.y4 bmi i.y1 i.y2 ib1.arm i.lab_available i.us_available
{p_end}
{p 8 21 2}
{bf:log_income}: regress log_income age education i.y3 i.y5 i.y4 bmi i.y1 i.y2 ib1.arm i.lab_available i.us_available
{p_end}
{p 16 21 2}
{bf:y3}: logit y3 age bmi education log_income strat_var ib1.arm i.lab_available i.us_available
{p_end}
{p 16 21 2}
{bf:y5}: logit y5 age bmi education log_income strat_var ib1.arm i.lab_available i.us_available
{p_end}
{p 16 21 2}
{bf:y4}: logit y4 age bmi education log_income strat_var ib1.arm i.lab_available i.us_available
{p_end}
{p 15 21 2}
{bf:bmi}: regress bmi age education log_income i.y3 i.y5 i.y4 i.y1 i.y2 ib1.arm i.lab_available i.us_available
{p_end}
{p 16 21 2}
{bf:y1}: logit y1 age bmi education log_income strat_var ib1.arm i.lab_available i.us_available
{p_end}
{p 16 21 2}
{bf:y2}: logit y2 age bmi education log_income strat_var ib1.arm i.lab_available i.us_available
{p_end}

{res}{txt}Performing chained iterations ...
{res}{txt}
Multivariate imputation{txt}{col 45}{ralign 12:Imputations }= {res}      50
{txt}Chained equations{txt}{col 45}{ralign 12:added }= {res}      50
{txt}Imputed: {it:m}=1 through {it:m}=50{txt}{col 45}{ralign 12:updated }= {res}       0

{txt}Initialization: {res}monotone{txt}{col 45}{ralign 12:Iterations }= {res}     500
{txt}{col 45}{ralign 12:burn-in }= {res}      10

{txt}{p 15 15 2}{bf:age}: linear regression{p_end}
{txt}{p 15 15 2}{bf:bmi}: linear regression{p_end}
{txt}{p 9 15 2}{bf:education}: linear regression{p_end}
{txt}{p 8 15 2}{bf:log_income}: linear regression{p_end}
{txt}{p 16 15 2}{bf:y1}: logistic regression{p_end}
{txt}{p 16 15 2}{bf:y2}: logistic regression{p_end}
{txt}{p 16 15 2}{bf:y3}: logistic regression{p_end}
{txt}{p 16 15 2}{bf:y4}: logistic regression{p_end}
{txt}{p 16 15 2}{bf:y5}: logistic regression{p_end}

{txt}{hline 19}{c TT}{hline 35}{hline 11}
{txt}{col 20}{c |}{center 46:  Observations per {it:m}}
{txt}{col 20}{c LT}{hline 35}{c TT}{hline 10}
{txt}{col 11}Variable {c |}{ralign 12:Complete }{ralign 13:Incomplete }{ralign 10:Imputed }{c |}{ralign 10:Total}
{hline 19}{c +}{hline 35}{c +}{hline 10}
{txt}{ralign 19:age }{c |}{res}       6298           69        69 {txt}{c |}{res}      6367
{txt}{ralign 19:bmi }{c |}{res}       5429          938       938 {txt}{c |}{res}      6367
{txt}{ralign 19:education }{c |}{res}       6164          203       203 {txt}{c |}{res}      6367
{txt}{ralign 19:log_income }{c |}{res}       5963          404       404 {txt}{c |}{res}      6367
{txt}{ralign 19:y1 }{c |}{res}       4624         1743      1743 {txt}{c |}{res}      6367
{txt}{ralign 19:y2 }{c |}{res}       4109         2258      2258 {txt}{c |}{res}      6367
{txt}{ralign 19:y3 }{c |}{res}       5615          752       752 {txt}{c |}{res}      6367
{txt}{ralign 19:y4 }{c |}{res}       5492          875       875 {txt}{c |}{res}      6367
{txt}{ralign 19:y5 }{c |}{res}       5615          752       752 {txt}{c |}{res}      6367
{txt}{hline 19}{c BT}{hline 35}{c BT}{hline 10}
{p 0 1 1 66}(complete + incomplete = total; imputed is the minimum across {it:m}
 of the number of filled-in observations.){p_end}
{com}. 
.   // The composite outcome is defined as follows. If:
.   // * All of the outcomes are false -> composite outcome is false;
.   // * At least one of the outcomes is true -> composite outcome is true;
.   // * One or more of the outcomes are missing and all others are false
.   //   -> composite outcome is missing.
.   tempvar all_false
.   mi passive: generate `all_false' = ///
>     (y1 == 0) & (y2 == 0) & (y3 == 0) & (y4 == 0) & (y5 == 0)
{res}{txt}{it:m}=0:
{res}{txt}{it:m}=1:
{res}{txt}{it:m}=2:
{res}{txt}{it:m}=3:
{res}{txt}{it:m}=4:
{res}{txt}{it:m}=5:
{res}{txt}{it:m}=6:
{res}{txt}{it:m}=7:
{res}{txt}{it:m}=8:
{res}{txt}{it:m}=9:
{res}{txt}{it:m}=10:
{res}{txt}{it:m}=11:
{res}{txt}{it:m}=12:
{res}{txt}{it:m}=13:
{res}{txt}{it:m}=14:
{res}{txt}{it:m}=15:
{res}{txt}{it:m}=16:
{res}{txt}{it:m}=17:
{res}{txt}{it:m}=18:
{res}{txt}{it:m}=19:
{res}{txt}{it:m}=20:
{res}{txt}{it:m}=21:
{res}{txt}{it:m}=22:
{res}{txt}{it:m}=23:
{res}{txt}{it:m}=24:
{res}{txt}{it:m}=25:
{res}{txt}{it:m}=26:
{res}{txt}{it:m}=27:
{res}{txt}{it:m}=28:
{res}{txt}{it:m}=29:
{res}{txt}{it:m}=30:
{res}{txt}{it:m}=31:
{res}{txt}{it:m}=32:
{res}{txt}{it:m}=33:
{res}{txt}{it:m}=34:
{res}{txt}{it:m}=35:
{res}{txt}{it:m}=36:
{res}{txt}{it:m}=37:
{res}{txt}{it:m}=38:
{res}{txt}{it:m}=39:
{res}{txt}{it:m}=40:
{res}{txt}{it:m}=41:
{res}{txt}{it:m}=42:
{res}{txt}{it:m}=43:
{res}{txt}{it:m}=44:
{res}{txt}{it:m}=45:
{res}{txt}{it:m}=46:
{res}{txt}{it:m}=47:
{res}{txt}{it:m}=48:
{res}{txt}{it:m}=49:
{res}{txt}{it:m}=50:
{res}{com}.   tempvar one_true
.   mi passive: generate `one_true'  = ///
>     (y1 == 1) | (y2 == 1) | (y3 == 1) | (y4 == 1) | (y5 == 1)
{res}{txt}{it:m}=0:
{res}{txt}{it:m}=1:
{res}{txt}{it:m}=2:
{res}{txt}{it:m}=3:
{res}{txt}{it:m}=4:
{res}{txt}{it:m}=5:
{res}{txt}{it:m}=6:
{res}{txt}{it:m}=7:
{res}{txt}{it:m}=8:
{res}{txt}{it:m}=9:
{res}{txt}{it:m}=10:
{res}{txt}{it:m}=11:
{res}{txt}{it:m}=12:
{res}{txt}{it:m}=13:
{res}{txt}{it:m}=14:
{res}{txt}{it:m}=15:
{res}{txt}{it:m}=16:
{res}{txt}{it:m}=17:
{res}{txt}{it:m}=18:
{res}{txt}{it:m}=19:
{res}{txt}{it:m}=20:
{res}{txt}{it:m}=21:
{res}{txt}{it:m}=22:
{res}{txt}{it:m}=23:
{res}{txt}{it:m}=24:
{res}{txt}{it:m}=25:
{res}{txt}{it:m}=26:
{res}{txt}{it:m}=27:
{res}{txt}{it:m}=28:
{res}{txt}{it:m}=29:
{res}{txt}{it:m}=30:
{res}{txt}{it:m}=31:
{res}{txt}{it:m}=32:
{res}{txt}{it:m}=33:
{res}{txt}{it:m}=34:
{res}{txt}{it:m}=35:
{res}{txt}{it:m}=36:
{res}{txt}{it:m}=37:
{res}{txt}{it:m}=38:
{res}{txt}{it:m}=39:
{res}{txt}{it:m}=40:
{res}{txt}{it:m}=41:
{res}{txt}{it:m}=42:
{res}{txt}{it:m}=43:
{res}{txt}{it:m}=44:
{res}{txt}{it:m}=45:
{res}{txt}{it:m}=46:
{res}{txt}{it:m}=47:
{res}{txt}{it:m}=48:
{res}{txt}{it:m}=49:
{res}{txt}{it:m}=50:
{res}{com}. 
.   mi passive: generate y = .
{res}{txt}{it:m}=0:
(6,367 missing values generated)
{res}{txt}{it:m}=1:
(6,367 missing values generated)
{res}{txt}{it:m}=2:
(6,367 missing values generated)
{res}{txt}{it:m}=3:
(6,367 missing values generated)
{res}{txt}{it:m}=4:
(6,367 missing values generated)
{res}{txt}{it:m}=5:
(6,367 missing values generated)
{res}{txt}{it:m}=6:
(6,367 missing values generated)
{res}{txt}{it:m}=7:
(6,367 missing values generated)
{res}{txt}{it:m}=8:
(6,367 missing values generated)
{res}{txt}{it:m}=9:
(6,367 missing values generated)
{res}{txt}{it:m}=10:
(6,367 missing values generated)
{res}{txt}{it:m}=11:
(6,367 missing values generated)
{res}{txt}{it:m}=12:
(6,367 missing values generated)
{res}{txt}{it:m}=13:
(6,367 missing values generated)
{res}{txt}{it:m}=14:
(6,367 missing values generated)
{res}{txt}{it:m}=15:
(6,367 missing values generated)
{res}{txt}{it:m}=16:
(6,367 missing values generated)
{res}{txt}{it:m}=17:
(6,367 missing values generated)
{res}{txt}{it:m}=18:
(6,367 missing values generated)
{res}{txt}{it:m}=19:
(6,367 missing values generated)
{res}{txt}{it:m}=20:
(6,367 missing values generated)
{res}{txt}{it:m}=21:
(6,367 missing values generated)
{res}{txt}{it:m}=22:
(6,367 missing values generated)
{res}{txt}{it:m}=23:
(6,367 missing values generated)
{res}{txt}{it:m}=24:
(6,367 missing values generated)
{res}{txt}{it:m}=25:
(6,367 missing values generated)
{res}{txt}{it:m}=26:
(6,367 missing values generated)
{res}{txt}{it:m}=27:
(6,367 missing values generated)
{res}{txt}{it:m}=28:
(6,367 missing values generated)
{res}{txt}{it:m}=29:
(6,367 missing values generated)
{res}{txt}{it:m}=30:
(6,367 missing values generated)
{res}{txt}{it:m}=31:
(6,367 missing values generated)
{res}{txt}{it:m}=32:
(6,367 missing values generated)
{res}{txt}{it:m}=33:
(6,367 missing values generated)
{res}{txt}{it:m}=34:
(6,367 missing values generated)
{res}{txt}{it:m}=35:
(6,367 missing values generated)
{res}{txt}{it:m}=36:
(6,367 missing values generated)
{res}{txt}{it:m}=37:
(6,367 missing values generated)
{res}{txt}{it:m}=38:
(6,367 missing values generated)
{res}{txt}{it:m}=39:
(6,367 missing values generated)
{res}{txt}{it:m}=40:
(6,367 missing values generated)
{res}{txt}{it:m}=41:
(6,367 missing values generated)
{res}{txt}{it:m}=42:
(6,367 missing values generated)
{res}{txt}{it:m}=43:
(6,367 missing values generated)
{res}{txt}{it:m}=44:
(6,367 missing values generated)
{res}{txt}{it:m}=45:
(6,367 missing values generated)
{res}{txt}{it:m}=46:
(6,367 missing values generated)
{res}{txt}{it:m}=47:
(6,367 missing values generated)
{res}{txt}{it:m}=48:
(6,367 missing values generated)
{res}{txt}{it:m}=49:
(6,367 missing values generated)
{res}{txt}{it:m}=50:
(6,367 missing values generated)
{res}{com}.   mi passive: replace  y = 0 if `all_false'
{res}{txt}{it:m}=0:
(2,818 real changes made)
{res}{txt}{it:m}=1:
(4,767 real changes made)
{res}{txt}{it:m}=2:
(4,739 real changes made)
{res}{txt}{it:m}=3:
(4,742 real changes made)
{res}{txt}{it:m}=4:
(4,755 real changes made)
{res}{txt}{it:m}=5:
(4,742 real changes made)
{res}{txt}{it:m}=6:
(4,733 real changes made)
{res}{txt}{it:m}=7:
(4,783 real changes made)
{res}{txt}{it:m}=8:
(4,742 real changes made)
{res}{txt}{it:m}=9:
(4,775 real changes made)
{res}{txt}{it:m}=10:
(4,745 real changes made)
{res}{txt}{it:m}=11:
(4,758 real changes made)
{res}{txt}{it:m}=12:
(4,759 real changes made)
{res}{txt}{it:m}=13:
(4,763 real changes made)
{res}{txt}{it:m}=14:
(4,759 real changes made)
{res}{txt}{it:m}=15:
(4,764 real changes made)
{res}{txt}{it:m}=16:
(4,753 real changes made)
{res}{txt}{it:m}=17:
(4,756 real changes made)
{res}{txt}{it:m}=18:
(4,778 real changes made)
{res}{txt}{it:m}=19:
(4,774 real changes made)
{res}{txt}{it:m}=20:
(4,766 real changes made)
{res}{txt}{it:m}=21:
(4,781 real changes made)
{res}{txt}{it:m}=22:
(4,766 real changes made)
{res}{txt}{it:m}=23:
(4,796 real changes made)
{res}{txt}{it:m}=24:
(4,777 real changes made)
{res}{txt}{it:m}=25:
(4,776 real changes made)
{res}{txt}{it:m}=26:
(4,769 real changes made)
{res}{txt}{it:m}=27:
(4,782 real changes made)
{res}{txt}{it:m}=28:
(4,771 real changes made)
{res}{txt}{it:m}=29:
(4,770 real changes made)
{res}{txt}{it:m}=30:
(4,792 real changes made)
{res}{txt}{it:m}=31:
(4,764 real changes made)
{res}{txt}{it:m}=32:
(4,756 real changes made)
{res}{txt}{it:m}=33:
(4,713 real changes made)
{res}{txt}{it:m}=34:
(4,757 real changes made)
{res}{txt}{it:m}=35:
(4,780 real changes made)
{res}{txt}{it:m}=36:
(4,720 real changes made)
{res}{txt}{it:m}=37:
(4,737 real changes made)
{res}{txt}{it:m}=38:
(4,757 real changes made)
{res}{txt}{it:m}=39:
(4,797 real changes made)
{res}{txt}{it:m}=40:
(4,777 real changes made)
{res}{txt}{it:m}=41:
(4,758 real changes made)
{res}{txt}{it:m}=42:
(4,771 real changes made)
{res}{txt}{it:m}=43:
(4,761 real changes made)
{res}{txt}{it:m}=44:
(4,752 real changes made)
{res}{txt}{it:m}=45:
(4,750 real changes made)
{res}{txt}{it:m}=46:
(4,753 real changes made)
{res}{txt}{it:m}=47:
(4,765 real changes made)
{res}{txt}{it:m}=48:
(4,769 real changes made)
{res}{txt}{it:m}=49:
(4,739 real changes made)
{res}{txt}{it:m}=50:
(4,770 real changes made)
{res}{com}.   mi passive: replace  y = 1 if `one_true'
{res}{txt}{it:m}=0:
(1,396 real changes made)
{res}{txt}{it:m}=1:
(1,600 real changes made)
{res}{txt}{it:m}=2:
(1,628 real changes made)
{res}{txt}{it:m}=3:
(1,625 real changes made)
{res}{txt}{it:m}=4:
(1,612 real changes made)
{res}{txt}{it:m}=5:
(1,625 real changes made)
{res}{txt}{it:m}=6:
(1,634 real changes made)
{res}{txt}{it:m}=7:
(1,584 real changes made)
{res}{txt}{it:m}=8:
(1,625 real changes made)
{res}{txt}{it:m}=9:
(1,592 real changes made)
{res}{txt}{it:m}=10:
(1,622 real changes made)
{res}{txt}{it:m}=11:
(1,609 real changes made)
{res}{txt}{it:m}=12:
(1,608 real changes made)
{res}{txt}{it:m}=13:
(1,604 real changes made)
{res}{txt}{it:m}=14:
(1,608 real changes made)
{res}{txt}{it:m}=15:
(1,603 real changes made)
{res}{txt}{it:m}=16:
(1,614 real changes made)
{res}{txt}{it:m}=17:
(1,611 real changes made)
{res}{txt}{it:m}=18:
(1,589 real changes made)
{res}{txt}{it:m}=19:
(1,593 real changes made)
{res}{txt}{it:m}=20:
(1,601 real changes made)
{res}{txt}{it:m}=21:
(1,586 real changes made)
{res}{txt}{it:m}=22:
(1,601 real changes made)
{res}{txt}{it:m}=23:
(1,571 real changes made)
{res}{txt}{it:m}=24:
(1,590 real changes made)
{res}{txt}{it:m}=25:
(1,591 real changes made)
{res}{txt}{it:m}=26:
(1,598 real changes made)
{res}{txt}{it:m}=27:
(1,585 real changes made)
{res}{txt}{it:m}=28:
(1,596 real changes made)
{res}{txt}{it:m}=29:
(1,597 real changes made)
{res}{txt}{it:m}=30:
(1,575 real changes made)
{res}{txt}{it:m}=31:
(1,603 real changes made)
{res}{txt}{it:m}=32:
(1,611 real changes made)
{res}{txt}{it:m}=33:
(1,654 real changes made)
{res}{txt}{it:m}=34:
(1,610 real changes made)
{res}{txt}{it:m}=35:
(1,587 real changes made)
{res}{txt}{it:m}=36:
(1,647 real changes made)
{res}{txt}{it:m}=37:
(1,630 real changes made)
{res}{txt}{it:m}=38:
(1,610 real changes made)
{res}{txt}{it:m}=39:
(1,570 real changes made)
{res}{txt}{it:m}=40:
(1,590 real changes made)
{res}{txt}{it:m}=41:
(1,609 real changes made)
{res}{txt}{it:m}=42:
(1,596 real changes made)
{res}{txt}{it:m}=43:
(1,606 real changes made)
{res}{txt}{it:m}=44:
(1,615 real changes made)
{res}{txt}{it:m}=45:
(1,617 real changes made)
{res}{txt}{it:m}=46:
(1,614 real changes made)
{res}{txt}{it:m}=47:
(1,602 real changes made)
{res}{txt}{it:m}=48:
(1,598 real changes made)
{res}{txt}{it:m}=49:
(1,628 real changes made)
{res}{txt}{it:m}=50:
(1,597 real changes made)
{res}{com}.   label variable y "Adverse pregnancy outcome"
. 
.   // Verify that we can correctly recompute the composite outcome using the
.   // original (non-imputed) data.
.   count if y == TrialOne_adverse_pregoutc & _mi_m == 0
  {res}6,367
{com}.   assert r(N) == `sample_size'
. {c )-}
{txt}
{com}. 
. 
{txt}end of do-file

{com}. 
. // Do estimation.
. do estimation/missing
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Local macro to compute percentage of data that are missing following a
. // misstable patterns command.
. local pc_miss 100 * (r(N_incomplete) / (r(N_incomplete) + r(N_complete)))
{txt}
{com}. 
. frame imputed {c -(}
.   // Plot the density of each of the continuous imputed variables.
.   foreach var of global imputeds {c -(}
{txt}  2{com}.     quietly misstable patterns `var' if _mi_m == 0
{txt}  3{com}.     global pc_miss_`var' = `pc_miss'
{txt}  4{com}.   {c )-}
. 
.   // Estimate the percentages of missing data for the outcome variables.
.   foreach var of varlist y y1-y5 {c -(}
{txt}  2{com}.     quietly misstable patterns `var' if _mi_m == 0
{txt}  3{com}.     global pc_miss_`var' = `pc_miss'
{txt}  4{com}.   {c )-}
. {c )-}
{txt}
{com}. 
. local miss_vars $pc_miss_y1, $pc_miss_y2, $pc_miss_y3, $pc_miss_y4, $pc_miss_y5
{txt}
{com}. global pc_min_miss = min(`miss_vars')
{txt}
{com}. global pc_max_miss = max(`miss_vars')
{txt}
{com}. 
. 
{txt}end of do-file

{com}. do estimation/estimation
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Specify the model.
. local covars     i.arm i.strat_var
{txt}
{com}. local model_spec family(binomial) link(log) asis // See below for note on asis.
{txt}
{com}. local model      xtgee \`var' `covars', `model_spec'
{txt}
{com}. 
. // Compute the complete case estimate.
. tempname original
{txt}
{com}. frame copy imputed `original'
{txt}
{com}. frame `original' {c -(}
.   // Fit the model.
.   mi extract 0, clear
.   xtset clusterid
{txt}{col 8}panel variable:  {res}clusterid (unbalanced)
{com}.   local var y
.   `model' eform

{txt}Iteration 1: tolerance = {res}.00637192
{txt}Iteration 2: tolerance = {res}.00032607
{txt}Iteration 3: tolerance = {res}.00001426
{txt}Iteration 4: tolerance = {res}6.729e-07

{txt}GEE population-averaged model                   Number of obs     = {res}     4,214
{txt}Group variable:                  {res}clusterid      {txt}Number of groups  = {res}       119
{txt}Link:                                  {res}log      {txt}Obs per group:
Family:                           {res}binomial                    {txt}min = {res}         6
{txt}Correlation:                  {res}exchangeable                    {txt}avg = {res}      35.4
                                                              {txt}max = {res}       139
                                                {txt}Wald chi2({res}5{txt})      =  {res}    12.66
{txt}Scale parameter:                 {res}        1      {txt}Prob > chi2       =     {res}0.0267

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}arm {c |}
{space 10}D  {c |}{col 14}{res}{space 2}     0.99{col 26}{space 2}     0.04{col 37}{space 1}   -0.18{col 46}{space 3} 0.85{col 54}{space 4}     0.91{col 67}{space 3}     1.08
{txt}{space 12} {c |}
{space 3}strat_var {c |}
{space 5}8d9c30  {c |}{col 14}{res}{space 2}     1.11{col 26}{space 2}     0.08{col 37}{space 1}    1.42{col 46}{space 3} 0.16{col 54}{space 4}     0.96{col 67}{space 3}     1.27
{txt}{space 5}9d5ed6  {c |}{col 14}{res}{space 2}     0.90{col 26}{space 2}     0.09{col 37}{space 1}   -1.11{col 46}{space 3} 0.27{col 54}{space 4}     0.74{col 67}{space 3}     1.09
{txt}{space 5}e1e1d3  {c |}{col 14}{res}{space 2}     1.06{col 26}{space 2}     0.08{col 37}{space 1}    0.71{col 46}{space 3} 0.47{col 54}{space 4}     0.91{col 67}{space 3}     1.22
{txt}{space 5}ff4457  {c |}{col 14}{res}{space 2}     1.17{col 26}{space 2}     0.08{col 37}{space 1}    2.24{col 46}{space 3} 0.03{col 54}{space 4}     1.02{col 67}{space 3}     1.35
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}     0.31{col 26}{space 2}     0.02{col 37}{space 1}  -18.49{col 46}{space 3} 0.00{col 54}{space 4}     0.27{col 67}{space 3}     0.35
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{com}.   estimates store complete_case_estimates
. 
.   // Make globals containing key results.
.   matrix result   = r(table)
.   global cc_rr_b  = result["b",      "2.arm"]
.   global cc_rr_ll = result["ll",     "2.arm"]
.   global cc_rr_ul = result["ul",     "2.arm"]
.   global cc_rr_p  = result["pvalue", "2.arm"]
. 
.   // Estimate ICC.
.   loneway `var' clusterid

         {txt}One-way Analysis of Variance for y: Adverse pregnancy outcome

                                             Number of obs = {res}       4,214
                                                 {txt}R-squared = {res}      0.0276

{txt}{col 5}Source{col 27}SS{col 38}df{col 46}MS{col 60}F{col 66}Prob > F
{hline 73}
Between clusterid{res}{col 23} 25.750506{col 34}   118{col 43} .21822463{col 54}     0.98{col 68}0.5307
{txt}Within clusterid{res}{col 23} 907.78723{col 34} 4,095{col 43} .22168186
{txt}{hline 73}
Total{res}{col 23} 933.53773{col 34} 4,213{col 43} .22158503

{txt}{col 10}Intraclass{col 27}Asy.{col 39}
{col 10}correlation{col 27}S.E.{col 38}[95% Conf. Interval]
         {hline 48}
          {res}  0.00000{txt}*  {res}  0.00374       0.00000     0.00734

{txt}{col 10}Estimated SD of clusterid effect{res}{col 49}        .
{txt}{col 10}Estimated SD within clusterid{res}{col 49}  .470831
{txt}{col 10}Est. reliability of a clusterid mean{res}{col 49}  0.00000{txt}*
{col 15}(evaluated at n={res}35.27{txt})

(*) Truncated at zero.
{com}.   global icc    = r(rho)
.   global icc_lb = r(lb)
.   global icc_ub = r(ub)
. {c )-}
{txt}
{com}. 
. // Compute the multiply-imputed estimates.
. tempname imputed
{txt}
{com}. frame copy imputed `imputed'
{txt}
{com}. frame `imputed' {c -(}
.   mi xtset clusterid
{res}{txt}{p}
(passive variables
{res}__000000 __000001
{txt}unregistered because not in {it:m}=0)
{p_end}
{res}{txt}{col 8}panel variable:  {res}clusterid (unbalanced)
{com}. 
.   local mi_opts    eform errorok
.     // The asis and errorok options are neeeded because, by chance, collinearity
.     // can exist between the stratification variable and the dependent variable.
.     // See the assert below, which specifies when this happens.
. 
.   foreach var of varlist y y1-y5 {c -(} 
{txt}  2{com}.     // Estimate population averaged effects using a GEE.
.     mi estimate, `mi_opts': `model'
{txt}  3{com}.     estimates store `var'_estimates
{txt}  4{com}. 
.     // Verify that the anticipated imputations were used.
.     if ("`var'" != "y2") assert e(M_mi) == $m_imputations
{txt}  5{com}.     if ("`var'" == "y2") assert e(M_mi) >=  0.7 * $m_imputations
{txt}  6{com}.     
.     // Make globals containing key results.
.     matrix result      = r(table)
{txt}  7{com}.     global rr_b_`var'  = result["b",      "2.arm"]
{txt}  8{com}.     global rr_ll_`var' = result["ll",     "2.arm"]
{txt}  9{com}.     global rr_ul_`var' = result["ul",     "2.arm"]
{txt} 10{com}.     global rr_p_`var'  = result["pvalue", "2.arm"]
{txt} 11{com}.   {c )-}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}GEE population-averaged model{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable:{ralign 27:{res:clusterid}}{col 49}Number of groups{col 67}= {res}       119
{txt}Link:{ralign 37:{res:log}}{col 49}Obs per group:
Family:{ralign 35:{res:binomial}}{col 49}              min{col 67}= {res}         9
{txt}Correlation:{ralign 30:{res:exchangeable}}{col 49}              avg{col 67}= {res}      53.5
{txt}Scale parameter:{ralign 26:{res:1}}{col 49}              max{col 67}= {res}       217

{txt}{col 49}Average RVI{col 67}= {res}    0.1803
{txt}{col 49}Largest FMI{col 67}= {res}    0.1944
{txt}DF adjustment:{ralign 28: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1,313.73
{txt}{col 49}        avg{col 67}= {res}  2,511.47
{txt}{col 49}        max{col 67}= {res}  3,631.82
{txt}Model F test:{ralign 29: {res:Equal FMI}}{col 49}F({res}   5{txt},{res}12094.8{txt}){col 67}= {res}      1.40
{txt}Within VCE type: {ralign 25:{res:Conventional}}{col 49}Prob > F{col 67}= {res}    0.2204

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}arm {c |}
{space 10}D  {c |}{col 14}{res}{space 2}     1.01{col 26}{space 2}     0.05{col 37}{space 1}    0.16{col 46}{space 3} 0.87{col 54}{space 4}     0.92{col 67}{space 3}     1.11
{txt}{space 12} {c |}
{space 3}strat_var {c |}
{space 5}8d9c30  {c |}{col 14}{res}{space 2}     1.10{col 26}{space 2}     0.09{col 37}{space 1}    1.27{col 46}{space 3} 0.20{col 54}{space 4}     0.95{col 67}{space 3}     1.29
{txt}{space 5}9d5ed6  {c |}{col 14}{res}{space 2}     0.93{col 26}{space 2}     0.10{col 37}{space 1}   -0.68{col 46}{space 3} 0.50{col 54}{space 4}     0.75{col 67}{space 3}     1.15
{txt}{space 5}e1e1d3  {c |}{col 14}{res}{space 2}     1.08{col 26}{space 2}     0.09{col 37}{space 1}    0.99{col 46}{space 3} 0.32{col 54}{space 4}     0.92{col 67}{space 3}     1.27
{txt}{space 5}ff4457  {c |}{col 14}{res}{space 2}     1.15{col 26}{space 2}     0.09{col 37}{space 1}    1.79{col 46}{space 3} 0.07{col 54}{space 4}     0.99{col 67}{space 3}     1.34
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}     0.23{col 26}{space 2}     0.02{col 37}{space 1}  -20.65{col 46}{space 3} 0.00{col 54}{space 4}     0.20{col 67}{space 3}     0.27
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}GEE population-averaged model{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable:{ralign 27:{res:clusterid}}{col 49}Number of groups{col 67}= {res}       119
{txt}Link:{ralign 37:{res:log}}{col 49}Obs per group:
Family:{ralign 35:{res:binomial}}{col 49}              min{col 67}= {res}         9
{txt}Correlation:{ralign 30:{res:exchangeable}}{col 49}              avg{col 67}= {res}      53.5
{txt}Scale parameter:{ralign 26:{res:1}}{col 49}              max{col 67}= {res}       217

{txt}{col 49}Average RVI{col 67}= {res}    0.2753
{txt}{col 49}Largest FMI{col 67}= {res}    0.2721
{txt}DF adjustment:{ralign 28: {res:Large sample}}{col 49}DF:     min{col 67}= {res}    672.40
{txt}{col 49}        avg{col 67}= {res}  1,442.00
{txt}{col 49}        max{col 67}= {res}  2,501.37
{txt}Model F test:{ralign 29: {res:Equal FMI}}{col 49}F({res}   5{txt},{res} 5040.2{txt}){col 67}= {res}      0.68
{txt}Within VCE type: {ralign 25:{res:Conventional}}{col 49}Prob > F{col 67}= {res}    0.6424

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          y1{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}arm {c |}
{space 10}D  {c |}{col 14}{res}{space 2}     1.17{col 26}{space 2}     0.27{col 37}{space 1}    0.67{col 46}{space 3} 0.51{col 54}{space 4}     0.74{col 67}{space 3}     1.85
{txt}{space 12} {c |}
{space 3}strat_var {c |}
{space 5}8d9c30  {c |}{col 14}{res}{space 2}     1.38{col 26}{space 2}     0.61{col 37}{space 1}    0.73{col 46}{space 3} 0.47{col 54}{space 4}     0.58{col 67}{space 3}     3.27
{txt}{space 5}9d5ed6  {c |}{col 14}{res}{space 2}     1.54{col 26}{space 2}     0.88{col 37}{space 1}    0.75{col 46}{space 3} 0.45{col 54}{space 4}     0.50{col 67}{space 3}     4.75
{txt}{space 5}e1e1d3  {c |}{col 14}{res}{space 2}     1.90{col 26}{space 2}     0.82{col 37}{space 1}    1.50{col 46}{space 3} 0.13{col 54}{space 4}     0.82{col 67}{space 3}     4.42
{txt}{space 5}ff4457  {c |}{col 14}{res}{space 2}     1.77{col 26}{space 2}     0.74{col 37}{space 1}    1.38{col 46}{space 3} 0.17{col 54}{space 4}     0.78{col 67}{space 3}     4.00
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}     0.01{col 26}{space 2}     0.00{col 37}{space 1}  -11.61{col 46}{space 3} 0.00{col 54}{space 4}     0.00{col 67}{space 3}     0.02
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        36
{txt}GEE population-averaged model{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable:{ralign 27:{res:clusterid}}{col 49}Number of groups{col 67}= {res}       119
{txt}Link:{ralign 37:{res:log}}{col 49}Obs per group:
Family:{ralign 35:{res:binomial}}{col 49}              min{col 67}= {res}         9
{txt}Correlation:{ralign 30:{res:exchangeable}}{col 49}              avg{col 67}= {res}      53.5
{txt}Scale parameter:{ralign 26:{res:1}}{col 49}              max{col 67}= {res}       217

{txt}{col 49}Average RVI{col 67}= {res}    0.5720
{txt}{col 49}Largest FMI{col 67}= {res}    0.3884
{txt}DF adjustment:{ralign 28: {res:Large sample}}{col 49}DF:     min{col 67}= {res}    238.22
{txt}{col 49}        avg{col 67}= {res}    446.73
{txt}{col 49}        max{col 67}= {res}    554.61
{txt}Model F test:{ralign 29: {res:Equal FMI}}{col 49}F({res}   5{txt},{res} 1515.6{txt}){col 67}= {res}      2.47
{txt}Within VCE type: {ralign 25:{res:Conventional}}{col 49}Prob > F{col 67}= {res}    0.0305

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          y2{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}arm {c |}
{space 10}D  {c |}{col 14}{res}{space 2}     1.52{col 26}{space 2}     0.60{col 37}{space 1}    1.08{col 46}{space 3} 0.28{col 54}{space 4}     0.70{col 67}{space 3}     3.29
{txt}{space 12} {c |}
{space 3}strat_var {c |}
{space 5}8d9c30  {c |}{col 14}{res}{space 2}     1.17{col 26}{space 2}     0.99{col 37}{space 1}    0.19{col 46}{space 3} 0.85{col 54}{space 4}     0.22{col 67}{space 3}     6.12
{txt}{space 5}9d5ed6  {c |}{col 14}{res}{space 2}     0.99{col 26}{space 2}     1.19{col 37}{space 1}   -0.01{col 46}{space 3} 0.99{col 54}{space 4}     0.09{col 67}{space 3}    10.45
{txt}{space 5}e1e1d3  {c |}{col 14}{res}{space 2}     1.79{col 26}{space 2}     1.48{col 37}{space 1}    0.70{col 46}{space 3} 0.48{col 54}{space 4}     0.35{col 67}{space 3}     9.12
{txt}{space 5}ff4457  {c |}{col 14}{res}{space 2}     4.34{col 26}{space 2}     3.25{col 37}{space 1}    1.96{col 46}{space 3} 0.05{col 54}{space 4}     1.00{col 67}{space 3}    18.87
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}     0.00{col 26}{space 2}     0.00{col 37}{space 1}   -8.02{col 46}{space 3} 0.00{col 54}{space 4}     0.00{col 67}{space 3}     0.01
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 0 79}Note: 14 imputations ignored {txt}because of a failure to estimate parameters{p_end}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}GEE population-averaged model{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable:{ralign 27:{res:clusterid}}{col 49}Number of groups{col 67}= {res}       119
{txt}Link:{ralign 37:{res:log}}{col 49}Obs per group:
Family:{ralign 35:{res:binomial}}{col 49}              min{col 67}= {res}         9
{txt}Correlation:{ralign 30:{res:exchangeable}}{col 49}              avg{col 67}= {res}      53.5
{txt}Scale parameter:{ralign 26:{res:1}}{col 49}              max{col 67}= {res}       217

{txt}{col 49}Average RVI{col 67}= {res}    0.0945
{txt}{col 49}Largest FMI{col 67}= {res}    0.1004
{txt}DF adjustment:{ralign 28: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  4,892.85
{txt}{col 49}        avg{col 67}= {res}  7,696.09
{txt}{col 49}        max{col 67}= {res} 11,170.40
{txt}Model F test:{ralign 29: {res:Equal FMI}}{col 49}F({res}   5{txt},{res}33745.2{txt}){col 67}= {res}      0.55
{txt}Within VCE type: {ralign 25:{res:Conventional}}{col 49}Prob > F{col 67}= {res}    0.7416

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          y3{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}arm {c |}
{space 10}D  {c |}{col 14}{res}{space 2}     1.02{col 26}{space 2}     0.11{col 37}{space 1}    0.16{col 46}{space 3} 0.88{col 54}{space 4}     0.82{col 67}{space 3}     1.26
{txt}{space 12} {c |}
{space 3}strat_var {c |}
{space 5}8d9c30  {c |}{col 14}{res}{space 2}     0.86{col 26}{space 2}     0.15{col 37}{space 1}   -0.88{col 46}{space 3} 0.38{col 54}{space 4}     0.61{col 67}{space 3}     1.21
{txt}{space 5}9d5ed6  {c |}{col 14}{res}{space 2}     0.67{col 26}{space 2}     0.18{col 37}{space 1}   -1.53{col 46}{space 3} 0.13{col 54}{space 4}     0.40{col 67}{space 3}     1.12
{txt}{space 5}e1e1d3  {c |}{col 14}{res}{space 2}     0.93{col 26}{space 2}     0.16{col 37}{space 1}   -0.44{col 46}{space 3} 0.66{col 54}{space 4}     0.66{col 67}{space 3}     1.31
{txt}{space 5}ff4457  {c |}{col 14}{res}{space 2}     0.93{col 26}{space 2}     0.16{col 37}{space 1}   -0.41{col 46}{space 3} 0.68{col 54}{space 4}     0.67{col 67}{space 3}     1.30
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}     0.09{col 26}{space 2}     0.01{col 37}{space 1}  -16.27{col 46}{space 3} 0.00{col 54}{space 4}     0.07{col 67}{space 3}     0.12
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}GEE population-averaged model{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable:{ralign 27:{res:clusterid}}{col 49}Number of groups{col 67}= {res}       119
{txt}Link:{ralign 37:{res:log}}{col 49}Obs per group:
Family:{ralign 35:{res:binomial}}{col 49}              min{col 67}= {res}         9
{txt}Correlation:{ralign 30:{res:exchangeable}}{col 49}              avg{col 67}= {res}      53.5
{txt}Scale parameter:{ralign 26:{res:1}}{col 49}              max{col 67}= {res}       217

{txt}{col 49}Average RVI{col 67}= {res}    0.1766
{txt}{col 49}Largest FMI{col 67}= {res}    0.1871
{txt}DF adjustment:{ralign 28: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1,416.34
{txt}{col 49}        avg{col 67}= {res}  2,174.29
{txt}{col 49}        max{col 67}= {res}  2,884.12
{txt}Model F test:{ralign 29: {res:Equal FMI}}{col 49}F({res}   5{txt},{res}10172.2{txt}){col 67}= {res}      2.04
{txt}Within VCE type: {ralign 25:{res:Conventional}}{col 49}Prob > F{col 67}= {res}    0.0704

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          y4{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}arm {c |}
{space 10}D  {c |}{col 14}{res}{space 2}     1.10{col 26}{space 2}     0.17{col 37}{space 1}    0.59{col 46}{space 3} 0.55{col 54}{space 4}     0.81{col 67}{space 3}     1.49
{txt}{space 12} {c |}
{space 3}strat_var {c |}
{space 5}8d9c30  {c |}{col 14}{res}{space 2}     1.25{col 26}{space 2}     0.39{col 37}{space 1}    0.72{col 46}{space 3} 0.47{col 54}{space 4}     0.68{col 67}{space 3}     2.29
{txt}{space 5}9d5ed6  {c |}{col 14}{res}{space 2}     0.75{col 26}{space 2}     0.36{col 37}{space 1}   -0.60{col 46}{space 3} 0.55{col 54}{space 4}     0.29{col 67}{space 3}     1.91
{txt}{space 5}e1e1d3  {c |}{col 14}{res}{space 2}     1.88{col 26}{space 2}     0.55{col 37}{space 1}    2.17{col 46}{space 3} 0.03{col 54}{space 4}     1.06{col 67}{space 3}     3.34
{txt}{space 5}ff4457  {c |}{col 14}{res}{space 2}     1.63{col 26}{space 2}     0.49{col 37}{space 1}    1.63{col 46}{space 3} 0.10{col 54}{space 4}     0.91{col 67}{space 3}     2.93
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}     0.02{col 26}{space 2}     0.01{col 37}{space 1}  -14.24{col 46}{space 3} 0.00{col 54}{space 4}     0.01{col 67}{space 3}     0.04
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}GEE population-averaged model{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable:{ralign 27:{res:clusterid}}{col 49}Number of groups{col 67}= {res}       119
{txt}Link:{ralign 37:{res:log}}{col 49}Obs per group:
Family:{ralign 35:{res:binomial}}{col 49}              min{col 67}= {res}         9
{txt}Correlation:{ralign 30:{res:exchangeable}}{col 49}              avg{col 67}= {res}      53.5
{txt}Scale parameter:{ralign 26:{res:1}}{col 49}              max{col 67}= {res}       217

{txt}{col 49}Average RVI{col 67}= {res}    0.1257
{txt}{col 49}Largest FMI{col 67}= {res}    0.1500
{txt}DF adjustment:{ralign 28: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  2,200.83
{txt}{col 49}        avg{col 67}= {res}  4,100.47
{txt}{col 49}        max{col 67}= {res}  6,163.05
{txt}Model F test:{ralign 29: {res:Equal FMI}}{col 49}F({res}   5{txt},{res}20497.4{txt}){col 67}= {res}      1.01
{txt}Within VCE type: {ralign 25:{res:Conventional}}{col 49}Prob > F{col 67}= {res}    0.4106

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          y5{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}arm {c |}
{space 10}D  {c |}{col 14}{res}{space 2}     0.93{col 26}{space 2}     0.07{col 37}{space 1}   -1.00{col 46}{space 3} 0.32{col 54}{space 4}     0.81{col 67}{space 3}     1.07
{txt}{space 12} {c |}
{space 3}strat_var {c |}
{space 5}8d9c30  {c |}{col 14}{res}{space 2}     1.18{col 26}{space 2}     0.14{col 37}{space 1}    1.40{col 46}{space 3} 0.16{col 54}{space 4}     0.94{col 67}{space 3}     1.48
{txt}{space 5}9d5ed6  {c |}{col 14}{res}{space 2}     1.12{col 26}{space 2}     0.17{col 37}{space 1}    0.72{col 46}{space 3} 0.47{col 54}{space 4}     0.83{col 67}{space 3}     1.51
{txt}{space 5}e1e1d3  {c |}{col 14}{res}{space 2}     1.00{col 26}{space 2}     0.13{col 37}{space 1}   -0.02{col 46}{space 3} 0.98{col 54}{space 4}     0.78{col 67}{space 3}     1.28
{txt}{space 5}ff4457  {c |}{col 14}{res}{space 2}     1.14{col 26}{space 2}     0.14{col 37}{space 1}    1.05{col 46}{space 3} 0.29{col 54}{space 4}     0.90{col 67}{space 3}     1.44
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}     0.12{col 26}{space 2}     0.01{col 37}{space 1}  -19.87{col 46}{space 3} 0.00{col 54}{space 4}     0.10{col 67}{space 3}     0.15
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{com}. {c )-}
{txt}
{com}. 
. 
{txt}end of do-file

{com}. do estimation/mcar
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Test the null hypothesis that the constituent outcomes are jointly MCAR, and
. // the null that the constituent outcomes are jointly CDM (a type of MCAR).
. // P < 0.05 would reject the hypotheses (i.e., as usual, if P>= 0.05, we cannot
. // "conclude" that the data are MCAR or have CDM, merely that we cannot reject
. // those hypotheses).
. frame original {c -(}
.   mcartest y1-y5
{res}{txt}{p 0 6}note: 560 {txt}observations {txt}omitted from EM estimation because of all {txt}imputation variables missing{p_end}
{res}
{txt}Little's MCAR test

Number of obs       = {res}5807
{txt}Chi-square distance = {res}42.4844     
{txt}Degrees of freedom  = {res}34
{txt}Prob > chi-square   = {res}0.1507
{com}.   global p_mcar = r(p)
.   mcartest y1-y5 = i.arm i.strat_var
{res}{txt}{p 0 6}note: 560 {txt}observations {txt}omitted from EM estimation because of all {txt}imputation variables missing{p_end}
{res}
{txt}Little's CDM test

Number of obs       = {res}5807
{txt}Chi-square distance = {res}196.2496    
{txt}Degrees of freedom  = {res}204
{txt}Prob > chi-square   = {res}0.6389
{com}.   global p_cdm  = r(p)
. {c )-}
{txt}
{com}. 
. 
{txt}end of do-file

{com}. 
. // Make figures
. do figures/figures
{txt}
{com}. version 16.1
{txt}
{com}. 
. set graphics off
{txt}
{com}. 
. // Define the number of imputations to plot.
. local imputations_to_plot 5
{txt}
{com}. assert `imputations_to_plot' <= $m_imputations
{txt}
{com}. 
. // Make the plots.
. tempname this_frame
{txt}
{com}. frame copy imputed `this_frame'
{txt}
{com}. frame `this_frame' {c -(}
.   mi set M = `imputations_to_plot'
{txt}{p}
(passive variables
{res}__000000 __000001
{txt}unregistered because not in {it:m}=0)
{p_end}
(45 imputations dropped; {it:M} = 5)
{com}. 
.   // Generate a variable for each imputed variable that contains the original
.   // values (with the missing data), repeated for each imputed data set.
.   mi convert wide, clear
{res}{com}.   foreach var of varlist $imputeds y1-y5 y {c -(}
{txt}  2{com}.     generate `var'_orig = `var'
{txt}  3{com}.   {c )-}
{txt}(69 missing values generated)
(938 missing values generated)
(203 missing values generated)
(404 missing values generated)
(1,743 missing values generated)
(2,258 missing values generated)
(752 missing values generated)
(875 missing values generated)
(752 missing values generated)
(2,153 missing values generated)
{com}.   mi convert flong, clear
{res}{com}. 
.   // Create readable value labels for the imputations, and order them so that
.   // the original data will appear first in the plots.
.   generate imputation_str = ""
{txt}(38,202 missing values generated)
{com}.   replace imputation_str = "Original" if _mi_m == 0
{txt}variable {bf}imputation_str{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str8{sf}
{txt}(6,367 real changes made)
{com}.   replace imputation_str = "Imputation " + string(_mi_m) if _mi_m != 0
{txt}variable {bf}imputation_str{sf} was {bf}{res}str8{sf}{txt} now {bf}{res}str12{sf}
{txt}(31,835 real changes made)
{com}.   encode imputation_str, generate(imputation)
.   replace imputation = (`imputations_to_plot' + 1) - imputation
{txt}(31,835 real changes made)
{com}.   local label_var: value label imputation
.   label define `label_var' 0 "Original", modify
. 
.   // Plot the density of each of the continuous imputed variables.
.   foreach var of global imputeds {c -(}
{txt}  2{com}.     local pc_miss = string(${c -(}pc_miss_`var'{c )-}, "%8.1f") + "% missing"
{txt}  3{com}. 
.     local var_label : variable label `var'
{txt}  4{com}.     twoway (kdensity `var'_orig)                                   ///
>            (kdensity `var'),                                       ///
>            by(imputation arm, note("")                             ///
>               graphregion(color(white))                            ///
>               plotregion(color(white))                             ///
>               bgcolor(white))                                      ///
>            xtitle("`var_label' (`pc_miss')")                       ///
>            yscale(lcolor(white))                                   ///
>            subtitle(, bcolor(white) lcolor(white))                 ///
>            ylabel(none)                                            ///
>            legend(label(1 "Original") label(2 "Imputed")           ///
>                   region(color(white)))
{txt}  5{com}.     global `var'_plot_fname "products/Imputations (cont) - `var_label'"
{txt}  6{com}.     graph export "${c -(}`var'_plot_fname{c )-}.pdf", replace
{txt}  7{com}.     graph export "${c -(}`var'_plot_fname{c )-}.png", replace
{txt}  8{com}.   {c )-}
{res}{txt}(file products/Imputations (cont) - Age (years).pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual-birth-outcomes.2020/products/Imputations (cont) - Age (years).png written in PNG format)
{res}{txt}(file products/Imputations (cont) - Body mass index.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual-birth-outcomes.2020/products/Imputations (cont) - Body mass index.png written in PNG format)
{res}{txt}(file products/Imputations (cont) - Education (years).pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual-birth-outcomes.2020/products/Imputations (cont) - Education (years).png written in PNG format)
{res}{txt}(file products/Imputations (cont) - Monthly household income (ILS; log scale).pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual-birth-outcomes.2020/products/Imputations (cont) - Monthly household income (ILS; log scale).png written in PNG format)
{com}. 
.   // Plot the distribution of each of the dichotomous imputed variables.
.   label values y* yes_no
.   foreach var of varlist y y1-y5 {c -(}
{txt}  2{com}.     local pc_miss = string(${c -(}pc_miss_`var'{c )-}, "%8.1f") + "% missing"
{txt}  3{com}.     local var_label : variable label `var'
{txt}  4{com}. 
.     splitvallabels imputation, recode
{txt}  5{com}.     graph hbar (count),                                             ///
>       over(`var', label(labsize(small)))                            ///
>       over(arm, label(labsize(small)))                              ///
>       over(imputation, label(labsize(small)) relabel(`r(relabel)')) ///
>       blabel(bar) intensity(25)                                     ///
>       ytitle("`var_label' (`pc_miss')") yscale(range(0 3500))       ///
>       legend(region(lcolor(white)))                                 ///
>       graphregion(color(white)) plotregion(color(white)) bgcolor(white)
{txt}  6{com}.     global `var'_plot_fname "products/Imputations (cont) - `var_label'"
{txt}  7{com}.     graph export "${c -(}`var'_plot_fname{c )-}.pdf", replace
{txt}  8{com}.     graph export "${c -(}`var'_plot_fname{c )-}.png", replace
{txt}  9{com}.   {c )-}
{res}{txt}(file products/Imputations (cont) - Adverse pregnancy outcome.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual-birth-outcomes.2020/products/Imputations (cont) - Adverse pregnancy outcome.png written in PNG format)
{res}{txt}(file products/Imputations (cont) - Anemia at birth.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual-birth-outcomes.2020/products/Imputations (cont) - Anemia at birth.png written in PNG format)
{res}{txt}(file products/Imputations (cont) - Severe hypertension at birth.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual-birth-outcomes.2020/products/Imputations (cont) - Severe hypertension at birth.png written in PNG format)
{res}{txt}(file products/Imputations (cont) - SGA undetected at birth.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual-birth-outcomes.2020/products/Imputations (cont) - SGA undetected at birth.png written in PNG format)
{res}{txt}(file products/Imputations (cont) - Malpresentation undetected at birth.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual-birth-outcomes.2020/products/Imputations (cont) - Malpresentation undetected at birth.png written in PNG format)
{res}{txt}(file products/Imputations (cont) - Large for gestational age.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual-birth-outcomes.2020/products/Imputations (cont) - Large for gestational age.png written in PNG format)
{com}. {c )-}
{txt}
{com}. 
. set graphics on
{txt}
{com}. 
. 
{txt}end of do-file

{com}. 
. // Obtain the git revision hash, which is used in the reports.
. tempfile git_revision_filename
{txt}
{com}. tempname revision_file
{txt}
{com}. shell git rev-parse --short HEAD > "`git_revision_filename'"
{txt}

{com}. file open `revision_file' using `git_revision_filename', read text
{txt}
{com}. file read `revision_file' line
{txt}
{com}. global git_revision = "`macval(line)'"
{txt}
{com}. 
. // Make the report
. do reports/report products/report.docx
{txt}
{com}. version 16.1
{txt}
{com}. 
. args filename
{txt}
{com}. 
. // Some locals to make this file a little more readable.
. local heading putdocx paragraph, style(Heading1)
{txt}
{com}. local newpara putdocx textblock begin, halign(both)
{txt}
{com}. local putdocx textblock end putdocx textblock end
{txt}
{com}. 
. local p_fmt  %5.2f // Format used for P-values.
{txt}
{com}. local e_fmt  %5.2f // Format used for estimates.
{txt}
{com}. local pc_fmt %8.1f // Format used for percentages.
{txt}
{com}. 
. // Start the document.
. putdocx begin
{res}{txt}
{com}. 
. // Title.
. putdocx paragraph, style(Title)
{res}{txt}
{com}. putdocx text ("eRegQual analysis")
{res}{txt}
{com}. 
. // Author and revision information.
. `newpara'
{res}{txt}
{com}. `newpara'
{res}{txt}
{com}. 
. // Introduction section.
. `heading'
{res}{txt}
{com}. putdocx text ("Introduction")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. // Methods section
. `heading'
{res}{txt}
{com}. putdocx text ("Methods")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. // Results section
. `heading'
{res}{txt}
{com}. putdocx text ("Results")
{res}{txt}
{com}. 
. // Verify some assumptions in this section.
. assert ${c -(}p_mcar{c )-} > 0.05
{txt}
{com}. assert ${c -(}p_cdm{c )-}  > 0.05
{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. frame imputed {c -(}
.   local count = 0
.   foreach var of varlist y y1-y5 {c -(}
{txt}  2{com}.     local ++count
{txt}  3{com}.     local var_label : variable label `var'
{txt}  4{com}.     local title "Table `count'. `var_label' (multiply-imputed result)"
{txt}  5{com}.     estimates replay `var'_estimates, eform
{txt}  6{com}.     putdocx table tbl_`count' = etable, title("`title'")
{txt}  7{com}.     putdocx table tbl_`count'(2, 2) = ("Risk Ratio"), halign(right)
{txt}  8{com}.   {c )-}

{txt}{hline}
{p 0 8}Model {hi:y_estimates}{p_end}
{hline}

Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}GEE population-averaged model{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable:{ralign 27:{res:clusterid}}{col 49}Number of groups{col 67}= {res}       119
{txt}Link:{ralign 37:{res:log}}{col 49}Obs per group:
Family:{ralign 35:{res:binomial}}{col 49}              min{col 67}= {res}         9
{txt}Correlation:{ralign 30:{res:exchangeable}}{col 49}              avg{col 67}= {res}      53.5
{txt}Scale parameter:{ralign 26:{res:1}}{col 49}              max{col 67}= {res}       217

{txt}{col 49}Average RVI{col 67}= {res}    0.1803
{txt}{col 49}Largest FMI{col 67}= {res}    0.1944
{txt}DF adjustment:{ralign 28: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1,313.73
{txt}{col 49}        avg{col 67}= {res}  2,511.47
{txt}{col 49}        max{col 67}= {res}  3,631.82
{txt}Model F test:{ralign 29: {res:Equal FMI}}{col 49}F({res}   5{txt},{res}12094.8{txt}){col 67}= {res}      1.40
{txt}Within VCE type: {ralign 25:{res:Conventional}}{col 49}Prob > F{col 67}= {res}    0.2204

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}arm {c |}
{space 10}D  {c |}{col 14}{res}{space 2}     1.01{col 26}{space 2}     0.05{col 37}{space 1}    0.16{col 46}{space 3} 0.87{col 54}{space 4}     0.92{col 67}{space 3}     1.11
{txt}{space 12} {c |}
{space 3}strat_var {c |}
{space 5}8d9c30  {c |}{col 14}{res}{space 2}     1.10{col 26}{space 2}     0.09{col 37}{space 1}    1.27{col 46}{space 3} 0.20{col 54}{space 4}     0.95{col 67}{space 3}     1.29
{txt}{space 5}9d5ed6  {c |}{col 14}{res}{space 2}     0.93{col 26}{space 2}     0.10{col 37}{space 1}   -0.68{col 46}{space 3} 0.50{col 54}{space 4}     0.75{col 67}{space 3}     1.15
{txt}{space 5}e1e1d3  {c |}{col 14}{res}{space 2}     1.08{col 26}{space 2}     0.09{col 37}{space 1}    0.99{col 46}{space 3} 0.32{col 54}{space 4}     0.92{col 67}{space 3}     1.27
{txt}{space 5}ff4457  {c |}{col 14}{res}{space 2}     1.15{col 26}{space 2}     0.09{col 37}{space 1}    1.79{col 46}{space 3} 0.07{col 54}{space 4}     0.99{col 67}{space 3}     1.34
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}     0.23{col 26}{space 2}     0.02{col 37}{space 1}  -20.65{col 46}{space 3} 0.00{col 54}{space 4}     0.20{col 67}{space 3}     0.27
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline}
{p 0 8}Model {hi:y1_estimates}{p_end}
{hline}

Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}GEE population-averaged model{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable:{ralign 27:{res:clusterid}}{col 49}Number of groups{col 67}= {res}       119
{txt}Link:{ralign 37:{res:log}}{col 49}Obs per group:
Family:{ralign 35:{res:binomial}}{col 49}              min{col 67}= {res}         9
{txt}Correlation:{ralign 30:{res:exchangeable}}{col 49}              avg{col 67}= {res}      53.5
{txt}Scale parameter:{ralign 26:{res:1}}{col 49}              max{col 67}= {res}       217

{txt}{col 49}Average RVI{col 67}= {res}    0.2753
{txt}{col 49}Largest FMI{col 67}= {res}    0.2721
{txt}DF adjustment:{ralign 28: {res:Large sample}}{col 49}DF:     min{col 67}= {res}    672.40
{txt}{col 49}        avg{col 67}= {res}  1,442.00
{txt}{col 49}        max{col 67}= {res}  2,501.37
{txt}Model F test:{ralign 29: {res:Equal FMI}}{col 49}F({res}   5{txt},{res} 5040.2{txt}){col 67}= {res}      0.68
{txt}Within VCE type: {ralign 25:{res:Conventional}}{col 49}Prob > F{col 67}= {res}    0.6424

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          y1{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}arm {c |}
{space 10}D  {c |}{col 14}{res}{space 2}     1.17{col 26}{space 2}     0.27{col 37}{space 1}    0.67{col 46}{space 3} 0.51{col 54}{space 4}     0.74{col 67}{space 3}     1.85
{txt}{space 12} {c |}
{space 3}strat_var {c |}
{space 5}8d9c30  {c |}{col 14}{res}{space 2}     1.38{col 26}{space 2}     0.61{col 37}{space 1}    0.73{col 46}{space 3} 0.47{col 54}{space 4}     0.58{col 67}{space 3}     3.27
{txt}{space 5}9d5ed6  {c |}{col 14}{res}{space 2}     1.54{col 26}{space 2}     0.88{col 37}{space 1}    0.75{col 46}{space 3} 0.45{col 54}{space 4}     0.50{col 67}{space 3}     4.75
{txt}{space 5}e1e1d3  {c |}{col 14}{res}{space 2}     1.90{col 26}{space 2}     0.82{col 37}{space 1}    1.50{col 46}{space 3} 0.13{col 54}{space 4}     0.82{col 67}{space 3}     4.42
{txt}{space 5}ff4457  {c |}{col 14}{res}{space 2}     1.77{col 26}{space 2}     0.74{col 37}{space 1}    1.38{col 46}{space 3} 0.17{col 54}{space 4}     0.78{col 67}{space 3}     4.00
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}     0.01{col 26}{space 2}     0.00{col 37}{space 1}  -11.61{col 46}{space 3} 0.00{col 54}{space 4}     0.00{col 67}{space 3}     0.02
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline}
{p 0 8}Model {hi:y2_estimates}{p_end}
{hline}

Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        36
{txt}GEE population-averaged model{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable:{ralign 27:{res:clusterid}}{col 49}Number of groups{col 67}= {res}       119
{txt}Link:{ralign 37:{res:log}}{col 49}Obs per group:
Family:{ralign 35:{res:binomial}}{col 49}              min{col 67}= {res}         9
{txt}Correlation:{ralign 30:{res:exchangeable}}{col 49}              avg{col 67}= {res}      53.5
{txt}Scale parameter:{ralign 26:{res:1}}{col 49}              max{col 67}= {res}       217

{txt}{col 49}Average RVI{col 67}= {res}    0.5720
{txt}{col 49}Largest FMI{col 67}= {res}    0.3884
{txt}DF adjustment:{ralign 28: {res:Large sample}}{col 49}DF:     min{col 67}= {res}    238.22
{txt}{col 49}        avg{col 67}= {res}    446.73
{txt}{col 49}        max{col 67}= {res}    554.61
{txt}Model F test:{ralign 29: {res:Equal FMI}}{col 49}F({res}   5{txt},{res} 1515.6{txt}){col 67}= {res}      2.47
{txt}Within VCE type: {ralign 25:{res:Conventional}}{col 49}Prob > F{col 67}= {res}    0.0305

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          y2{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}arm {c |}
{space 10}D  {c |}{col 14}{res}{space 2}     1.52{col 26}{space 2}     0.60{col 37}{space 1}    1.08{col 46}{space 3} 0.28{col 54}{space 4}     0.70{col 67}{space 3}     3.29
{txt}{space 12} {c |}
{space 3}strat_var {c |}
{space 5}8d9c30  {c |}{col 14}{res}{space 2}     1.17{col 26}{space 2}     0.99{col 37}{space 1}    0.19{col 46}{space 3} 0.85{col 54}{space 4}     0.22{col 67}{space 3}     6.12
{txt}{space 5}9d5ed6  {c |}{col 14}{res}{space 2}     0.99{col 26}{space 2}     1.19{col 37}{space 1}   -0.01{col 46}{space 3} 0.99{col 54}{space 4}     0.09{col 67}{space 3}    10.45
{txt}{space 5}e1e1d3  {c |}{col 14}{res}{space 2}     1.79{col 26}{space 2}     1.48{col 37}{space 1}    0.70{col 46}{space 3} 0.48{col 54}{space 4}     0.35{col 67}{space 3}     9.12
{txt}{space 5}ff4457  {c |}{col 14}{res}{space 2}     4.34{col 26}{space 2}     3.25{col 37}{space 1}    1.96{col 46}{space 3} 0.05{col 54}{space 4}     1.00{col 67}{space 3}    18.87
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}     0.00{col 26}{space 2}     0.00{col 37}{space 1}   -8.02{col 46}{space 3} 0.00{col 54}{space 4}     0.00{col 67}{space 3}     0.01
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 0 79}Note: 14 imputations ignored {txt}because of a failure to estimate parameters{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:y3_estimates}{p_end}
{hline}

Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}GEE population-averaged model{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable:{ralign 27:{res:clusterid}}{col 49}Number of groups{col 67}= {res}       119
{txt}Link:{ralign 37:{res:log}}{col 49}Obs per group:
Family:{ralign 35:{res:binomial}}{col 49}              min{col 67}= {res}         9
{txt}Correlation:{ralign 30:{res:exchangeable}}{col 49}              avg{col 67}= {res}      53.5
{txt}Scale parameter:{ralign 26:{res:1}}{col 49}              max{col 67}= {res}       217

{txt}{col 49}Average RVI{col 67}= {res}    0.0945
{txt}{col 49}Largest FMI{col 67}= {res}    0.1004
{txt}DF adjustment:{ralign 28: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  4,892.85
{txt}{col 49}        avg{col 67}= {res}  7,696.09
{txt}{col 49}        max{col 67}= {res} 11,170.40
{txt}Model F test:{ralign 29: {res:Equal FMI}}{col 49}F({res}   5{txt},{res}33745.2{txt}){col 67}= {res}      0.55
{txt}Within VCE type: {ralign 25:{res:Conventional}}{col 49}Prob > F{col 67}= {res}    0.7416

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          y3{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}arm {c |}
{space 10}D  {c |}{col 14}{res}{space 2}     1.02{col 26}{space 2}     0.11{col 37}{space 1}    0.16{col 46}{space 3} 0.88{col 54}{space 4}     0.82{col 67}{space 3}     1.26
{txt}{space 12} {c |}
{space 3}strat_var {c |}
{space 5}8d9c30  {c |}{col 14}{res}{space 2}     0.86{col 26}{space 2}     0.15{col 37}{space 1}   -0.88{col 46}{space 3} 0.38{col 54}{space 4}     0.61{col 67}{space 3}     1.21
{txt}{space 5}9d5ed6  {c |}{col 14}{res}{space 2}     0.67{col 26}{space 2}     0.18{col 37}{space 1}   -1.53{col 46}{space 3} 0.13{col 54}{space 4}     0.40{col 67}{space 3}     1.12
{txt}{space 5}e1e1d3  {c |}{col 14}{res}{space 2}     0.93{col 26}{space 2}     0.16{col 37}{space 1}   -0.44{col 46}{space 3} 0.66{col 54}{space 4}     0.66{col 67}{space 3}     1.31
{txt}{space 5}ff4457  {c |}{col 14}{res}{space 2}     0.93{col 26}{space 2}     0.16{col 37}{space 1}   -0.41{col 46}{space 3} 0.68{col 54}{space 4}     0.67{col 67}{space 3}     1.30
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}     0.09{col 26}{space 2}     0.01{col 37}{space 1}  -16.27{col 46}{space 3} 0.00{col 54}{space 4}     0.07{col 67}{space 3}     0.12
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline}
{p 0 8}Model {hi:y4_estimates}{p_end}
{hline}

Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}GEE population-averaged model{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable:{ralign 27:{res:clusterid}}{col 49}Number of groups{col 67}= {res}       119
{txt}Link:{ralign 37:{res:log}}{col 49}Obs per group:
Family:{ralign 35:{res:binomial}}{col 49}              min{col 67}= {res}         9
{txt}Correlation:{ralign 30:{res:exchangeable}}{col 49}              avg{col 67}= {res}      53.5
{txt}Scale parameter:{ralign 26:{res:1}}{col 49}              max{col 67}= {res}       217

{txt}{col 49}Average RVI{col 67}= {res}    0.1766
{txt}{col 49}Largest FMI{col 67}= {res}    0.1871
{txt}DF adjustment:{ralign 28: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1,416.34
{txt}{col 49}        avg{col 67}= {res}  2,174.29
{txt}{col 49}        max{col 67}= {res}  2,884.12
{txt}Model F test:{ralign 29: {res:Equal FMI}}{col 49}F({res}   5{txt},{res}10172.2{txt}){col 67}= {res}      2.04
{txt}Within VCE type: {ralign 25:{res:Conventional}}{col 49}Prob > F{col 67}= {res}    0.0704

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          y4{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}arm {c |}
{space 10}D  {c |}{col 14}{res}{space 2}     1.10{col 26}{space 2}     0.17{col 37}{space 1}    0.59{col 46}{space 3} 0.55{col 54}{space 4}     0.81{col 67}{space 3}     1.49
{txt}{space 12} {c |}
{space 3}strat_var {c |}
{space 5}8d9c30  {c |}{col 14}{res}{space 2}     1.25{col 26}{space 2}     0.39{col 37}{space 1}    0.72{col 46}{space 3} 0.47{col 54}{space 4}     0.68{col 67}{space 3}     2.29
{txt}{space 5}9d5ed6  {c |}{col 14}{res}{space 2}     0.75{col 26}{space 2}     0.36{col 37}{space 1}   -0.60{col 46}{space 3} 0.55{col 54}{space 4}     0.29{col 67}{space 3}     1.91
{txt}{space 5}e1e1d3  {c |}{col 14}{res}{space 2}     1.88{col 26}{space 2}     0.55{col 37}{space 1}    2.17{col 46}{space 3} 0.03{col 54}{space 4}     1.06{col 67}{space 3}     3.34
{txt}{space 5}ff4457  {c |}{col 14}{res}{space 2}     1.63{col 26}{space 2}     0.49{col 37}{space 1}    1.63{col 46}{space 3} 0.10{col 54}{space 4}     0.91{col 67}{space 3}     2.93
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}     0.02{col 26}{space 2}     0.01{col 37}{space 1}  -14.24{col 46}{space 3} 0.00{col 54}{space 4}     0.01{col 67}{space 3}     0.04
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline}
{p 0 8}Model {hi:y5_estimates}{p_end}
{hline}

Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}GEE population-averaged model{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable:{ralign 27:{res:clusterid}}{col 49}Number of groups{col 67}= {res}       119
{txt}Link:{ralign 37:{res:log}}{col 49}Obs per group:
Family:{ralign 35:{res:binomial}}{col 49}              min{col 67}= {res}         9
{txt}Correlation:{ralign 30:{res:exchangeable}}{col 49}              avg{col 67}= {res}      53.5
{txt}Scale parameter:{ralign 26:{res:1}}{col 49}              max{col 67}= {res}       217

{txt}{col 49}Average RVI{col 67}= {res}    0.1257
{txt}{col 49}Largest FMI{col 67}= {res}    0.1500
{txt}DF adjustment:{ralign 28: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  2,200.83
{txt}{col 49}        avg{col 67}= {res}  4,100.47
{txt}{col 49}        max{col 67}= {res}  6,163.05
{txt}Model F test:{ralign 29: {res:Equal FMI}}{col 49}F({res}   5{txt},{res}20497.4{txt}){col 67}= {res}      1.01
{txt}Within VCE type: {ralign 25:{res:Conventional}}{col 49}Prob > F{col 67}= {res}    0.4106

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          y5{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}arm {c |}
{space 10}D  {c |}{col 14}{res}{space 2}     0.93{col 26}{space 2}     0.07{col 37}{space 1}   -1.00{col 46}{space 3} 0.32{col 54}{space 4}     0.81{col 67}{space 3}     1.07
{txt}{space 12} {c |}
{space 3}strat_var {c |}
{space 5}8d9c30  {c |}{col 14}{res}{space 2}     1.18{col 26}{space 2}     0.14{col 37}{space 1}    1.40{col 46}{space 3} 0.16{col 54}{space 4}     0.94{col 67}{space 3}     1.48
{txt}{space 5}9d5ed6  {c |}{col 14}{res}{space 2}     1.12{col 26}{space 2}     0.17{col 37}{space 1}    0.72{col 46}{space 3} 0.47{col 54}{space 4}     0.83{col 67}{space 3}     1.51
{txt}{space 5}e1e1d3  {c |}{col 14}{res}{space 2}     1.00{col 26}{space 2}     0.13{col 37}{space 1}   -0.02{col 46}{space 3} 0.98{col 54}{space 4}     0.78{col 67}{space 3}     1.28
{txt}{space 5}ff4457  {c |}{col 14}{res}{space 2}     1.14{col 26}{space 2}     0.14{col 37}{space 1}    1.05{col 46}{space 3} 0.29{col 54}{space 4}     0.90{col 67}{space 3}     1.44
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}     0.12{col 26}{space 2}     0.01{col 37}{space 1}  -19.87{col 46}{space 3} 0.00{col 54}{space 4}     0.10{col 67}{space 3}     0.15
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{com}. {c )-}
{txt}
{com}. 
. // References
. `heading'
{res}{txt}
{com}. putdocx text ("References")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. // Appendix
. `heading'
{res}{txt}
{com}. putdocx text ("Appendix")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. foreach var of newlist y1-y5 y $imputeds {c -(} // newlist as vars only exist in (other) frames.
{txt}  2{com}.   display "${c -(}`var'_plot_fname{c )-}"
{txt}  3{com}.   putdocx image "${c -(}`var'_plot_fname{c )-}.png", linebreak
{txt}  4{com}. {c )-}
products/Imputations (cont) - Anemia at birth
{res}products/Imputations (cont) - Severe hypertension at birth
products/Imputations (cont) - SGA undetected at birth
products/Imputations (cont) - Malpresentation undetected at birth
products/Imputations (cont) - Large for gestational age
products/Imputations (cont) - Adverse pregnancy outcome
products/Imputations (cont) - Age (years)
products/Imputations (cont) - Body mass index
products/Imputations (cont) - Education (years)
products/Imputations (cont) - Monthly household income (ILS; log scale)
{txt}
{com}. 
. 
. // Save the report to the specified filename.
. putdocx save `"`filename'"', replace
{res}successfully replaced {browse "/Users/cjr/Repos/fhi.eRegQual-birth-outcomes.2020/products/report.docx":"/Users/cjr/Repos/fhi.eRegQual-birth-outcomes.2020/products/report.docx"}
{txt}
{com}. 
. 
{txt}end of do-file

{com}. 
. 
{txt}end of do-file

{com}. 