{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}eRegQual Analysis
       {txt}log:  {res}/Users/cjr/Repos/fhi.eRegQual.2020/products/log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}30 Jun 2020, 15:53:27
{txt}
{com}. 
. // Set up Stata.
. do setup/setup
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Set the random number generator seed.
. set seed 1234
{txt}
{com}. 
. // Set up Stata's path to use the "packages" directory for add-on packages.
. net set ado "./packages"
{txt}
{com}. sysdir set PERSONAL "./packages"
{txt}
{com}. 
. // Specify formats.
. set cformat %9.2f
{txt}
{com}. set pformat %5.2f
{txt}
{com}. set sformat %8.2f
{txt}
{com}. 
. 
{txt}end of do-file

{com}. 
. // Set up globals.
. do globals/globals
{txt}
{com}. version 16.1
{txt}
{com}. 
. // The number of imputations to perform.
. global m_imputations 50 // Very slightly narrower CI if m=100.
{txt}
{com}. 
. // Define the names of the process outcomes.
. global process_outcomes attendance hypertension diabetes malpresentation
{txt}
{com}. 
. // The variables to adjust for, with their "types". See the generated report for
. // an explanation of why these variables are adjusted for.
. global adj_vars i.strat_var c.cluster_size i.lab_available i.age_over_40 ///
>                 i.primiparous
{txt}
{com}. global adj_var_names // A global with just the *names* of the adj_vars
{txt}
{com}. foreach x of global adj_vars {c -(}
{txt}  2{com}.   local x_name = substr("`x'", 3, .) // Remove the i. or c.
{txt}  3{com}.   global adj_var_names $adj_var_names `x_name'
{txt}  4{com}. {c )-}
{txt}
{com}. 
. // Define paths to the process outcome files.
. global fname_attendance      "data/raw/25June2020_eRegQual process outcomes_attendance.dta"
{txt}
{com}. global fname_hypertension    "data/raw/25June2020_eRegQual process outcomes_hypertension.dta"
{txt}
{com}. global fname_diabetes        "data/raw/25June2020_eRegQual process outcomes_diabetes.dta"
{txt}
{com}. global fname_malpresentation "data/raw/25June2020_eRegQual process outcomes_malpresentation.dta"
{txt}
{com}. 
. // Define data signatures for the process outcome files.
. global datasignature_attendance          "6367:39(51496):3578513271:2127801624"
{txt}
{com}. global datasignature_hypertension        "6367:60(68365):3970041110:3735367683"
{txt}
{com}. global datasignature_diabetes            "6367:38(91264):1895688975:3113856828"
{txt}
{com}. global datasignature_malpresentation     "6367:31(88392):1586201653:3483051938"
{txt}
{com}. 
. // Define titles to use for the margins plots.
. global mpo "Marginal probability of"
{txt}
{com}. global attendance_margins_title      "`mpo' ANC attendance"
{txt}
{com}. global hypertension_margins_title    "`mpo' hypertension screening and management"
{txt}
{com}. global diabetes_margins_title        "`mpo' diabetes screening and management"
{txt}
{com}. global malpresentation_margins_title "`mpo' malpresentation screening and management"
{txt}
{com}. 
{txt}end of do-file

{com}. 
. // Import birth outcome data and perform imputation.
. // TODO: Reinstate
. do data/birth_outcomes
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Define the path to the data and the signature we expect it to have.
. local fname "data/raw/04May2020_eRegQual birth outcomes.dta"
{txt}
{com}. local signature "6367:756(27238):862839612:1580475191"
{txt}
{com}. 
. frame create original
{txt}
{com}. frame original {c -(}
.   // Load the data and check its signature is as expected.
.   use "`fname'", replace
.   datasignature
  {res}6367:756(27238):862839612:1580475191
{com}.   assert r(datasignature) == "`signature'"
. 
.   // Globals that specify the imputed and regular variables.
.   global imputeds
.   global regulars
. 
.   // Convert the arm variable from string to integer.
.   encode prettyExposure, generate(arm)
.   label variable arm Arm
.   fvset base 1 arm
.   global regulars $regulars arm
. 
.   // Convert the stratification variable from string to integer.
.   encode bookorgdistricthashed, generate(strat_var)
.   label variable strat_var District
.   global regulars $regulars strat_var
. 
.   // Rename and label the cluster identifier variable.
.   rename str_TRIAL_1_Cluster clusterid
{res}{com}.   label variable clusterid Cluster
.   global regulars $regulars clusterid
. 
.   // Rename the components of the composite outcome.
.   rename anemia_at_birth              y1
{res}{com}.   label variable                      y1 "Anemia at birth"
.   rename severehypertension_at_birth  y2
{res}{com}.   label variable                      y2 "Severe hypertension at birth"
.   rename sga_undetected_at_birth      y3
{res}{com}.   label variable                      y3 "SGA undetected at birth"
.   rename malpres_undetected           y4
{res}{com}.   label variable                      y4 "Malpresentation undetected at birth"
.   rename lga                          y5
{res}{com}.   label variable                      y5 "Large for gestational age"
. 
.   // Apply labels to the outcomes.
.   label define yes_no 0 "No" 1 "Yes"
.   label values y* yes_no
. 
.   // Age.
.   replace age = . if age <= 1 // Correct some mis-coded values of the age variable.
{txt}(35 real changes made, 35 to missing)
{com}.   label variable age "Age (years)"
.   global imputeds $imputeds age
. 
.   // BMI.
.   rename bookbmi bmi
{res}{com}.   replace bmi = . if bmi < 15 | bmi > 48 // Same policy as for categorical version.
{txt}(54 real changes made, 54 to missing)
{com}.   label variable bmi "Body mass index"
.   global imputeds $imputeds bmi
. 
.   // Education.
.   label variable education "Education (years)"
.   global imputeds $imputeds education
. 
.   // Income.
.   generate log_income = log(avgincome) // Log to approximately normalize.
{txt}(404 missing values generated)
{com}.   label variable log_income "Monthly household income (ILS; log scale)"
.   global imputeds $imputeds log_income
. 
.   // Lab availability.
.   label variable lab_available "Lab available"
.   global regulars $regulars lab_available
. 
.   // Ultrasound available.
.   label variable us_available "US available"
.   global regulars $regulars us_available
. 
.   // Verify that all of the regular variables are complete, and that each of the
.   // variables to be imputed contain missing values.
.   misstable summarize $regulars
{txt}(variables nonmissing or string)
{com}.   assert r(N_eq_dot) + r(N_gt_dot) == .
.   foreach x of varlist y1-y5 $imputeds {c -(}
{txt}  2{com}.     misstable summarize `x'
{txt}  3{com}.     assert r(N_eq_dot) + r(N_gt_dot) != .
{txt}  4{com}.   {c )-}
{txt}{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y1 {c |}{res}     1,743{txt}{space 10}{res}     4,624{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y2 {c |}{res}     2,258{txt}{space 10}{res}     4,109{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y3 {c |}{res}       752{txt}{space 10}{res}     5,615{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y4 {c |}{res}       875{txt}{space 10}{res}     5,492{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y5 {c |}{res}       752{txt}{space 10}{res}     5,615{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
           age {c |}{res}        69{txt}{space 10}{res}     6,298{txt}  {c |}     32         14          45
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
           bmi {c |}{res}       938{txt}{space 10}{res}     5,429{txt}  {c |}   >500   15.42969    47.98243
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
     education {c |}{res}       203{txt}{space 10}{res}     6,164{txt}  {c |}     25          1          24
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
    log_income {c |}{res}       404{txt}{space 10}{res}     5,963{txt}  {c |}    222  -5.926926    8.922658
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{com}. 
.   // Keep only the variables of interest.
.   keep y* $imputeds $regulars TrialOne_adverse_pregoutc
. {c )-}
{txt}
{com}. 
. 
{txt}end of do-file

{com}. // do data/impute
. 
. // Import the process outcome data.
. do data/process_outcomes
{txt}
{com}. version 16.1
{txt}
{com}. 
. foreach outcome of global process_outcomes {c -(}
{txt}  2{com}.   frame create `outcome'
{txt}  3{com}.   frame `outcome' {c -(}
{txt}  4{com}.     // Load the data and check its signature is as expected.
.     use "${c -(}fname_`outcome'{c )-}", replace
{txt}  5{com}.     datasignature
{txt}  6{com}.     assert r(datasignature) == "${c -(}datasignature_`outcome'{c )-}"
{txt}  7{com}. 
.     // Encode/rename arm and cluster identifier variables.
.     encode prettyExposure, generate(arm)
{txt}  8{com}.     rename str_TRIAL_1_Cluster clusterid
{txt}  9{com}. 
.     // Compute the cluster size from the trial data. We use the trial data for
.     // simplicity and have verified that these agree with the "baseline" data on
.     // trial size. We divide by 100 because cluster sizes range from about 10 to
.     // about 220, and we want to get regression coefficients that are non-null
.     // within two decimal places! Note that cluster size computation must be
.     // done before the data set is reshaped to long format, or we will count
.     // one enrollment per visit rather than pregnancy.
.     by clusterid, sort: generate cluster_size = _N / 100
{txt} 10{com}. 
.     // Reshape to long format. Note that the uniqueid variable is not actually
.     // unique but identifies women, who can have multiple pregnancies (but not
.     // twins in this data set). Rows in the wide data frame are pregnancies, so
.     // we simply generate a unique pregnancy number for each row. We generate a 
.     // visit variable, as each woman (pregnancy) may attend clinic multiple times. 
.     generate pregnancy = _n
{txt} 11{com}.     local stubs opportunity_`outcome'_ success_`outcome'_
{txt} 12{com}.     reshape long `stubs', i(pregnancy) j(visit)
{txt} 13{com}. 
.     // While the outcome variable is a factor with three levels, we are only 
.     // interested in the relative odds of success. The other levels are 
.     // "NOT SUCCESSFUL" and "NOT APPLICABLE". Not applicable is not of 
.     // scientific interest here.
.     local success_label_name = "`: value label success_`outcome'_'"
{txt} 14{com}.     drop if      success_`outcome'_ == "NOT APPLICABLE":`success_label_name'
{txt} 15{com}.     generate y = success_`outcome'_ == "SUCCESSFUL":`success_label_name'
{txt} 16{com}. 
.     // Convert the stratification variable from string to integer.
.     encode bookorgdistricthashed, generate(strat_var)
{txt} 17{com}. 
.     // Generate an indicator for whether each woman is aged > 40 years.
.     generate age_over_40 = age > 40
{txt} 18{com}.     label values age_over_40 yes_no_label
{txt} 19{com}.     
.     // Generate an indicator for whether each woman is primiparous.
.     rename bookprimi primiparous
{txt} 20{com}.     label values primiparous yes_no_label
{txt} 21{com}. 
.     // Keep only the variables of interest.
.     keep y arm pregnancy visit clusterid $adj_var_names
{txt} 22{com}. 
.     // Label the variables
.     label variable y             "Successful `outcome'"
{txt} 23{com}.     label variable arm           "Study arm"
{txt} 24{com}.     label variable pregnancy     "Pregnancy"
{txt} 25{com}.     label variable clusterid     "Cluster"
{txt} 26{com}.     label variable strat_var     "District"
{txt} 27{com}.     label variable lab_available "Lab availability"
{txt} 28{com}.     label variable cluster_size  "Cluster size" // 100s of new enrollments
{txt} 29{com}.     label variable age_over_40   "Age"          // Indicator of age > 40.
{txt} 30{com}.     label variable primiparous   "Parity"       // Indicator of primiparity.
{txt} 31{com}. 
.     // Label values.
.     label define lab_available_label 1 "Lab" 0 "No lab"
{txt} 32{com}.     label values lab_available lab_available_label
{txt} 33{com}.     label define age_over_40_label 1 ">40 years" 0 "≤40 years"
{txt} 34{com}.     label values age_over_40 age_over_40_label
{txt} 35{com}.     label define primiparous_label 1 "Primiparous" 0 "Multiparous"
{txt} 36{com}.     label values primiparous primiparous_label
{txt} 37{com}. 
.     // There should be no missing data.
.     misstable summarize, all
{txt} 38{com}.     assert r(N_lt_dot) == _N
{txt} 39{com}. 
.     // For most of the process outcomes, we have multiple visits within
.     // pregnancy; we model the cluster-randomized design in the estimation.
.     // For malpresentation, there is only one visit and so cluster can be the
.     // panel variable. Note that the xtlogit-based analysis with cluster as the
.     // panel variable gives identical point estimates and confidence intervals
.     // as a melogit-based analysis with cluster as the random effect.
.     if "`outcome'" != "malpresentation" xtset pregnancy visit
{txt} 40{com}.     if "`outcome'" == "malpresentation" xtset clusterid
{txt} 41{com}. 
.     // TODO: If you generate an OR for this analysis, switch the birth outcomes
.     // to OR, too. Make sure you update the report text if you change the link.
. 
.     // TODO: Probably report OR and assumed and corresponding risks.
.   {c )-}
{txt} 42{com}. {c )-}
  {res}6367:39(51496):3578513271:2127801624
{txt}(note: j = 1 2 3 4 5)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    6367   {txt}->{res}   31835
{txt}Number of variables            {res}      42   {txt}->{res}      35
{txt}j variable (5 values)                     ->   {res}visit
{txt}xij variables:
{res}opportunity_attendance_1 opportunity_attendance_2 ... opportunity_attendance_5{txt}->{res}opportunity_attendance_
success_attendance_1 success_attendance_2 ... success_attendance_5{txt}->{res}success_attendance_
{txt}{hline 77}
(10,132 observations deleted)
{res}{txt}{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
     pregnancy {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}   >500          2        6367
         visit {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      5          1           5
     clusterid {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}    119          1         120
   primiparous {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      2          0           1
  lab_availa~e {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      2          0           1
           arm {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      2          1           2
  cluster_size {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}     70        .09        2.17
             y {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      2          0           1
     strat_var {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      5          1           5
   age_over_40 {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{res}{txt}{col 8}panel variable:  {res}pregnancy (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}visit, 1 to 5
{txt}{col 17}delta:  {res}1 unit
  6367:60(68365):3970041110:3735367683
{txt}(note: j = 1 2 3 4 5 6 7 8)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    6367   {txt}->{res}   50936
{txt}Number of variables            {res}      63   {txt}->{res}      50
{txt}j variable (8 values)                     ->   {res}visit
{txt}xij variables:
{res}opportunity_hypertension_1 opportunity_hypertension_2 ... opportunity_hypertension_8{txt}->{res}opportunity_hypertension_
success_hypertension_1 success_hypertension_2 ... success_hypertension_8{txt}->{res}success_hypertension_
{txt}{hline 77}
(35,383 observations deleted)
{res}{txt}{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
     pregnancy {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}   >500          1        6367
         visit {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      8          1           8
     clusterid {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}    119          1         120
   primiparous {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      2          0           1
  lab_availa~e {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      2          0           1
           arm {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      2          1           2
  cluster_size {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}     70        .09        2.17
             y {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      2          0           1
     strat_var {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      5          1           5
   age_over_40 {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{res}{txt}{col 8}panel variable:  {res}pregnancy (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}visit, 1 to 8, but with gaps
{txt}{col 17}delta:  {res}1 unit
  6367:38(91264):1895688975:3113856828
{txt}(note: j = 1 2 3 4)
(note: success_diabetes_2 not found)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    6367   {txt}->{res}   25468
{txt}Number of variables            {res}      41   {txt}->{res}      37
{txt}j variable (4 values)                     ->   {res}visit
{txt}xij variables:
{res}opportunity_diabetes_1 opportunity_diabetes_2 ... opportunity_diabetes_4{txt}->{res}opportunity_diabetes_
success_diabetes_1 success_diabetes_2 ... success_diabetes_4{txt}->{res}success_diabetes_
{txt}{hline 77}
(13,340 observations deleted)
{res}{txt}{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
     pregnancy {c |}{space 10}{space 10}{res}    12,128{txt}  {c |}   >500          1        6367
         visit {c |}{space 10}{space 10}{res}    12,128{txt}  {c |}      4          1           4
     clusterid {c |}{space 10}{space 10}{res}    12,128{txt}  {c |}    119          1         120
   primiparous {c |}{space 10}{space 10}{res}    12,128{txt}  {c |}      2          0           1
  lab_availa~e {c |}{space 10}{space 10}{res}    12,128{txt}  {c |}      2          0           1
           arm {c |}{space 10}{space 10}{res}    12,128{txt}  {c |}      2          1           2
  cluster_size {c |}{space 10}{space 10}{res}    12,128{txt}  {c |}     70        .09        2.17
             y {c |}{space 10}{space 10}{res}    12,128{txt}  {c |}      2          0           1
     strat_var {c |}{space 10}{space 10}{res}    12,128{txt}  {c |}      5          1           5
   age_over_40 {c |}{space 10}{space 10}{res}    12,128{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{res}{txt}{col 8}panel variable:  {res}pregnancy (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}visit, 1 to 4, but with gaps
{txt}{col 17}delta:  {res}1 unit
  6367:31(88392):1586201653:3483051938
{txt}(note: j = 1)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    6367   {txt}->{res}    6367
{txt}Number of variables            {res}      34   {txt}->{res}      35
{txt}j variable (1 values)                     ->   {res}visit
{txt}xij variables:
          {res}opportunity_malpresentation_1   {txt}->   {res}opportunity_malpresentation_
              success_malpresentation_1   {txt}->   {res}success_malpresentation_
{txt}{hline 77}
(4,427 observations deleted)
{res}{txt}{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
     pregnancy {c |}{space 10}{space 10}{res}     1,940{txt}  {c |}   >500          6        6364
         visit {c |}{space 10}{space 10}{res}     1,940{txt}  {c |}      1          1           1
     clusterid {c |}{space 10}{space 10}{res}     1,940{txt}  {c |}    116          1         120
   primiparous {c |}{space 10}{space 10}{res}     1,940{txt}  {c |}      2          0           1
  lab_availa~e {c |}{space 10}{space 10}{res}     1,940{txt}  {c |}      2          0           1
           arm {c |}{space 10}{space 10}{res}     1,940{txt}  {c |}      2          1           2
  cluster_size {c |}{space 10}{space 10}{res}     1,940{txt}  {c |}     68         .1        2.17
             y {c |}{space 10}{space 10}{res}     1,940{txt}  {c |}      2          0           1
     strat_var {c |}{space 10}{space 10}{res}     1,940{txt}  {c |}      5          1           5
   age_over_40 {c |}{space 10}{space 10}{res}     1,940{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 8}panel variable:  {res}clusterid (unbalanced)
{txt}
{com}. 
{txt}end of do-file

{com}. 
. // TODO: Reinstate
. // // Do estimation.
. // do estimation/missing          // Calculate percentage of data missing.
. // do estimation/mcar             // Test the MCAR hypothesis.
. // do estimation/birth_outcomes   // Analyze the birth outcome data.
. do estimation/process_outcomes    // Analyze process outcome data.
{txt}
{com}. version 16.1
{txt}
{com}. 
. foreach outcome of global process_outcomes {c -(}
{txt}  2{com}.   frame `outcome' {c -(}
{txt}  3{com}.     local vce_opts vce(cluster clusterid)
{txt}  4{com}.     if "`outcome'" == "malpresentation" local vce_opts ""
{txt}  5{com}.     xtlogit y i.arm $adj_vars, `vce_opts' or
{txt}  6{com}.     estimates store `outcome'_estimates
{txt}  7{com}. 
.     // TODO: As an alternative to the "spider plots" proposed in the protocol to
.     // study the association between outcomes and variables such as cluster size,
.     // we could make margin plots, along the following lines:
.     // estimates restore `outcome'_estimates
.     // frame change `outcome' // Make sure we have the correct frame.
.     // margins i.arm, at(cluster_size = (2(1)7))
.     //   // Compute margins for each level of arm, at values of cluster size from
.     //   // 2 to 7.
.     // marginsplot
.     // margins i.arm#i.age_over_40 // This is the syntax for a factor variable.
.   {c )-}
{txt}  8{com}. {c )-}

{txt}Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-14897.323}  
Iteration 1:{space 3}log pseudolikelihood = {res:-14594.293}  
Iteration 2:{space 3}log pseudolikelihood = {res:-14593.941}  
Iteration 3:{space 3}log pseudolikelihood = {res:-14593.941}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log pseudolikelihood = {res}-14593.941
{txt}tau = {res} 0.1     {txt}log pseudolikelihood = {res}-14374.713
{txt}tau = {res} 0.2     {txt}log pseudolikelihood = {res}-14183.334
{txt}tau = {res} 0.3     {txt}log pseudolikelihood = {res}-14019.266
{txt}tau = {res} 0.4     {txt}log pseudolikelihood = {res}-13884.037
{txt}tau = {res} 0.5     {txt}log pseudolikelihood = {res}-13782.516
{txt}tau = {res} 0.6     {txt}log pseudolikelihood = {res}-13725.748
{txt}tau = {res} 0.7     {txt}log pseudolikelihood = {res} -13738.46

{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-13725.748}  
Iteration 1:{space 3}log pseudolikelihood = {res:-13697.705}  
Iteration 2:{space 3}log pseudolikelihood = {res:-13697.697}  
Iteration 3:{space 3}log pseudolikelihood = {res:-13697.697}  
{res}
{txt}Calculating robust standard errors:

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    21,703
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     5,200

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       4.2
{txt}{col 63}max{col 67}={col 69}{res}         5

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    87.65
{txt}Log pseudolikelihood  = {res}-13697.697{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 79:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}F  {c |}{col 15}{res}{space 2}     1.18{col 27}{space 2}     0.13{col 38}{space 1}    1.46{col 47}{space 3} 0.15{col 55}{space 4}     0.95{col 68}{space 3}     1.47
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.59{col 27}{space 2}     0.11{col 38}{space 1}   -2.93{col 47}{space 3} 0.00{col 55}{space 4}     0.41{col 68}{space 3}     0.84
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     1.38{col 27}{space 2}     0.26{col 38}{space 1}    1.72{col 47}{space 3} 0.09{col 55}{space 4}     0.96{col 68}{space 3}     1.98
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.19{col 27}{space 2}     0.20{col 38}{space 1}    1.04{col 47}{space 3} 0.30{col 55}{space 4}     0.86{col 68}{space 3}     1.67
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.75{col 27}{space 2}     0.30{col 38}{space 1}    3.24{col 47}{space 3} 0.00{col 55}{space 4}     1.25{col 68}{space 3}     2.47
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     1.52{col 27}{space 2}     0.20{col 38}{space 1}    3.19{col 47}{space 3} 0.00{col 55}{space 4}     1.18{col 68}{space 3}     1.98
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.00{col 27}{space 2}     0.12{col 38}{space 1}   -0.03{col 47}{space 3} 0.97{col 55}{space 4}     0.78{col 68}{space 3}     1.27
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}>40 years  {c |}{col 15}{res}{space 2}     0.49{col 27}{space 2}     0.16{col 38}{space 1}   -2.21{col 47}{space 3} 0.03{col 55}{space 4}     0.26{col 68}{space 3}     0.92
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Primiparous  {c |}{col 15}{res}{space 2}     0.96{col 27}{space 2}     0.06{col 38}{space 1}   -0.64{col 47}{space 3} 0.53{col 55}{space 4}     0.85{col 68}{space 3}     1.08
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.43{col 27}{space 2}     0.08{col 38}{space 1}   -4.31{col 47}{space 3} 0.00{col 55}{space 4}     0.29{col 68}{space 3}     0.63
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}     0.61{col 27}{space 2}     0.08{col 55}{space 4}     0.45{col 68}{space 3}     0.76
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     1.35{col 27}{space 2}     0.05{col 55}{space 4}     1.25{col 68}{space 3}     1.46
{txt}          rho {c |}{col 15}{res}{space 2}     0.36{col 27}{space 2}     0.02{col 55}{space 4}     0.32{col 68}{space 3}     0.39
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res: -2808.663}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2777.8563}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2776.7409}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2776.7354}  
Iteration 4:{space 3}log pseudolikelihood = {res:-2776.7354}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log pseudolikelihood = {res}-2776.7354
{txt}tau = {res} 0.1     {txt}log pseudolikelihood = {res}-2773.0986
{txt}tau = {res} 0.2     {txt}log pseudolikelihood = {res}-2771.7675
{txt}tau = {res} 0.3     {txt}log pseudolikelihood = {res}-2774.9896

{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-2771.7675}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2765.2636}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2760.3205}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2760.2648}  
Iteration 4:{space 3}log pseudolikelihood = {res:-2760.2644}  
Iteration 5:{space 3}log pseudolikelihood = {res:-2760.2644}  
{res}
{txt}Calculating robust standard errors:

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    15,553
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     6,013

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       2.6
{txt}{col 63}max{col 67}={col 69}{res}         6

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    59.80
{txt}Log pseudolikelihood  = {res}-2760.2644{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 79:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}J  {c |}{col 15}{res}{space 2}     0.60{col 27}{space 2}     0.07{col 38}{space 1}   -4.24{col 47}{space 3} 0.00{col 55}{space 4}     0.48{col 68}{space 3}     0.76
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.16{col 27}{space 2}     0.24{col 38}{space 1}    0.73{col 47}{space 3} 0.46{col 55}{space 4}     0.78{col 68}{space 3}     1.74
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     1.51{col 27}{space 2}     0.27{col 38}{space 1}    2.34{col 47}{space 3} 0.02{col 55}{space 4}     1.07{col 68}{space 3}     2.13
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.21{col 27}{space 2}     0.22{col 38}{space 1}    1.01{col 47}{space 3} 0.31{col 55}{space 4}     0.84{col 68}{space 3}     1.74
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.74{col 27}{space 2}     0.31{col 38}{space 1}    3.11{col 47}{space 3} 0.00{col 55}{space 4}     1.23{col 68}{space 3}     2.47
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.94{col 27}{space 2}     0.10{col 38}{space 1}   -0.58{col 47}{space 3} 0.56{col 55}{space 4}     0.76{col 68}{space 3}     1.16
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.15{col 27}{space 2}     0.15{col 38}{space 1}    1.11{col 47}{space 3} 0.27{col 55}{space 4}     0.90{col 68}{space 3}     1.47
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}>40 years  {c |}{col 15}{res}{space 2}     0.50{col 27}{space 2}     0.15{col 38}{space 1}   -2.34{col 47}{space 3} 0.02{col 55}{space 4}     0.28{col 68}{space 3}     0.89
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Primiparous  {c |}{col 15}{res}{space 2}     1.02{col 27}{space 2}     0.11{col 38}{space 1}    0.16{col 47}{space 3} 0.87{col 55}{space 4}     0.83{col 68}{space 3}     1.25
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}    30.86{col 27}{space 2}     7.28{col 38}{space 1}   14.54{col 47}{space 3} 0.00{col 55}{space 4}    19.44{col 68}{space 3}    48.99
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -0.17{col 27}{space 2}     0.26{col 55}{space 4}    -0.68{col 68}{space 3}     0.34
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.92{col 27}{space 2}     0.12{col 55}{space 4}     0.71{col 68}{space 3}     1.19
{txt}          rho {c |}{col 15}{res}{space 2}     0.20{col 27}{space 2}     0.04{col 55}{space 4}     0.13{col 68}{space 3}     0.30
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-6178.6866}  
Iteration 1:{space 3}log pseudolikelihood = {res:-5927.0622}  
Iteration 2:{space 3}log pseudolikelihood = {res:-5920.4888}  
Iteration 3:{space 3}log pseudolikelihood = {res:-5920.4822}  
Iteration 4:{space 3}log pseudolikelihood = {res:-5920.4822}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log pseudolikelihood = {res}-5920.4822
{txt}tau = {res} 0.1     {txt}log pseudolikelihood = {res}-5955.5333

{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-5955.5333}  
Iteration 1:{space 3}log pseudolikelihood = {res:-5920.9337}  
Iteration 2:{space 3}log pseudolikelihood = {res:-5920.5786}  
Iteration 3:{space 3}log pseudolikelihood = {res:-5920.4972}  
Iteration 4:{space 3}log pseudolikelihood = {res: -5920.484}  
Iteration 5:{space 3}log pseudolikelihood = {res:-5920.4825}  
Iteration 6:{space 3}log pseudolikelihood = {res:-5920.4824}  
Iteration 7:{space 3}log pseudolikelihood = {res:-5920.4824}  
Iteration 8:{space 3}log pseudolikelihood = {res:-5920.4824}  
{res}
{txt}Calculating robust standard errors:

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    12,128
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     6,367

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       1.9
{txt}{col 63}max{col 67}={col 69}{res}         3

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    76.16
{txt}Log pseudolikelihood  = {res}-5920.4824{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 79:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}L  {c |}{col 15}{res}{space 2}     1.46{col 27}{space 2}     0.18{col 38}{space 1}    3.13{col 47}{space 3} 0.00{col 55}{space 4}     1.15{col 68}{space 3}     1.85
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.68{col 27}{space 2}     0.13{col 38}{space 1}   -2.10{col 47}{space 3} 0.04{col 55}{space 4}     0.47{col 68}{space 3}     0.97
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.57{col 27}{space 2}     0.13{col 38}{space 1}   -2.42{col 47}{space 3} 0.02{col 55}{space 4}     0.36{col 68}{space 3}     0.90
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.49{col 27}{space 2}     0.10{col 38}{space 1}   -3.37{col 47}{space 3} 0.00{col 55}{space 4}     0.33{col 68}{space 3}     0.74
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.72{col 27}{space 2}     0.11{col 38}{space 1}   -2.10{col 47}{space 3} 0.04{col 55}{space 4}     0.53{col 68}{space 3}     0.98
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     1.40{col 27}{space 2}     0.20{col 38}{space 1}    2.28{col 47}{space 3} 0.02{col 55}{space 4}     1.05{col 68}{space 3}     1.86
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.97{col 27}{space 2}     0.29{col 38}{space 1}    4.54{col 47}{space 3} 0.00{col 55}{space 4}     1.47{col 68}{space 3}     2.63
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}>40 years  {c |}{col 15}{res}{space 2}     1.07{col 27}{space 2}     0.25{col 38}{space 1}    0.27{col 47}{space 3} 0.79{col 55}{space 4}     0.67{col 68}{space 3}     1.70
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Primiparous  {c |}{col 15}{res}{space 2}     1.06{col 27}{space 2}     0.05{col 38}{space 1}    1.20{col 47}{space 3} 0.23{col 55}{space 4}     0.96{col 68}{space 3}     1.17
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.15{col 27}{space 2}     0.03{col 38}{space 1}  -10.31{col 47}{space 3} 0.00{col 55}{space 4}     0.11{col 68}{space 3}     0.22
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}   -14.34{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1009.6529}  
Iteration 1:{space 3}log likelihood = {res:-958.83674}  
Iteration 2:{space 3}log likelihood = {res:-955.11475}  
Iteration 3:{space 3}log likelihood = {res:-955.09176}  
Iteration 4:{space 3}log likelihood = {res:-955.09175}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log likelihood = {res}-955.09175
{txt}tau = {res} 0.1     {txt}log likelihood = {res}-931.65344
{txt}tau = {res} 0.2     {txt}log likelihood = {res}-920.17277
{txt}tau = {res} 0.3     {txt}log likelihood = {res}-914.53822
{txt}tau = {res} 0.4     {txt}log likelihood = {res}-912.51274
{txt}tau = {res} 0.5     {txt}log likelihood = {res}-913.69064

{txt}Iteration 0:{space 3}log likelihood = {res:-912.59529}  
Iteration 1:{space 3}log likelihood = {res:-910.16124}  
Iteration 2:{space 3}log likelihood = {res:-910.09286}  
Iteration 3:{space 3}log likelihood = {res:-910.09283}  
{res}
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     1,940
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       116

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}      16.7
{txt}{col 63}max{col 67}={col 69}{res}       113

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    35.08
{txt}Log likelihood  = {res}-910.09283{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0001

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}B  {c |}{col 15}{res}{space 2}     1.42{col 27}{space 2}     0.31{col 38}{space 1}    1.61{col 47}{space 3} 0.11{col 55}{space 4}     0.93{col 68}{space 3}     2.18
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.45{col 27}{space 2}     0.56{col 38}{space 1}    0.95{col 47}{space 3} 0.34{col 55}{space 4}     0.68{col 68}{space 3}     3.09
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     3.60{col 27}{space 2}     1.85{col 38}{space 1}    2.49{col 47}{space 3} 0.01{col 55}{space 4}     1.31{col 68}{space 3}     9.88
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.28{col 27}{space 2}     0.46{col 38}{space 1}    0.70{col 47}{space 3} 0.49{col 55}{space 4}     0.64{col 68}{space 3}     2.57
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.79{col 27}{space 2}     0.66{col 38}{space 1}    1.59{col 47}{space 3} 0.11{col 55}{space 4}     0.87{col 68}{space 3}     3.67
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     2.55{col 27}{space 2}     0.85{col 38}{space 1}    2.81{col 47}{space 3} 0.01{col 55}{space 4}     1.33{col 68}{space 3}     4.92
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.55{col 27}{space 2}     0.40{col 38}{space 1}    1.70{col 47}{space 3} 0.09{col 55}{space 4}     0.94{col 68}{space 3}     2.57
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}>40 years  {c |}{col 15}{res}{space 2}     0.52{col 27}{space 2}     0.29{col 38}{space 1}   -1.17{col 47}{space 3} 0.24{col 55}{space 4}     0.18{col 68}{space 3}     1.55
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Primiparous  {c |}{col 15}{res}{space 2}     1.48{col 27}{space 2}     0.23{col 38}{space 1}    2.56{col 47}{space 3} 0.01{col 55}{space 4}     1.10{col 68}{space 3}     1.99
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.86{col 27}{space 2}     0.33{col 38}{space 1}   -0.40{col 47}{space 3} 0.69{col 55}{space 4}     0.41{col 68}{space 3}     1.82
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -0.28{col 27}{space 2}     0.24{col 55}{space 4}    -0.75{col 68}{space 3}     0.19
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.87{col 27}{space 2}     0.10{col 55}{space 4}     0.69{col 68}{space 3}     1.10
{txt}          rho {c |}{col 15}{res}{space 2}     0.19{col 27}{space 2}     0.04{col 55}{space 4}     0.13{col 68}{space 3}     0.27
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}90.00{col 56}{txt}Prob >= chibar2 = {res}0.000
{txt}
{com}. 
{txt}end of do-file

{com}. 
. // TODO: Reinstate
. // // Make figures
. // do figures/imputation
. do figures/margins
{txt}
{com}. version 16.1
{txt}
{com}. 
. set graphics off
{txt}
{com}. 
. // Define the names and number of variables over which to make marginsplots.
. local margin_vars = ustrtrim(usubinstr("$adj_var_names", "strat_var", "", .))
{txt}
{com}. local n_plots = wordcount("`margin_vars'")
{txt}
{com}. 
. foreach outcome of global process_outcomes {c -(}
{txt}  2{com}.   frame `outcome' {c -(}
{txt}  3{com}.     estimates restore `outcome'_estimates
{txt}  4{com}. 
.     foreach var of local margin_vars {c -(}
{txt}  5{com}.       if "`var'" == "cluster_size" {c -(}
{txt}  6{com}.         margins i.arm, at(cluster_size = (0.1 1 2))
{txt}  7{com}.         local xscale          xscale(range(0 2.25)) 
{txt}  8{com}.         local xscale `xscale' xlabel(0.1 "10" 1 "100" 2 "200")
{txt}  9{com}.         local ylabel ylabel(0 "0" 0.2 "0.2" 0.4 "0.4" 0.6 "0.6" 0.8 "0.8" 1.0 "1")
{txt} 10{com}.       {c )-}
{txt} 11{com}.       else {c -(}
{txt} 12{com}.         margins i.arm#`var'
{txt} 13{com}.         local xscale
{txt} 14{com}.         local ylabel ylabel(0 " " 0.2 " " 0.4 " " 0.6 " " 0.8 " " 1.0 " ")
{txt} 15{com}.       {c )-}
{txt} 16{com}. 
.       local var_label : variable label `var'
{txt} 17{com}.       marginsplot, yscale(range(0 1)) `ylabel' ytitle("")  ///
>                   `xscale'                                ///
>                   title("`var_label'", span)              ///
>                   legend(cols(1) region(color(white)))    ///
>                   graphregion(color(white))               ///
>                   plotregion(color(white))                ///
>                   bgcolor(white)                          ///
>                   name(`var', replace)
{txt} 18{com}.     {c )-}
{txt} 19{com}. 
.     graph combine `margin_vars', cols(`n_plots')           ///
>                                 graphregion(color(white)) ///
>                                 plotregion(color(white))
{txt} 20{com}.     global `outcome'_margins_fname "products/Margins - `outcome'"
{txt} 21{com}.     graph export "${c -(}`outcome'_margins_fname{c )-}.pdf", replace
{txt} 22{com}.     graph export "${c -(}`outcome'_margins_fname{c )-}.png", replace
{txt} 23{com}.   {c )-}
{txt} 24{com}. {c )-}
{txt}(results {stata estimates replay attendance_estimates:attendance_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    21,703
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 9}.1}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}_at#arm {c |}
{space 8}1#E  {c |}{col 14}{res}{space 2}     0.37{col 26}{space 2}     0.02{col 37}{space 1}   17.56{col 46}{space 3} 0.00{col 54}{space 4}     0.33{col 67}{space 3}     0.41
{txt}{space 8}1#F  {c |}{col 14}{res}{space 2}     0.40{col 26}{space 2}     0.02{col 37}{space 1}   23.66{col 46}{space 3} 0.00{col 54}{space 4}     0.36{col 67}{space 3}     0.43
{txt}{space 8}2#E  {c |}{col 14}{res}{space 2}     0.44{col 26}{space 2}     0.01{col 37}{space 1}   33.83{col 46}{space 3} 0.00{col 54}{space 4}     0.41{col 67}{space 3}     0.46
{txt}{space 8}2#F  {c |}{col 14}{res}{space 2}     0.47{col 26}{space 2}     0.02{col 37}{space 1}   25.73{col 46}{space 3} 0.00{col 54}{space 4}     0.43{col 67}{space 3}     0.50
{txt}{space 8}3#E  {c |}{col 14}{res}{space 2}     0.51{col 26}{space 2}     0.03{col 37}{space 1}   16.73{col 46}{space 3} 0.00{col 54}{space 4}     0.45{col 67}{space 3}     0.57
{txt}{space 8}3#F  {c |}{col 14}{res}{space 2}     0.54{col 26}{space 2}     0.04{col 37}{space 1}   14.12{col 46}{space 3} 0.00{col 54}{space 4}     0.47{col 67}{space 3}     0.62
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: cluster_size arm{p_end}
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    21,703
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31} Delta-method
{col 19}{c |}     Margin{col 31}   Std. Err.{col 43}      z{col 51}   P>|z|{col 59}     [95% Con{col 72}f. Interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
arm#lab_available {c |}
{space 8}E#No lab  {c |}{col 19}{res}{space 2}     0.42{col 31}{space 2}     0.02{col 42}{space 1}   23.38{col 51}{space 3} 0.00{col 59}{space 4}     0.39{col 72}{space 3}     0.46
{txt}{space 11}E#Lab  {c |}{col 19}{res}{space 2}     0.42{col 31}{space 2}     0.02{col 42}{space 1}   27.65{col 51}{space 3} 0.00{col 59}{space 4}     0.39{col 72}{space 3}     0.45
{txt}{space 8}F#No lab  {c |}{col 19}{res}{space 2}     0.45{col 31}{space 2}     0.02{col 42}{space 1}   22.49{col 51}{space 3} 0.00{col 59}{space 4}     0.41{col 72}{space 3}     0.49
{txt}{space 11}F#Lab  {c |}{col 19}{res}{space 2}     0.45{col 31}{space 2}     0.02{col 42}{space 1}   25.19{col 51}{space 3} 0.00{col 59}{space 4}     0.41{col 72}{space 3}     0.48
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: arm lab_available{p_end}
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    21,703
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
arm#age_over_40 {c |}
{space 3}E#≤40 years  {c |}{col 17}{res}{space 2}     0.42{col 29}{space 2}     0.01{col 40}{space 1}   34.09{col 49}{space 3} 0.00{col 57}{space 4}     0.40{col 70}{space 3}     0.45
{txt}{space 3}E#>40 years  {c |}{col 17}{res}{space 2}     0.30{col 29}{space 2}     0.05{col 40}{space 1}    5.87{col 49}{space 3} 0.00{col 57}{space 4}     0.20{col 70}{space 3}     0.40
{txt}{space 3}F#≤40 years  {c |}{col 17}{res}{space 2}     0.45{col 29}{space 2}     0.02{col 40}{space 1}   29.37{col 49}{space 3} 0.00{col 57}{space 4}     0.42{col 70}{space 3}     0.48
{txt}{space 3}F#>40 years  {c |}{col 17}{res}{space 2}     0.33{col 29}{space 2}     0.05{col 40}{space 1}    6.29{col 49}{space 3} 0.00{col 57}{space 4}     0.23{col 70}{space 3}     0.43
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: arm age_over_40{p_end}
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    21,703
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
arm#primiparous {c |}
{space 1}E#Multiparous  {c |}{col 17}{res}{space 2}     0.42{col 29}{space 2}     0.01{col 40}{space 1}   32.24{col 49}{space 3} 0.00{col 57}{space 4}     0.40{col 70}{space 3}     0.45
{txt}{space 1}E#Primiparous  {c |}{col 17}{res}{space 2}     0.42{col 29}{space 2}     0.01{col 40}{space 1}   30.79{col 49}{space 3} 0.00{col 57}{space 4}     0.39{col 70}{space 3}     0.44
{txt}{space 1}F#Multiparous  {c |}{col 17}{res}{space 2}     0.45{col 29}{space 2}     0.01{col 40}{space 1}   30.09{col 49}{space 3} 0.00{col 57}{space 4}     0.42{col 70}{space 3}     0.48
{txt}{space 1}F#Primiparous  {c |}{col 17}{res}{space 2}     0.44{col 29}{space 2}     0.02{col 40}{space 1}   23.87{col 49}{space 3} 0.00{col 57}{space 4}     0.41{col 70}{space 3}     0.48
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: arm primiparous{p_end}
{res}{txt}(file products/Margins - attendance.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Margins - attendance.png written in PNG format)
(results {stata estimates replay hypertension_estimates:hypertension_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    15,553
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 9}.1}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}_at#arm {c |}
{space 8}1#I  {c |}{col 14}{res}{space 2}     0.97{col 26}{space 2}     0.00{col 37}{space 1}  231.36{col 46}{space 3} 0.00{col 54}{space 4}     0.96{col 67}{space 3}     0.98
{txt}{space 8}1#J  {c |}{col 14}{res}{space 2}     0.95{col 26}{space 2}     0.00{col 37}{space 1}  217.33{col 46}{space 3} 0.00{col 54}{space 4}     0.94{col 67}{space 3}     0.96
{txt}{space 8}2#I  {c |}{col 14}{res}{space 2}     0.97{col 26}{space 2}     0.00{col 37}{space 1}  310.10{col 46}{space 3} 0.00{col 54}{space 4}     0.96{col 67}{space 3}     0.97
{txt}{space 8}2#J  {c |}{col 14}{res}{space 2}     0.95{col 26}{space 2}     0.00{col 37}{space 1}  293.44{col 46}{space 3} 0.00{col 54}{space 4}     0.94{col 67}{space 3}     0.95
{txt}{space 8}3#I  {c |}{col 14}{res}{space 2}     0.96{col 26}{space 2}     0.00{col 37}{space 1}  197.15{col 46}{space 3} 0.00{col 54}{space 4}     0.95{col 67}{space 3}     0.97
{txt}{space 8}3#J  {c |}{col 14}{res}{space 2}     0.94{col 26}{space 2}     0.01{col 37}{space 1}  125.55{col 46}{space 3} 0.00{col 54}{space 4}     0.93{col 67}{space 3}     0.96
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: cluster_size arm{p_end}
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    15,553
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31} Delta-method
{col 19}{c |}     Margin{col 31}   Std. Err.{col 43}      z{col 51}   P>|z|{col 59}     [95% Con{col 72}f. Interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
arm#lab_available {c |}
{space 8}I#No lab  {c |}{col 19}{res}{space 2}     0.96{col 31}{space 2}     0.00{col 42}{space 1}  215.66{col 51}{space 3} 0.00{col 59}{space 4}     0.95{col 72}{space 3}     0.97
{txt}{space 11}I#Lab  {c |}{col 19}{res}{space 2}     0.97{col 31}{space 2}     0.00{col 42}{space 1}  303.06{col 51}{space 3} 0.00{col 59}{space 4}     0.96{col 72}{space 3}     0.97
{txt}{space 8}J#No lab  {c |}{col 19}{res}{space 2}     0.94{col 31}{space 2}     0.00{col 42}{space 1}  192.00{col 51}{space 3} 0.00{col 59}{space 4}     0.93{col 72}{space 3}     0.95
{txt}{space 11}J#Lab  {c |}{col 19}{res}{space 2}     0.95{col 31}{space 2}     0.00{col 42}{space 1}  252.71{col 51}{space 3} 0.00{col 59}{space 4}     0.94{col 72}{space 3}     0.96
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: arm lab_available{p_end}
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    15,553
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
arm#age_over_40 {c |}
{space 3}I#≤40 years  {c |}{col 17}{res}{space 2}     0.97{col 29}{space 2}     0.00{col 40}{space 1}  308.88{col 49}{space 3} 0.00{col 57}{space 4}     0.96{col 70}{space 3}     0.97
{txt}{space 3}I#>40 years  {c |}{col 17}{res}{space 2}     0.94{col 29}{space 2}     0.02{col 40}{space 1}   56.14{col 49}{space 3} 0.00{col 57}{space 4}     0.90{col 70}{space 3}     0.97
{txt}{space 3}J#≤40 years  {c |}{col 17}{res}{space 2}     0.95{col 29}{space 2}     0.00{col 40}{space 1}  321.35{col 49}{space 3} 0.00{col 57}{space 4}     0.94{col 70}{space 3}     0.95
{txt}{space 3}J#>40 years  {c |}{col 17}{res}{space 2}     0.90{col 29}{space 2}     0.02{col 40}{space 1}   38.04{col 49}{space 3} 0.00{col 57}{space 4}     0.86{col 70}{space 3}     0.95
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: arm age_over_40{p_end}
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    15,553
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
arm#primiparous {c |}
{space 1}I#Multiparous  {c |}{col 17}{res}{space 2}     0.97{col 29}{space 2}     0.00{col 40}{space 1}  306.38{col 49}{space 3} 0.00{col 57}{space 4}     0.96{col 70}{space 3}     0.97
{txt}{space 1}I#Primiparous  {c |}{col 17}{res}{space 2}     0.97{col 29}{space 2}     0.00{col 40}{space 1}  227.83{col 49}{space 3} 0.00{col 57}{space 4}     0.96{col 70}{space 3}     0.97
{txt}{space 1}J#Multiparous  {c |}{col 17}{res}{space 2}     0.95{col 29}{space 2}     0.00{col 40}{space 1}  314.20{col 49}{space 3} 0.00{col 57}{space 4}     0.94{col 70}{space 3}     0.95
{txt}{space 1}J#Primiparous  {c |}{col 17}{res}{space 2}     0.95{col 29}{space 2}     0.01{col 40}{space 1}  183.09{col 49}{space 3} 0.00{col 57}{space 4}     0.94{col 70}{space 3}     0.96
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: arm primiparous{p_end}
{res}{txt}(file products/Margins - hypertension.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Margins - hypertension.png written in PNG format)
(results {stata estimates replay diabetes_estimates:diabetes_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    12,128
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 9}.1}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}_at#arm {c |}
{space 8}1#K  {c |}{col 14}{res}{space 2}     0.14{col 26}{space 2}     0.01{col 37}{space 1}   10.10{col 46}{space 3} 0.00{col 54}{space 4}     0.12{col 67}{space 3}     0.17
{txt}{space 8}1#L  {c |}{col 14}{res}{space 2}     0.20{col 26}{space 2}     0.02{col 37}{space 1}    9.99{col 46}{space 3} 0.00{col 54}{space 4}     0.16{col 67}{space 3}     0.23
{txt}{space 8}2#K  {c |}{col 14}{res}{space 2}     0.18{col 26}{space 2}     0.01{col 37}{space 1}   14.23{col 46}{space 3} 0.00{col 54}{space 4}     0.16{col 67}{space 3}     0.21
{txt}{space 8}2#L  {c |}{col 14}{res}{space 2}     0.25{col 26}{space 2}     0.02{col 37}{space 1}   13.86{col 46}{space 3} 0.00{col 54}{space 4}     0.21{col 67}{space 3}     0.28
{txt}{space 8}3#K  {c |}{col 14}{res}{space 2}     0.24{col 26}{space 2}     0.04{col 37}{space 1}    6.58{col 46}{space 3} 0.00{col 54}{space 4}     0.17{col 67}{space 3}     0.31
{txt}{space 8}3#L  {c |}{col 14}{res}{space 2}     0.31{col 26}{space 2}     0.04{col 37}{space 1}    7.18{col 46}{space 3} 0.00{col 54}{space 4}     0.23{col 67}{space 3}     0.39
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: cluster_size arm{p_end}
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    12,128
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31} Delta-method
{col 19}{c |}     Margin{col 31}   Std. Err.{col 43}      z{col 51}   P>|z|{col 59}     [95% Con{col 72}f. Interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
arm#lab_available {c |}
{space 8}K#No lab  {c |}{col 19}{res}{space 2}     0.12{col 31}{space 2}     0.01{col 42}{space 1}    8.70{col 51}{space 3} 0.00{col 59}{space 4}     0.09{col 72}{space 3}     0.15
{txt}{space 11}K#Lab  {c |}{col 19}{res}{space 2}     0.21{col 31}{space 2}     0.01{col 42}{space 1}   14.21{col 51}{space 3} 0.00{col 59}{space 4}     0.18{col 72}{space 3}     0.24
{txt}{space 8}L#No lab  {c |}{col 19}{res}{space 2}     0.17{col 31}{space 2}     0.02{col 42}{space 1}    9.48{col 51}{space 3} 0.00{col 59}{space 4}     0.13{col 72}{space 3}     0.20
{txt}{space 11}L#Lab  {c |}{col 19}{res}{space 2}     0.28{col 31}{space 2}     0.02{col 42}{space 1}   13.15{col 51}{space 3} 0.00{col 59}{space 4}     0.24{col 72}{space 3}     0.32
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: arm lab_available{p_end}
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    12,128
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
arm#age_over_40 {c |}
{space 3}K#≤40 years  {c |}{col 17}{res}{space 2}     0.18{col 29}{space 2}     0.01{col 40}{space 1}   15.48{col 49}{space 3} 0.00{col 57}{space 4}     0.15{col 70}{space 3}     0.20
{txt}{space 3}K#>40 years  {c |}{col 17}{res}{space 2}     0.19{col 29}{space 2}     0.03{col 40}{space 1}    5.31{col 49}{space 3} 0.00{col 57}{space 4}     0.12{col 70}{space 3}     0.25
{txt}{space 3}L#≤40 years  {c |}{col 17}{res}{space 2}     0.24{col 29}{space 2}     0.02{col 40}{space 1}   14.84{col 49}{space 3} 0.00{col 57}{space 4}     0.20{col 70}{space 3}     0.27
{txt}{space 3}L#>40 years  {c |}{col 17}{res}{space 2}     0.25{col 29}{space 2}     0.04{col 40}{space 1}    5.74{col 49}{space 3} 0.00{col 57}{space 4}     0.16{col 70}{space 3}     0.33
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: arm age_over_40{p_end}
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    12,128
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
arm#primiparous {c |}
{space 1}K#Multiparous  {c |}{col 17}{res}{space 2}     0.17{col 29}{space 2}     0.01{col 40}{space 1}   15.56{col 49}{space 3} 0.00{col 57}{space 4}     0.15{col 70}{space 3}     0.20
{txt}{space 1}K#Primiparous  {c |}{col 17}{res}{space 2}     0.18{col 29}{space 2}     0.01{col 40}{space 1}   13.83{col 49}{space 3} 0.00{col 57}{space 4}     0.16{col 70}{space 3}     0.21
{txt}{space 1}L#Multiparous  {c |}{col 17}{res}{space 2}     0.23{col 29}{space 2}     0.02{col 40}{space 1}   15.18{col 49}{space 3} 0.00{col 57}{space 4}     0.20{col 70}{space 3}     0.26
{txt}{space 1}L#Primiparous  {c |}{col 17}{res}{space 2}     0.24{col 29}{space 2}     0.02{col 40}{space 1}   12.94{col 49}{space 3} 0.00{col 57}{space 4}     0.21{col 70}{space 3}     0.28
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: arm primiparous{p_end}
{res}{txt}(file products/Margins - diabetes.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Margins - diabetes.png written in PNG format)
(results {stata estimates replay malpresentation_estimates:malpresentation_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}     1,940
{txt}{col 1}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 9}.1}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}_at#arm {c |}
{space 8}1#A  {c |}{col 14}{res}{space 2}     0.65{col 26}{space 2}     0.04{col 37}{space 1}   15.02{col 46}{space 3} 0.00{col 54}{space 4}     0.57{col 67}{space 3}     0.74
{txt}{space 8}1#B  {c |}{col 14}{res}{space 2}     0.72{col 26}{space 2}     0.04{col 37}{space 1}   17.15{col 46}{space 3} 0.00{col 54}{space 4}     0.63{col 67}{space 3}     0.80
{txt}{space 8}2#A  {c |}{col 14}{res}{space 2}     0.79{col 26}{space 2}     0.03{col 37}{space 1}   28.03{col 46}{space 3} 0.00{col 54}{space 4}     0.74{col 67}{space 3}     0.85
{txt}{space 8}2#B  {c |}{col 14}{res}{space 2}     0.84{col 26}{space 2}     0.02{col 37}{space 1}   35.02{col 46}{space 3} 0.00{col 54}{space 4}     0.79{col 67}{space 3}     0.89
{txt}{space 8}3#A  {c |}{col 14}{res}{space 2}     0.90{col 26}{space 2}     0.04{col 37}{space 1}   22.08{col 46}{space 3} 0.00{col 54}{space 4}     0.82{col 67}{space 3}     0.98
{txt}{space 8}3#B  {c |}{col 14}{res}{space 2}     0.93{col 26}{space 2}     0.03{col 37}{space 1}   29.53{col 46}{space 3} 0.00{col 54}{space 4}     0.86{col 67}{space 3}     0.99
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: cluster_size arm{p_end}
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}     1,940
{txt}{col 1}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31} Delta-method
{col 19}{c |}     Margin{col 31}   Std. Err.{col 43}      z{col 51}   P>|z|{col 59}     [95% Con{col 72}f. Interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
arm#lab_available {c |}
{space 8}A#No lab  {c |}{col 19}{res}{space 2}     0.72{col 31}{space 2}     0.04{col 42}{space 1}   20.11{col 51}{space 3} 0.00{col 59}{space 4}     0.65{col 72}{space 3}     0.79
{txt}{space 11}A#Lab  {c |}{col 19}{res}{space 2}     0.79{col 31}{space 2}     0.03{col 42}{space 1}   29.21{col 51}{space 3} 0.00{col 59}{space 4}     0.73{col 72}{space 3}     0.84
{txt}{space 8}B#No lab  {c |}{col 19}{res}{space 2}     0.77{col 31}{space 2}     0.03{col 42}{space 1}   24.14{col 51}{space 3} 0.00{col 59}{space 4}     0.71{col 72}{space 3}     0.84
{txt}{space 11}B#Lab  {c |}{col 19}{res}{space 2}     0.83{col 31}{space 2}     0.02{col 42}{space 1}   35.18{col 51}{space 3} 0.00{col 59}{space 4}     0.79{col 72}{space 3}     0.88
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: arm lab_available{p_end}
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}     1,940
{txt}{col 1}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
arm#age_over_40 {c |}
{space 3}A#≤40 years  {c |}{col 17}{res}{space 2}     0.76{col 29}{space 2}     0.02{col 40}{space 1}   32.71{col 49}{space 3} 0.00{col 57}{space 4}     0.71{col 70}{space 3}     0.81
{txt}{space 3}A#>40 years  {c |}{col 17}{res}{space 2}     0.65{col 29}{space 2}     0.10{col 40}{space 1}    6.28{col 49}{space 3} 0.00{col 57}{space 4}     0.45{col 70}{space 3}     0.85
{txt}{space 3}B#≤40 years  {c |}{col 17}{res}{space 2}     0.81{col 29}{space 2}     0.02{col 40}{space 1}   38.41{col 49}{space 3} 0.00{col 57}{space 4}     0.77{col 70}{space 3}     0.85
{txt}{space 3}B#>40 years  {c |}{col 17}{res}{space 2}     0.71{col 29}{space 2}     0.10{col 40}{space 1}    7.42{col 49}{space 3} 0.00{col 57}{space 4}     0.52{col 70}{space 3}     0.90
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: arm age_over_40{p_end}
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}     1,940
{txt}{col 1}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
arm#primiparous {c |}
{space 1}A#Multiparous  {c |}{col 17}{res}{space 2}     0.75{col 29}{space 2}     0.02{col 40}{space 1}   30.19{col 49}{space 3} 0.00{col 57}{space 4}     0.70{col 70}{space 3}     0.79
{txt}{space 1}A#Primiparous  {c |}{col 17}{res}{space 2}     0.80{col 29}{space 2}     0.03{col 40}{space 1}   30.91{col 49}{space 3} 0.00{col 57}{space 4}     0.75{col 70}{space 3}     0.85
{txt}{space 1}B#Multiparous  {c |}{col 17}{res}{space 2}     0.80{col 29}{space 2}     0.02{col 40}{space 1}   35.60{col 49}{space 3} 0.00{col 57}{space 4}     0.75{col 70}{space 3}     0.84
{txt}{space 1}B#Primiparous  {c |}{col 17}{res}{space 2}     0.85{col 29}{space 2}     0.02{col 40}{space 1}   36.82{col 49}{space 3} 0.00{col 57}{space 4}     0.80{col 70}{space 3}     0.89
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: arm primiparous{p_end}
{res}{txt}(file products/Margins - malpresentation.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Margins - malpresentation.png written in PNG format)

{com}. 
. set graphics on
{txt}
{com}. 
{txt}end of do-file

{com}. 
. // TODO: Make Spider diagram for each process outcome
. // (see https://folkehelse.sharepoint.com/:i:/r/sites/1461/Restricted%20Documents/4.Research/Analysis,%20Sample%20Size,%20Randomizatio/eRegQual/radar_chart_eRegQual.png?csf=1&web=1&e=JeKbbU)
. 
. 
. 
. // Obtain the git revision hash, which is used in the reports.
. tempfile git_revision_filename
{txt}
{com}. tempname revision_file
{txt}
{com}. shell git rev-parse --short HEAD > "`git_revision_filename'"
{txt}

{com}. file open `revision_file' using `git_revision_filename', read text
{txt}
{com}. file read `revision_file' line
{txt}
{com}. global git_revision = "`macval(line)'"
{txt}
{com}. 
. // Make the report
. do reports/report products/report.docx
{txt}
{com}. version 16.1
{txt}
{com}. 
. args filename
{txt}
{com}. 
. // Some locals to make this file a little more readable.
. local heading putdocx paragraph, style(Heading1)
{txt}
{com}. local newpara putdocx textblock begin, halign(both)
{txt}
{com}. local putdocx textblock end putdocx textblock end
{txt}
{com}. 
. local p_fmt  %5.2f // Format used for P-values.
{txt}
{com}. local e_fmt  %5.2f // Format used for estimates.
{txt}
{com}. local pc_fmt %8.1f // Format used for percentages.
{txt}
{com}. 
. local tbl_num = 0  // A table counter.
{txt}
{com}. 
. // Start the document.
. putdocx begin
{res}{txt}
{com}. 
. // Title.
. putdocx paragraph, style(Title)
{res}{txt}
{com}. putdocx text ("eRegQual analysis")
{res}{txt}
{com}. 
. // Author and revision information.
. `newpara'
{res}{txt}
{com}. `newpara'
{res}{txt}
{com}. 
. // Introduction section.
. `heading'
{res}{txt}
{com}. putdocx text ("Introduction")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. // Methods section
. `heading'
{res}{txt}
{com}. putdocx text ("Methods")
{res}{txt}
{com}. 
. //// TODO: Reinstate
> //// `newpara'
> //// Because outcome data were missing for about a third of participants (see 
> //// results), we used Little's tests (Little 1988) of the null hypotheses that 
> //// missing values of the constituent outcomes were jointly missing completely at 
> //// random (MCAR) and covariate-dependent missing (CDM). We then used multiple 
> //// imputation via chained equations (van Buuren 2007) to create and analyze 
> //// <<dd_docx_display: $m_imputations>> multiply-imputed datasets. We imputed each 
> //// of the constituent outcomes using the auxiliary variables age, BMI, years of 
> //// education, average monthly household income (transformed to the log scale due 
> //// to the skewed distribution of income), and variables that indicated whether a 
> //// laboratory or ultrasound were available at the clinics; the variables included 
> //// in the analysis described below were also included. We were not able to include 
> //// auxiliary variables that indicated previous pregnancy with pre-eclampsia or 
> //// previous history of GDM due to collinearity. We evaluated the convergence of the 
> //// imputation algorithm by inspecting trace plots and evaluated imputed data by 
> //// inspecting kernel density and bar plots comparing the distributions of imputed 
> //// and complete case data.
> //// putdocx textblock end
> //// 
> //// `newpara'
> //// For each imputed data set, we computed the composite outcome from the imputed 
> //// constituent outcome data. An adverse pregnancy outcome was defined to have 
> //// occurred if at least one of the constituent outcomes occurred, and not to have 
> //// occurred if none of the constituent outcomes occurred. For each imputed data 
> //// set and outcome, we estimated a risk ratio to compare treatment to control 
> //// and used  generalized estimating equations (GEE; binomial errors and log 
> //// link) to account for the cluster-randomized design. We combined estimates 
> //// for each outcome using Rubin's rules (Rubin 2004). For comparison, we also 
> //// performed a complete case analysis under the MCAR assumption. We estimated 
> //// the intraclass correlation coefficient (ICC) using the complete cases.
> //// putdocx textblock end
> 
. `newpara'
{res}{txt}
{com}. 
. // TODO: Make sure that the adjustments desribed below are applied to all 
. // analyses, including the "main" analysis that uses imputation.
. 
. `newpara'
{res}{txt}
{com}. 
. // Results section
. `heading'
{res}{txt}
{com}. putdocx text ("Results")
{res}{txt}
{com}. 
. // Verify some assumptions in this section.
. //// TODO: Reinstate
> //// assert ${c -(}p_mcar{c )-} > 0.05
> //// assert ${c -(}p_cdm{c )-}  > 0.05
> 
. //// TODO: Reinstate
> //// `newpara'
> //// Outcome data were missing for between 
> //// <<dd_docx_display: string(${c -(}pc_min_miss{c )-}, "`pc_fmt'")>>% and 
> //// <<dd_docx_display: string(${c -(}pc_max_miss{c )-}, "`pc_fmt'")>>% of the constituent 
> //// outcomes, and <<dd_docx_display: string(${c -(}pc_miss_y{c )-}, "`pc_fmt'")>>% of the 
> //// composite outcome. We were unable to reject the MCAR and CDM hypotheses 
> //// (P=<<dd_docx_display: string(${c -(}p_mcar{c )-}, "`p_fmt'")>> and P=
> //// <<dd_docx_display: string(${c -(}p_cdm{c )-}, "`p_fmt'")>>, respectively). Distributions 
> //// of the original and the first five imputed data sets are shown in the Appendix. 
> //// Table 1 shows the result of the adverse pregnancy outcome analysis. The risk 
> //// ratio was estimated to be <<dd_docx_display: string(${c -(}rr_b_y{c )-}, "`e_fmt'")>> 
> //// (95% CI <<dd_docx_display: string(${c -(}rr_ll_y{c )-}, "`e_fmt'")>> to 
> //// <<dd_docx_display: string(${c -(}rr_ul_y{c )-}, "`e_fmt'")>>, P = 
> //// <<dd_docx_display: string(${c -(}rr_p_y{c )-}, "`p_fmt'")>>). This compares to the 
> //// complete case risk ratio of <<dd_docx_display: string(${c -(}cc_rr_b{c )-}, "`e_fmt'")>> 
> //// (95% CI <<dd_docx_display: string(${c -(}cc_rr_ll{c )-}, "`e_fmt'")>> to 
> //// <<dd_docx_display: string(${c -(}cc_rr_ul{c )-}, "`e_fmt'")>>, P = 
> //// <<dd_docx_display: string(${c -(}cc_rr_p{c )-}, "`p_fmt'")>>). Tables 2–6 show results for 
> //// the constituent outcomes. The ICC was estimated to be close to zero and no 
> //// greater than <<dd_docx_display: string(${c -(}icc_ub{c )-}, "%5.3f")>> (upper bound of 
> //// 95% CI).
> //// putdocx textblock end
> //// 
> //// frame imputed {c -(}
> ////   foreach var of varlist y y1-y5 {c -(}
> ////     local ++tbl_num
> ////     local var_label : variable label `var'
> ////     local title "Table `tbl_num'. `var_label' (multiply-imputed result)"
> ////     estimates replay `var'_estimates, eform
> ////     putdocx table tbl_`tbl_num' = etable, title("`title'")
> ////     putdocx table tbl_`tbl_num'(2, 2) = ("Risk Ratio"), halign(right)
> ////   {c )-}
> //// {c )-}
> 
. foreach outcome of global process_outcomes {c -(}
{txt}  2{com}.   frame `outcome' {c -(}
{txt}  3{com}.     local ++tbl_num  
{txt}  4{com}.     local var_label : variable label y
{txt}  5{com}.     local title "Table `tbl_num'. `var_label'"
{txt}  6{com}.     estimates replay `outcome'_estimates, or
{txt}  7{com}.     putdocx table tbl_`tbl_num' = etable, title("`title'")
{txt}  8{com}.     putdocx table tbl_`tbl_num'(2, 2) = ("Odds Ratio"), halign(right)
{txt}  9{com}.     putdocx table tbl_`tbl_num'(3, 2) = (""), halign(right) // Was "Coef."
{txt} 10{com}.     local n_rows  20
{txt} 11{com}.     local n_start 6
{txt} 12{com}.     if "`outcome'" == "malpresentation" local n_rows  19
{txt} 13{com}.     if "`outcome'" == "malpresentation" local n_start 5
{txt} 14{com}.     forvalues i = `n_rows'(-1)`n_start' {c -(} // Drop rows not of interest.
{txt} 15{com}.       putdocx table tbl_`tbl_num'(`i', .), drop
{txt} 16{com}.     {c )-}
{txt} 17{com}.   {c )-}
{txt} 18{com}. {c )-}

{txt}{hline}
{p 0 8}Model {hi:attendance_estimates}{p_end}
{hline}

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    21,703
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     5,200

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       4.2
{txt}{col 63}max{col 67}={col 69}{res}         5

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    87.65
{txt}Log pseudolikelihood  = {res}-13697.697{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 79:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}F  {c |}{col 15}{res}{space 2}     1.18{col 27}{space 2}     0.13{col 38}{space 1}    1.46{col 47}{space 3} 0.15{col 55}{space 4}     0.95{col 68}{space 3}     1.47
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.59{col 27}{space 2}     0.11{col 38}{space 1}   -2.93{col 47}{space 3} 0.00{col 55}{space 4}     0.41{col 68}{space 3}     0.84
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     1.38{col 27}{space 2}     0.26{col 38}{space 1}    1.72{col 47}{space 3} 0.09{col 55}{space 4}     0.96{col 68}{space 3}     1.98
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.19{col 27}{space 2}     0.20{col 38}{space 1}    1.04{col 47}{space 3} 0.30{col 55}{space 4}     0.86{col 68}{space 3}     1.67
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.75{col 27}{space 2}     0.30{col 38}{space 1}    3.24{col 47}{space 3} 0.00{col 55}{space 4}     1.25{col 68}{space 3}     2.47
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     1.52{col 27}{space 2}     0.20{col 38}{space 1}    3.19{col 47}{space 3} 0.00{col 55}{space 4}     1.18{col 68}{space 3}     1.98
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.00{col 27}{space 2}     0.12{col 38}{space 1}   -0.03{col 47}{space 3} 0.97{col 55}{space 4}     0.78{col 68}{space 3}     1.27
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}>40 years  {c |}{col 15}{res}{space 2}     0.49{col 27}{space 2}     0.16{col 38}{space 1}   -2.21{col 47}{space 3} 0.03{col 55}{space 4}     0.26{col 68}{space 3}     0.92
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Primiparous  {c |}{col 15}{res}{space 2}     0.96{col 27}{space 2}     0.06{col 38}{space 1}   -0.64{col 47}{space 3} 0.53{col 55}{space 4}     0.85{col 68}{space 3}     1.08
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.43{col 27}{space 2}     0.08{col 38}{space 1}   -4.31{col 47}{space 3} 0.00{col 55}{space 4}     0.29{col 68}{space 3}     0.63
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}     0.61{col 27}{space 2}     0.08{col 55}{space 4}     0.45{col 68}{space 3}     0.76
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     1.35{col 27}{space 2}     0.05{col 55}{space 4}     1.25{col 68}{space 3}     1.46
{txt}          rho {c |}{col 15}{res}{space 2}     0.36{col 27}{space 2}     0.02{col 55}{space 4}     0.32{col 68}{space 3}     0.39
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:hypertension_estimates}{p_end}
{hline}

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    15,553
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     6,013

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       2.6
{txt}{col 63}max{col 67}={col 69}{res}         6

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    59.80
{txt}Log pseudolikelihood  = {res}-2760.2644{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 79:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}J  {c |}{col 15}{res}{space 2}     0.60{col 27}{space 2}     0.07{col 38}{space 1}   -4.24{col 47}{space 3} 0.00{col 55}{space 4}     0.48{col 68}{space 3}     0.76
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.16{col 27}{space 2}     0.24{col 38}{space 1}    0.73{col 47}{space 3} 0.46{col 55}{space 4}     0.78{col 68}{space 3}     1.74
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     1.51{col 27}{space 2}     0.27{col 38}{space 1}    2.34{col 47}{space 3} 0.02{col 55}{space 4}     1.07{col 68}{space 3}     2.13
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.21{col 27}{space 2}     0.22{col 38}{space 1}    1.01{col 47}{space 3} 0.31{col 55}{space 4}     0.84{col 68}{space 3}     1.74
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.74{col 27}{space 2}     0.31{col 38}{space 1}    3.11{col 47}{space 3} 0.00{col 55}{space 4}     1.23{col 68}{space 3}     2.47
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.94{col 27}{space 2}     0.10{col 38}{space 1}   -0.58{col 47}{space 3} 0.56{col 55}{space 4}     0.76{col 68}{space 3}     1.16
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.15{col 27}{space 2}     0.15{col 38}{space 1}    1.11{col 47}{space 3} 0.27{col 55}{space 4}     0.90{col 68}{space 3}     1.47
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}>40 years  {c |}{col 15}{res}{space 2}     0.50{col 27}{space 2}     0.15{col 38}{space 1}   -2.34{col 47}{space 3} 0.02{col 55}{space 4}     0.28{col 68}{space 3}     0.89
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Primiparous  {c |}{col 15}{res}{space 2}     1.02{col 27}{space 2}     0.11{col 38}{space 1}    0.16{col 47}{space 3} 0.87{col 55}{space 4}     0.83{col 68}{space 3}     1.25
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}    30.86{col 27}{space 2}     7.28{col 38}{space 1}   14.54{col 47}{space 3} 0.00{col 55}{space 4}    19.44{col 68}{space 3}    48.99
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -0.17{col 27}{space 2}     0.26{col 55}{space 4}    -0.68{col 68}{space 3}     0.34
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.92{col 27}{space 2}     0.12{col 55}{space 4}     0.71{col 68}{space 3}     1.19
{txt}          rho {c |}{col 15}{res}{space 2}     0.20{col 27}{space 2}     0.04{col 55}{space 4}     0.13{col 68}{space 3}     0.30
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:diabetes_estimates}{p_end}
{hline}

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    12,128
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     6,367

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       1.9
{txt}{col 63}max{col 67}={col 69}{res}         3

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    76.16
{txt}Log pseudolikelihood  = {res}-5920.4824{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 79:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}L  {c |}{col 15}{res}{space 2}     1.46{col 27}{space 2}     0.18{col 38}{space 1}    3.13{col 47}{space 3} 0.00{col 55}{space 4}     1.15{col 68}{space 3}     1.85
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.68{col 27}{space 2}     0.13{col 38}{space 1}   -2.10{col 47}{space 3} 0.04{col 55}{space 4}     0.47{col 68}{space 3}     0.97
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.57{col 27}{space 2}     0.13{col 38}{space 1}   -2.42{col 47}{space 3} 0.02{col 55}{space 4}     0.36{col 68}{space 3}     0.90
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.49{col 27}{space 2}     0.10{col 38}{space 1}   -3.37{col 47}{space 3} 0.00{col 55}{space 4}     0.33{col 68}{space 3}     0.74
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.72{col 27}{space 2}     0.11{col 38}{space 1}   -2.10{col 47}{space 3} 0.04{col 55}{space 4}     0.53{col 68}{space 3}     0.98
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     1.40{col 27}{space 2}     0.20{col 38}{space 1}    2.28{col 47}{space 3} 0.02{col 55}{space 4}     1.05{col 68}{space 3}     1.86
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.97{col 27}{space 2}     0.29{col 38}{space 1}    4.54{col 47}{space 3} 0.00{col 55}{space 4}     1.47{col 68}{space 3}     2.63
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}>40 years  {c |}{col 15}{res}{space 2}     1.07{col 27}{space 2}     0.25{col 38}{space 1}    0.27{col 47}{space 3} 0.79{col 55}{space 4}     0.67{col 68}{space 3}     1.70
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Primiparous  {c |}{col 15}{res}{space 2}     1.06{col 27}{space 2}     0.05{col 38}{space 1}    1.20{col 47}{space 3} 0.23{col 55}{space 4}     0.96{col 68}{space 3}     1.17
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.15{col 27}{space 2}     0.03{col 38}{space 1}  -10.31{col 47}{space 3} 0.00{col 55}{space 4}     0.11{col 68}{space 3}     0.22
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}   -14.34{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:malpresentation_estimates}{p_end}
{hline}

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     1,940
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       116

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}      16.7
{txt}{col 63}max{col 67}={col 69}{res}       113

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    35.08
{txt}Log likelihood  = {res}-910.09283{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0001

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}B  {c |}{col 15}{res}{space 2}     1.42{col 27}{space 2}     0.31{col 38}{space 1}    1.61{col 47}{space 3} 0.11{col 55}{space 4}     0.93{col 68}{space 3}     2.18
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.45{col 27}{space 2}     0.56{col 38}{space 1}    0.95{col 47}{space 3} 0.34{col 55}{space 4}     0.68{col 68}{space 3}     3.09
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     3.60{col 27}{space 2}     1.85{col 38}{space 1}    2.49{col 47}{space 3} 0.01{col 55}{space 4}     1.31{col 68}{space 3}     9.88
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.28{col 27}{space 2}     0.46{col 38}{space 1}    0.70{col 47}{space 3} 0.49{col 55}{space 4}     0.64{col 68}{space 3}     2.57
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.79{col 27}{space 2}     0.66{col 38}{space 1}    1.59{col 47}{space 3} 0.11{col 55}{space 4}     0.87{col 68}{space 3}     3.67
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     2.55{col 27}{space 2}     0.85{col 38}{space 1}    2.81{col 47}{space 3} 0.01{col 55}{space 4}     1.33{col 68}{space 3}     4.92
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.55{col 27}{space 2}     0.40{col 38}{space 1}    1.70{col 47}{space 3} 0.09{col 55}{space 4}     0.94{col 68}{space 3}     2.57
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}>40 years  {c |}{col 15}{res}{space 2}     0.52{col 27}{space 2}     0.29{col 38}{space 1}   -1.17{col 47}{space 3} 0.24{col 55}{space 4}     0.18{col 68}{space 3}     1.55
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Primiparous  {c |}{col 15}{res}{space 2}     1.48{col 27}{space 2}     0.23{col 38}{space 1}    2.56{col 47}{space 3} 0.01{col 55}{space 4}     1.10{col 68}{space 3}     1.99
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.86{col 27}{space 2}     0.33{col 38}{space 1}   -0.40{col 47}{space 3} 0.69{col 55}{space 4}     0.41{col 68}{space 3}     1.82
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -0.28{col 27}{space 2}     0.24{col 55}{space 4}    -0.75{col 68}{space 3}     0.19
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.87{col 27}{space 2}     0.10{col 55}{space 4}     0.69{col 68}{space 3}     1.10
{txt}          rho {c |}{col 15}{res}{space 2}     0.19{col 27}{space 2}     0.04{col 55}{space 4}     0.13{col 68}{space 3}     0.27
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}90.00{col 56}{txt}Prob >= chibar2 = {res}0.000
{txt}
{com}. 
. // References
. `heading'
{res}{txt}
{com}. putdocx text ("References")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. // Appendix
. //// TODO: Reinstate
> //// `heading'
> //// putdocx text ("Appendix")
> 
. //// TODO: Reinstate
> //// `newpara'
> //// The following figures show the distributions of the original and a selection of 
> //// the imputed data.
> //// putdocx textblock end
> //// 
> //// foreach var of newlist y1-y5 y $imputeds {c -(} // newlist as vars only exist in (other) frames.
> ////   display "${c -(}`var'_plot_fname{c )-}"
> ////   putdocx image "${c -(}`var'_plot_fname{c )-}.png", linebreak
> //// {c )-}
> 
. // Save the report to the specified filename.
. putdocx save `"`filename'"', replace
{res}successfully replaced {browse "/Users/cjr/Repos/fhi.eRegQual.2020/products/report.docx":"/Users/cjr/Repos/fhi.eRegQual.2020/products/report.docx"}
{txt}
{com}. 
{txt}end of do-file

{com}. 
{txt}end of do-file

{com}. 