{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}eRegQual Analysis
       {txt}log:  {res}/Users/cjr/Repos/fhi.eRegQual.2020/products/log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}26 Jun 2020, 13:46:54
{txt}
{com}. 
. // Set up Stata.
. do setup/setup
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Set the random number generator seed.
. set seed 1234
{txt}
{com}. 
. // Set up Stata's path to use the "packages" directory for add-on packages.
. net set ado "./packages"
{txt}
{com}. sysdir set PERSONAL "./packages"
{txt}
{com}. 
. // Specify formats.
. set cformat %9.2f
{txt}
{com}. set pformat %5.2f
{txt}
{com}. set sformat %8.2f
{txt}
{com}. 
. 
{txt}end of do-file

{com}. 
. // Set up globals.
. do globals/globals
{txt}
{com}. version 16.1
{txt}
{com}. 
. // The number of imputations to perform.
. global m_imputations 50 // Very slightly narrower CI if m=100.
{txt}
{com}. 
. // Define the names of the process outcomes.
. global process_outcomes attendance hypertension
{txt}
{com}. 
. // Labels for binary variables with levels yes and no.
. label define yes_no_label 1 Yes 0 No
{txt}
{com}. 
. // The variables to adjust for, with their "types". See the generated report for
. // an explanation of why these variables are adjusted for.
. global adj_vars i.strat_var i.lab_available c.cluster_size i.age_over_40 ///
>                 i.primiparous
{txt}
{com}. global adj_var_names // A global with just the *names* of the adj_vars
{txt}
{com}. foreach x of global adj_vars {c -(}
{txt}  2{com}.   local x_name = substr("`x'", 3, .) // Remove the i. or c.
{txt}  3{com}.   global adj_var_names $adj_var_names `x_name'
{txt}  4{com}. {c )-}
{txt}
{com}. 
. // Define paths to the process outcome files.
. global fname_attendance   "data/raw/25June2020_eRegQual process outcomes_attendance.dta"
{txt}
{com}. global fname_hypertension "data/raw/25June2020_eRegQual process outcomes_hypertension.dta"
{txt}
{com}. 
. // Define data signatures for the process outcome files.
. global datasignature_attendance   "6367:39(51496):3578513271:2127801624"
{txt}
{com}. global datasignature_hypertension "6367:60(68365):3970041110:3735367683"
{txt}
{com}. 
{txt}end of do-file

{com}. 
. // Import birth outcome data and perform imputation.
. // TODO: Reinstate
. do data/birth_outcomes
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Define the path to the data and the signature we expect it to have.
. local fname "data/raw/04May2020_eRegQual birth outcomes.dta"
{txt}
{com}. local signature "6367:756(27238):862839612:1580475191"
{txt}
{com}. 
. frame create original
{txt}
{com}. frame original {c -(}
.   // Load the data and check its signature is as expected.
.   use "`fname'", replace
.   datasignature
  {res}6367:756(27238):862839612:1580475191
{com}.   assert r(datasignature) == "`signature'"
. 
.   // Globals that specify the imputed and regular variables.
.   global imputeds
.   global regulars
. 
.   // Convert the arm variable from string to integer.
.   encode prettyExposure, generate(arm)
.   label variable arm Arm
.   fvset base 1 arm
.   global regulars $regulars arm
. 
.   // Convert the stratification variable from string to integer.
.   encode bookorgdistricthashed, generate(strat_var)
.   label variable strat_var District
.   global regulars $regulars strat_var
. 
.   // Rename and label the cluster identifier variable.
.   rename str_TRIAL_1_Cluster clusterid
{res}{com}.   label variable clusterid Cluster
.   global regulars $regulars clusterid
. 
.   // Rename the components of the composite outcome.
.   rename anemia_at_birth              y1
{res}{com}.   label variable                      y1 "Anemia at birth"
.   rename severehypertension_at_birth  y2
{res}{com}.   label variable                      y2 "Severe hypertension at birth"
.   rename sga_undetected_at_birth      y3
{res}{com}.   label variable                      y3 "SGA undetected at birth"
.   rename malpres_undetected           y4
{res}{com}.   label variable                      y4 "Malpresentation undetected at birth"
.   rename lga                          y5
{res}{com}.   label variable                      y5 "Large for gestational age"
. 
.   // Apply labels to the outcomes.
.   label define yes_no 0 "No" 1 "Yes"
.   label values y* yes_no
. 
.   // Age.
.   replace age = . if age <= 1 // Correct some mis-coded values of the age variable.
{txt}(35 real changes made, 35 to missing)
{com}.   label variable age "Age (years)"
.   global imputeds $imputeds age
. 
.   // BMI.
.   rename bookbmi bmi
{res}{com}.   replace bmi = . if bmi < 15 | bmi > 48 // Same policy as for categorical version.
{txt}(54 real changes made, 54 to missing)
{com}.   label variable bmi "Body mass index"
.   global imputeds $imputeds bmi
. 
.   // Education.
.   label variable education "Education (years)"
.   global imputeds $imputeds education
. 
.   // Income.
.   generate log_income = log(avgincome) // Log to approximately normalize.
{txt}(404 missing values generated)
{com}.   label variable log_income "Monthly household income (ILS; log scale)"
.   global imputeds $imputeds log_income
. 
.   // Lab availability.
.   label variable lab_available "Lab available"
.   global regulars $regulars lab_available
. 
.   // Ultrasound available.
.   label variable us_available "US available"
.   global regulars $regulars us_available
. 
.   // Verify that all of the regular variables are complete, and that each of the
.   // variables to be imputed contain missing values.
.   misstable summarize $regulars
{txt}(variables nonmissing or string)
{com}.   assert r(N_eq_dot) + r(N_gt_dot) == .
.   foreach x of varlist y1-y5 $imputeds {c -(}
{txt}  2{com}.     misstable summarize `x'
{txt}  3{com}.     assert r(N_eq_dot) + r(N_gt_dot) != .
{txt}  4{com}.   {c )-}
{txt}{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y1 {c |}{res}     1,743{txt}{space 10}{res}     4,624{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y2 {c |}{res}     2,258{txt}{space 10}{res}     4,109{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y3 {c |}{res}       752{txt}{space 10}{res}     5,615{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y4 {c |}{res}       875{txt}{space 10}{res}     5,492{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y5 {c |}{res}       752{txt}{space 10}{res}     5,615{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
           age {c |}{res}        69{txt}{space 10}{res}     6,298{txt}  {c |}     32         14          45
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
           bmi {c |}{res}       938{txt}{space 10}{res}     5,429{txt}  {c |}   >500   15.42969    47.98243
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
     education {c |}{res}       203{txt}{space 10}{res}     6,164{txt}  {c |}     25          1          24
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
    log_income {c |}{res}       404{txt}{space 10}{res}     5,963{txt}  {c |}    222  -5.926926    8.922658
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{com}. 
.   // Keep only the variables of interest.
.   keep y* $imputeds $regulars TrialOne_adverse_pregoutc
. {c )-}
{txt}
{com}. 
. 
{txt}end of do-file

{com}. // do data/impute
. 
. // Import the process outcome data.
. do data/process_outcomes
{txt}
{com}. version 16.1
{txt}
{com}. 
. foreach outcome of global process_outcomes {c -(}
{txt}  2{com}.   frame create `outcome'
{txt}  3{com}.   frame `outcome' {c -(}
{txt}  4{com}.     // Load the data and check its signature is as expected.
.     use "${c -(}fname_`outcome'{c )-}", replace
{txt}  5{com}.     datasignature
{txt}  6{com}.     assert r(datasignature) == "${c -(}datasignature_`outcome'{c )-}"
{txt}  7{com}. 
.     // Reshape to long format. Note that the uniqueid variable is not actually
.     // unique but identifies women, who can have multiple pregnancies (but not
.     // twins in this data set). Rows in the wide data frame are pregnancies, so
.     // we simply generate a unique pregnancy number for each row. We generate a 
.     // visit variable, as each woman (pregnancy) may attend clinic multiple times. 
.     generate pregnancy = _n
{txt}  8{com}.     local stubs opportunity_`outcome'_ success_`outcome'_
{txt}  9{com}.     reshape long `stubs', i(pregnancy) j(visit)
{txt} 10{com}. 
.     // While the outcome variable is a factor with three levels, we are only 
.     // interested in the relative odds of success. The other levels are 
.     // "NOT SUCCESSFUL" and "NOT APPLICABLE". Not applicable is not of 
.     // scientific interest here.
.     local success_label_name = "`: value label success_`outcome'_'"
{txt} 11{com}.     drop if      success_`outcome'_ == "NOT APPLICABLE":`success_label_name'
{txt} 12{com}.     generate y = success_`outcome'_ == "SUCCESSFUL":`success_label_name'
{txt} 13{com}. 
.     // Encode/rename arm and cluster identifier variables.
.     encode prettyExposure, generate(arm)
{txt} 14{com}.     rename str_TRIAL_1_Cluster clusterid
{txt} 15{com}. 
.     // Convert the stratification variable from string to integer.
.     encode bookorgdistricthashed, generate(strat_var)
{txt} 16{com}. 
.     // Compute the cluster size from the trial data. We use the trial data for
.     // simplicity and have verified that these agree with the "baseline" data on
.     // trial size. We divide by 100 because cluster sizes range from about 150 to
.     // about 750, and we want to get regression coefficients that are non-null
.     // within two decimal places!
.     by clusterid, sort: generate cluster_size = _N / 100
{txt} 17{com}. 
.     // Generate an indicator for whether each woman is aged > 40 years.
.     generate age_over_40 = age > 40
{txt} 18{com}.     label values age_over_40 yes_no_label
{txt} 19{com}.     
.     // Generate an indicator for whether each woman is primiparous.
.     rename bookprimi primiparous
{txt} 20{com}.     label values primiparous yes_no_label
{txt} 21{com}. 
.     // Keep only the variables of interest.
.     keep y arm pregnancy visit clusterid $adj_var_names
{txt} 22{com}. 
.     // Label the variables
.     label variable y             "Successful `outcome'"
{txt} 23{com}.     label variable arm           "Study arm"
{txt} 24{com}.     label variable pregnancy     "Pregnancy"
{txt} 25{com}.     label variable clusterid     "Cluster"
{txt} 26{com}.     label variable strat_var     "District"
{txt} 27{com}.     label variable lab_available "Lab available"
{txt} 28{com}.     label variable cluster_size  "Cluster size (100s of new enrollments)"
{txt} 29{com}.     label variable age_over_40   "Age > 40 years"
{txt} 30{com}.     label variable primiparous   "Primiparous"
{txt} 31{com}. 
.     // There should be no missing data.
.     misstable summarize, all
{txt} 32{com}.     assert r(N_lt_dot) == _N
{txt} 33{com}. 
.     // Set pregnancy as the panel variable and visit at the time variable.
.     xtset pregnancy visit
{txt} 34{com}. 
.     // TODO: If you generate an OR for this analysis, switch the birth outcomes
.     // to OR, too. Make sure you update the report text if you change the link.
. 
.     // TODO: Probably report OR and assumed and corresponding risks.
.   {c )-}
{txt} 35{com}. {c )-}
  {res}6367:39(51496):3578513271:2127801624
{txt}(note: j = 1 2 3 4 5)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    6367   {txt}->{res}   31835
{txt}Number of variables            {res}      40   {txt}->{res}      33
{txt}j variable (5 values)                     ->   {res}visit
{txt}xij variables:
{res}opportunity_attendance_1 opportunity_attendance_2 ... opportunity_attendance_5{txt}->{res}opportunity_attendance_
success_attendance_1 success_attendance_2 ... success_attendance_5{txt}->{res}success_attendance_
{txt}{hline 77}
(10,132 observations deleted)
{res}{txt}{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
     pregnancy {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}   >500          1        6367
         visit {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      5          1           5
     clusterid {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}    119          1         120
   primiparous {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      2          0           1
  lab_availa~e {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      2          0           1
             y {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      2          0           1
           arm {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      2          1           2
     strat_var {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      5          1           5
  cluster_size {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}    105        .19        9.04
   age_over_40 {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{res}{txt}{col 8}panel variable:  {res}pregnancy (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}visit, 1 to 5
{txt}{col 17}delta:  {res}1 unit
  6367:60(68365):3970041110:3735367683
{txt}(note: j = 1 2 3 4 5 6 7 8)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    6367   {txt}->{res}   50936
{txt}Number of variables            {res}      61   {txt}->{res}      48
{txt}j variable (8 values)                     ->   {res}visit
{txt}xij variables:
{res}opportunity_hypertension_1 opportunity_hypertension_2 ... opportunity_hypertension_8{txt}->{res}opportunity_hypertension_
success_hypertension_1 success_hypertension_2 ... success_hypertension_8{txt}->{res}success_hypertension_
{txt}{hline 77}
(35,383 observations deleted)
{res}{txt}{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
     pregnancy {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}   >500          1        6367
         visit {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      8          1           8
     clusterid {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}    119          1         120
   primiparous {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      2          0           1
  lab_availa~e {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      2          0           1
             y {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      2          0           1
           arm {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      2          1           2
     strat_var {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      5          1           5
  cluster_size {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}     94        .05        7.73
   age_over_40 {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{res}{txt}{col 8}panel variable:  {res}pregnancy (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}visit, 1 to 8, but with gaps
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. 
{txt}end of do-file

{com}. 
. // TODO: Reinstate
. // // Do estimation.
. // do estimation/missing          // Calculate percentage of data missing.
. // do estimation/mcar             // Test the MCAR hypothesis.
. // do estimation/birth_outcomes   // Analyze the birth outcome data.
. do estimation/process_outcomes    // Analyze process outcome data.
{txt}
{com}. version 16.1
{txt}
{com}. 
. foreach outcome of global process_outcomes {c -(}
{txt}  2{com}.   frame `outcome' {c -(}
{txt}  3{com}.     xtlogit y i.arm $adj_vars, vce(cluster clusterid) or
{txt}  4{com}.     estimates store `outcome'_estimates
{txt}  5{com}. 
.     // TODO: As an alternative to the "spider plots" proposed in the protocol to
.     // study the association between outcomes and variables such as cluster size,
.     // we could make margin plots, along the following lines:
.     // estimates restore `outcome'_estimates
.     // frame change `outcome' // Make sure we have the correct frame.
.     // margins i.arm, at(cluster_size = (2(1)7))
.     //   // Compute margins for each level of arm, at values of cluster size from
.     //   // 2 to 7.
.     // marginsplot
.     // margins i.arm#i.age_over_40 // This is the syntax for a factor variable.
.   {c )-}
{txt}  6{com}. {c )-}

{txt}Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-14897.323}  
Iteration 1:{space 3}log pseudolikelihood = {res:-14584.014}  
Iteration 2:{space 3}log pseudolikelihood = {res:-14583.684}  
Iteration 3:{space 3}log pseudolikelihood = {res:-14583.684}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log pseudolikelihood = {res}-14583.684
{txt}tau = {res} 0.1     {txt}log pseudolikelihood = {res}-14365.151
{txt}tau = {res} 0.2     {txt}log pseudolikelihood = {res}-14174.439
{txt}tau = {res} 0.3     {txt}log pseudolikelihood = {res}-14011.042
{txt}tau = {res} 0.4     {txt}log pseudolikelihood = {res}-13876.506
{txt}tau = {res} 0.5     {txt}log pseudolikelihood = {res}-13775.717
{txt}tau = {res} 0.6     {txt}log pseudolikelihood = {res}-13719.745
{txt}tau = {res} 0.7     {txt}log pseudolikelihood = {res}-13733.368

{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-13719.739}  
Iteration 1:{space 3}log pseudolikelihood = {res:-13691.527}  
Iteration 2:{space 3}log pseudolikelihood = {res:-13691.523}  
Iteration 3:{space 3}log pseudolikelihood = {res:-13691.523}  
{res}
{txt}Calculating robust standard errors:

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    21,703
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     5,200

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       4.2
{txt}{col 63}max{col 67}={col 69}{res}         5

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}   122.83
{txt}Log pseudolikelihood  = {res}-13691.523{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 81:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}              y{col 17}{c |} Odds Ratio{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}arm {c |}
{space 13}F  {c |}{col 17}{res}{space 2}     1.17{col 29}{space 2}     0.13{col 40}{space 1}    1.42{col 49}{space 3} 0.16{col 57}{space 4}     0.94{col 70}{space 3}     1.44
{txt}{space 15} {c |}
{space 6}strat_var {c |}
{space 8}8d9c30  {c |}{col 17}{res}{space 2}     0.61{col 29}{space 2}     0.11{col 40}{space 1}   -2.80{col 49}{space 3} 0.01{col 57}{space 4}     0.43{col 70}{space 3}     0.86
{txt}{space 8}9d5ed6  {c |}{col 17}{res}{space 2}     1.27{col 29}{space 2}     0.22{col 40}{space 1}    1.39{col 49}{space 3} 0.16{col 57}{space 4}     0.91{col 70}{space 3}     1.79
{txt}{space 8}e1e1d3  {c |}{col 17}{res}{space 2}     1.19{col 29}{space 2}     0.19{col 40}{space 1}    1.06{col 49}{space 3} 0.29{col 57}{space 4}     0.86{col 70}{space 3}     1.64
{txt}{space 8}ff4457  {c |}{col 17}{res}{space 2}     1.73{col 29}{space 2}     0.30{col 40}{space 1}    3.18{col 49}{space 3} 0.00{col 57}{space 4}     1.23{col 70}{space 3}     2.42
{txt}{space 15} {c |}
1.lab_available {c |}{col 17}{res}{space 2}     0.99{col 29}{space 2}     0.12{col 40}{space 1}   -0.06{col 49}{space 3} 0.95{col 57}{space 4}     0.78{col 70}{space 3}     1.26
{txt}{space 3}cluster_size {c |}{col 17}{res}{space 2}     1.13{col 29}{space 2}     0.03{col 40}{space 1}    4.42{col 49}{space 3} 0.00{col 57}{space 4}     1.07{col 70}{space 3}     1.19
{txt}{space 2}1.age_over_40 {c |}{col 17}{res}{space 2}     0.49{col 29}{space 2}     0.16{col 40}{space 1}   -2.18{col 49}{space 3} 0.03{col 57}{space 4}     0.25{col 70}{space 3}     0.93
{txt}{space 2}1.primiparous {c |}{col 17}{res}{space 2}     0.96{col 29}{space 2}     0.06{col 40}{space 1}   -0.60{col 49}{space 3} 0.55{col 57}{space 4}     0.86{col 70}{space 3}     1.09
{txt}{space 10}_cons {c |}{col 17}{res}{space 2}     0.43{col 29}{space 2}     0.08{col 40}{space 1}   -4.62{col 49}{space 3} 0.00{col 57}{space 4}     0.30{col 70}{space 3}     0.61
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}/lnsig2u {c |}{col 17}{res}{space 2}     0.60{col 29}{space 2}     0.08{col 57}{space 4}     0.45{col 70}{space 3}     0.76
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
        sigma_u {c |}{col 17}{res}{space 2}     1.35{col 29}{space 2}     0.05{col 57}{space 4}     1.25{col 70}{space 3}     1.46
{txt}            rho {c |}{col 17}{res}{space 2}     0.36{col 29}{space 2}     0.02{col 57}{space 4}     0.32{col 70}{space 3}     0.39
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res: -2808.663}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2777.7428}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2776.6212}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2776.6157}  
Iteration 4:{space 3}log pseudolikelihood = {res:-2776.6157}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log pseudolikelihood = {res}-2776.6157
{txt}tau = {res} 0.1     {txt}log pseudolikelihood = {res}-2772.9791
{txt}tau = {res} 0.2     {txt}log pseudolikelihood = {res}-2771.6447
{txt}tau = {res} 0.3     {txt}log pseudolikelihood = {res}-2774.8568

{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-2771.6447}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2765.1414}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2760.1961}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2760.1369}  
Iteration 4:{space 3}log pseudolikelihood = {res:-2760.1364}  
Iteration 5:{space 3}log pseudolikelihood = {res:-2760.1364}  
{res}
{txt}Calculating robust standard errors:

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    15,553
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     6,013

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       2.6
{txt}{col 63}max{col 67}={col 69}{res}         6

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    62.05
{txt}Log pseudolikelihood  = {res}-2760.1364{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 81:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}              y{col 17}{c |} Odds Ratio{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}arm {c |}
{space 13}J  {c |}{col 17}{res}{space 2}     0.60{col 29}{space 2}     0.07{col 40}{space 1}   -4.24{col 49}{space 3} 0.00{col 57}{space 4}     0.48{col 70}{space 3}     0.76
{txt}{space 15} {c |}
{space 6}strat_var {c |}
{space 8}8d9c30  {c |}{col 17}{res}{space 2}     1.15{col 29}{space 2}     0.24{col 40}{space 1}    0.68{col 49}{space 3} 0.50{col 57}{space 4}     0.77{col 70}{space 3}     1.72
{txt}{space 8}9d5ed6  {c |}{col 17}{res}{space 2}     1.55{col 29}{space 2}     0.28{col 40}{space 1}    2.46{col 49}{space 3} 0.01{col 57}{space 4}     1.09{col 70}{space 3}     2.19
{txt}{space 8}e1e1d3  {c |}{col 17}{res}{space 2}     1.21{col 29}{space 2}     0.22{col 40}{space 1}    1.03{col 49}{space 3} 0.30{col 57}{space 4}     0.84{col 70}{space 3}     1.74
{txt}{space 8}ff4457  {c |}{col 17}{res}{space 2}     1.76{col 29}{space 2}     0.31{col 40}{space 1}    3.15{col 49}{space 3} 0.00{col 57}{space 4}     1.24{col 70}{space 3}     2.50
{txt}{space 15} {c |}
1.lab_available {c |}{col 17}{res}{space 2}     1.15{col 29}{space 2}     0.14{col 40}{space 1}    1.16{col 49}{space 3} 0.24{col 57}{space 4}     0.91{col 70}{space 3}     1.47
{txt}{space 3}cluster_size {c |}{col 17}{res}{space 2}     0.97{col 29}{space 2}     0.03{col 40}{space 1}   -0.92{col 49}{space 3} 0.36{col 57}{space 4}     0.92{col 70}{space 3}     1.03
{txt}{space 2}1.age_over_40 {c |}{col 17}{res}{space 2}     0.50{col 29}{space 2}     0.15{col 40}{space 1}   -2.34{col 49}{space 3} 0.02{col 57}{space 4}     0.28{col 70}{space 3}     0.89
{txt}{space 2}1.primiparous {c |}{col 17}{res}{space 2}     1.02{col 29}{space 2}     0.11{col 40}{space 1}    0.16{col 49}{space 3} 0.87{col 57}{space 4}     0.83{col 70}{space 3}     1.25
{txt}{space 10}_cons {c |}{col 17}{res}{space 2}    30.88{col 29}{space 2}     7.14{col 40}{space 1}   14.83{col 49}{space 3} 0.00{col 57}{space 4}    19.63{col 70}{space 3}    48.59
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}/lnsig2u {c |}{col 17}{res}{space 2}    -0.17{col 29}{space 2}     0.26{col 57}{space 4}    -0.68{col 70}{space 3}     0.34
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
        sigma_u {c |}{col 17}{res}{space 2}     0.92{col 29}{space 2}     0.12{col 57}{space 4}     0.71{col 70}{space 3}     1.19
{txt}            rho {c |}{col 17}{res}{space 2}     0.20{col 29}{space 2}     0.04{col 57}{space 4}     0.13{col 70}{space 3}     0.30
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}

{com}. 
{txt}end of do-file

{com}. 
. // TODO: Reinstate
. // // Make figures
. // do figures/figures
. 
. // TODO: Make Spider diagram for each process outcome
. // (see https://folkehelse.sharepoint.com/:i:/r/sites/1461/Restricted%20Documents/4.Research/Analysis,%20Sample%20Size,%20Randomizatio/eRegQual/radar_chart_eRegQual.png?csf=1&web=1&e=JeKbbU)
. 
. 
. 
. // Obtain the git revision hash, which is used in the reports.
. tempfile git_revision_filename
{txt}
{com}. tempname revision_file
{txt}
{com}. shell git rev-parse --short HEAD > "`git_revision_filename'"
{txt}

{com}. file open `revision_file' using `git_revision_filename', read text
{txt}
{com}. file read `revision_file' line
{txt}
{com}. global git_revision = "`macval(line)'"
{txt}
{com}. 
. // Make the report
. do reports/report products/report.docx
{txt}
{com}. version 16.1
{txt}
{com}. 
. args filename
{txt}
{com}. 
. // Some locals to make this file a little more readable.
. local heading putdocx paragraph, style(Heading1)
{txt}
{com}. local newpara putdocx textblock begin, halign(both)
{txt}
{com}. local putdocx textblock end putdocx textblock end
{txt}
{com}. 
. local p_fmt  %5.2f // Format used for P-values.
{txt}
{com}. local e_fmt  %5.2f // Format used for estimates.
{txt}
{com}. local pc_fmt %8.1f // Format used for percentages.
{txt}
{com}. 
. local tbl_num = 0  // A table counter.
{txt}
{com}. 
. // Start the document.
. putdocx begin
{res}{txt}
{com}. 
. // Title.
. putdocx paragraph, style(Title)
{res}{txt}
{com}. putdocx text ("eRegQual analysis")
{res}{txt}
{com}. 
. // Author and revision information.
. `newpara'
{res}{txt}
{com}. `newpara'
{res}{txt}
{com}. 
. // Introduction section.
. `heading'
{res}{txt}
{com}. putdocx text ("Introduction")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. // Methods section
. `heading'
{res}{txt}
{com}. putdocx text ("Methods")
{res}{txt}
{com}. 
. //// TODO: Reinstate
> //// `newpara'
> //// Because outcome data were missing for about a third of participants (see 
> //// results), we used Little's tests (Little 1988) of the null hypotheses that 
> //// missing values of the constituent outcomes were jointly missing completely at 
> //// random (MCAR) and covariate-dependent missing (CDM). We then used multiple 
> //// imputation via chained equations (van Buuren 2007) to create and analyze 
> //// <<dd_docx_display: $m_imputations>> multiply-imputed datasets. We imputed each 
> //// of the constituent outcomes using the auxiliary variables age, BMI, years of 
> //// education, average monthly household income (transformed to the log scale due 
> //// to the skewed distribution of income), and variables that indicated whether a 
> //// laboratory or ultrasound were available at the clinics; the variables included 
> //// in the analysis described below were also included. We were not able to include 
> //// auxiliary variables that indicated previous pregnancy with pre-eclampsia or 
> //// previous history of GDM due to collinearity. We evaluated the convergence of the 
> //// imputation algorithm by inspecting trace plots and evaluated imputed data by 
> //// inspecting kernel density and bar plots comparing the distributions of imputed 
> //// and complete case data.
> //// putdocx textblock end
> //// 
> //// `newpara'
> //// For each imputed data set, we computed the composite outcome from the imputed 
> //// constituent outcome data. An adverse pregnancy outcome was defined to have 
> //// occurred if at least one of the constituent outcomes occurred, and not to have 
> //// occurred if none of the constituent outcomes occurred. For each imputed data 
> //// set and outcome, we estimated a risk ratio to compare treatment to control 
> //// and used  generalized estimating equations (GEE; binomial errors and log 
> //// link) to account for the cluster-randomized design. We combined estimates 
> //// for each outcome using Rubin's rules (Rubin 2004). For comparison, we also 
> //// performed a complete case analysis under the MCAR assumption. We estimated 
> //// the intraclass correlation coefficient (ICC) using the complete cases.
> //// putdocx textblock end
> 
. `newpara'
{res}{txt}
{com}. 
. // TODO: Make sure that the adjustments desribed below are applied to all 
. // analyses.
. 
. `newpara'
{res}{txt}
{com}. 
. // Results section
. `heading'
{res}{txt}
{com}. putdocx text ("Results")
{res}{txt}
{com}. 
. // Verify some assumptions in this section.
. //// TODO: Reinstate
> //// assert ${c -(}p_mcar{c )-} > 0.05
> //// assert ${c -(}p_cdm{c )-}  > 0.05
> 
. //// TODO: Reinstate
> //// `newpara'
> //// Outcome data were missing for between 
> //// <<dd_docx_display: string(${c -(}pc_min_miss{c )-}, "`pc_fmt'")>>% and 
> //// <<dd_docx_display: string(${c -(}pc_max_miss{c )-}, "`pc_fmt'")>>% of the constituent 
> //// outcomes, and <<dd_docx_display: string(${c -(}pc_miss_y{c )-}, "`pc_fmt'")>>% of the 
> //// composite outcome. We were unable to reject the MCAR and CDM hypotheses 
> //// (P=<<dd_docx_display: string(${c -(}p_mcar{c )-}, "`p_fmt'")>> and P=
> //// <<dd_docx_display: string(${c -(}p_cdm{c )-}, "`p_fmt'")>>, respectively). Distributions 
> //// of the original and the first five imputed data sets are shown in the Appendix. 
> //// Table 1 shows the result of the adverse pregnancy outcome analysis. The risk 
> //// ratio was estimated to be <<dd_docx_display: string(${c -(}rr_b_y{c )-}, "`e_fmt'")>> 
> //// (95% CI <<dd_docx_display: string(${c -(}rr_ll_y{c )-}, "`e_fmt'")>> to 
> //// <<dd_docx_display: string(${c -(}rr_ul_y{c )-}, "`e_fmt'")>>, P = 
> //// <<dd_docx_display: string(${c -(}rr_p_y{c )-}, "`p_fmt'")>>). This compares to the 
> //// complete case risk ratio of <<dd_docx_display: string(${c -(}cc_rr_b{c )-}, "`e_fmt'")>> 
> //// (95% CI <<dd_docx_display: string(${c -(}cc_rr_ll{c )-}, "`e_fmt'")>> to 
> //// <<dd_docx_display: string(${c -(}cc_rr_ul{c )-}, "`e_fmt'")>>, P = 
> //// <<dd_docx_display: string(${c -(}cc_rr_p{c )-}, "`p_fmt'")>>). Tables 2â€“6 show results for 
> //// the constituent outcomes. The ICC was estimated to be close to zero and no 
> //// greater than <<dd_docx_display: string(${c -(}icc_ub{c )-}, "%5.3f")>> (upper bound of 
> //// 95% CI).
> //// putdocx textblock end
> //// 
> //// frame imputed {c -(}
> ////   foreach var of varlist y y1-y5 {c -(}
> ////     local ++tbl_num
> ////     local var_label : variable label `var'
> ////     local title "Table `tbl_num'. `var_label' (multiply-imputed result)"
> ////     estimates replay `var'_estimates, eform
> ////     putdocx table tbl_`tbl_num' = etable, title("`title'")
> ////     putdocx table tbl_`tbl_num'(2, 2) = ("Risk Ratio"), halign(right)
> ////   {c )-}
> //// {c )-}
> 
. foreach outcome of global process_outcomes {c -(}
{txt}  2{com}.   frame `outcome' {c -(}
{txt}  3{com}.     local ++tbl_num  
{txt}  4{com}.     local var_label : variable label y
{txt}  5{com}.     local title "Table `tbl_num'. `var_label'"
{txt}  6{com}.     estimates replay `outcome'_estimates, or
{txt}  7{com}.     putdocx table tbl_`tbl_num' = etable, title("`title'")
{txt}  8{com}.     putdocx table tbl_`tbl_num'(2, 2) = ("Odds Ratio"), halign(right)
{txt}  9{com}.     putdocx table tbl_`tbl_num'(3, 2) = (""), halign(right) // Was "Coef."
{txt} 10{com}.     forvalues i = 20(-1)6 {c -(} // Drop rows that are not of immediate interest.
{txt} 11{com}.       putdocx table tbl_`tbl_num'(`i', .), drop
{txt} 12{com}.     {c )-}
{txt} 13{com}.   {c )-}
{txt} 14{com}. {c )-}

{txt}{hline}
{p 0 8}Model {hi:attendance_estimates}{p_end}
{hline}

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    21,703
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     5,200

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       4.2
{txt}{col 63}max{col 67}={col 69}{res}         5

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}   122.83
{txt}Log pseudolikelihood  = {res}-13691.523{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 81:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}              y{col 17}{c |} Odds Ratio{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}arm {c |}
{space 13}F  {c |}{col 17}{res}{space 2}     1.17{col 29}{space 2}     0.13{col 40}{space 1}    1.42{col 49}{space 3} 0.16{col 57}{space 4}     0.94{col 70}{space 3}     1.44
{txt}{space 15} {c |}
{space 6}strat_var {c |}
{space 8}8d9c30  {c |}{col 17}{res}{space 2}     0.61{col 29}{space 2}     0.11{col 40}{space 1}   -2.80{col 49}{space 3} 0.01{col 57}{space 4}     0.43{col 70}{space 3}     0.86
{txt}{space 8}9d5ed6  {c |}{col 17}{res}{space 2}     1.27{col 29}{space 2}     0.22{col 40}{space 1}    1.39{col 49}{space 3} 0.16{col 57}{space 4}     0.91{col 70}{space 3}     1.79
{txt}{space 8}e1e1d3  {c |}{col 17}{res}{space 2}     1.19{col 29}{space 2}     0.19{col 40}{space 1}    1.06{col 49}{space 3} 0.29{col 57}{space 4}     0.86{col 70}{space 3}     1.64
{txt}{space 8}ff4457  {c |}{col 17}{res}{space 2}     1.73{col 29}{space 2}     0.30{col 40}{space 1}    3.18{col 49}{space 3} 0.00{col 57}{space 4}     1.23{col 70}{space 3}     2.42
{txt}{space 15} {c |}
1.lab_available {c |}{col 17}{res}{space 2}     0.99{col 29}{space 2}     0.12{col 40}{space 1}   -0.06{col 49}{space 3} 0.95{col 57}{space 4}     0.78{col 70}{space 3}     1.26
{txt}{space 3}cluster_size {c |}{col 17}{res}{space 2}     1.13{col 29}{space 2}     0.03{col 40}{space 1}    4.42{col 49}{space 3} 0.00{col 57}{space 4}     1.07{col 70}{space 3}     1.19
{txt}{space 2}1.age_over_40 {c |}{col 17}{res}{space 2}     0.49{col 29}{space 2}     0.16{col 40}{space 1}   -2.18{col 49}{space 3} 0.03{col 57}{space 4}     0.25{col 70}{space 3}     0.93
{txt}{space 2}1.primiparous {c |}{col 17}{res}{space 2}     0.96{col 29}{space 2}     0.06{col 40}{space 1}   -0.60{col 49}{space 3} 0.55{col 57}{space 4}     0.86{col 70}{space 3}     1.09
{txt}{space 10}_cons {c |}{col 17}{res}{space 2}     0.43{col 29}{space 2}     0.08{col 40}{space 1}   -4.62{col 49}{space 3} 0.00{col 57}{space 4}     0.30{col 70}{space 3}     0.61
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}/lnsig2u {c |}{col 17}{res}{space 2}     0.60{col 29}{space 2}     0.08{col 57}{space 4}     0.45{col 70}{space 3}     0.76
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
        sigma_u {c |}{col 17}{res}{space 2}     1.35{col 29}{space 2}     0.05{col 57}{space 4}     1.25{col 70}{space 3}     1.46
{txt}            rho {c |}{col 17}{res}{space 2}     0.36{col 29}{space 2}     0.02{col 57}{space 4}     0.32{col 70}{space 3}     0.39
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:hypertension_estimates}{p_end}
{hline}

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    15,553
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     6,013

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       2.6
{txt}{col 63}max{col 67}={col 69}{res}         6

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    62.05
{txt}Log pseudolikelihood  = {res}-2760.1364{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 81:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}              y{col 17}{c |} Odds Ratio{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}arm {c |}
{space 13}J  {c |}{col 17}{res}{space 2}     0.60{col 29}{space 2}     0.07{col 40}{space 1}   -4.24{col 49}{space 3} 0.00{col 57}{space 4}     0.48{col 70}{space 3}     0.76
{txt}{space 15} {c |}
{space 6}strat_var {c |}
{space 8}8d9c30  {c |}{col 17}{res}{space 2}     1.15{col 29}{space 2}     0.24{col 40}{space 1}    0.68{col 49}{space 3} 0.50{col 57}{space 4}     0.77{col 70}{space 3}     1.72
{txt}{space 8}9d5ed6  {c |}{col 17}{res}{space 2}     1.55{col 29}{space 2}     0.28{col 40}{space 1}    2.46{col 49}{space 3} 0.01{col 57}{space 4}     1.09{col 70}{space 3}     2.19
{txt}{space 8}e1e1d3  {c |}{col 17}{res}{space 2}     1.21{col 29}{space 2}     0.22{col 40}{space 1}    1.03{col 49}{space 3} 0.30{col 57}{space 4}     0.84{col 70}{space 3}     1.74
{txt}{space 8}ff4457  {c |}{col 17}{res}{space 2}     1.76{col 29}{space 2}     0.31{col 40}{space 1}    3.15{col 49}{space 3} 0.00{col 57}{space 4}     1.24{col 70}{space 3}     2.50
{txt}{space 15} {c |}
1.lab_available {c |}{col 17}{res}{space 2}     1.15{col 29}{space 2}     0.14{col 40}{space 1}    1.16{col 49}{space 3} 0.24{col 57}{space 4}     0.91{col 70}{space 3}     1.47
{txt}{space 3}cluster_size {c |}{col 17}{res}{space 2}     0.97{col 29}{space 2}     0.03{col 40}{space 1}   -0.92{col 49}{space 3} 0.36{col 57}{space 4}     0.92{col 70}{space 3}     1.03
{txt}{space 2}1.age_over_40 {c |}{col 17}{res}{space 2}     0.50{col 29}{space 2}     0.15{col 40}{space 1}   -2.34{col 49}{space 3} 0.02{col 57}{space 4}     0.28{col 70}{space 3}     0.89
{txt}{space 2}1.primiparous {c |}{col 17}{res}{space 2}     1.02{col 29}{space 2}     0.11{col 40}{space 1}    0.16{col 49}{space 3} 0.87{col 57}{space 4}     0.83{col 70}{space 3}     1.25
{txt}{space 10}_cons {c |}{col 17}{res}{space 2}    30.88{col 29}{space 2}     7.14{col 40}{space 1}   14.83{col 49}{space 3} 0.00{col 57}{space 4}    19.63{col 70}{space 3}    48.59
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}/lnsig2u {c |}{col 17}{res}{space 2}    -0.17{col 29}{space 2}     0.26{col 57}{space 4}    -0.68{col 70}{space 3}     0.34
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
        sigma_u {c |}{col 17}{res}{space 2}     0.92{col 29}{space 2}     0.12{col 57}{space 4}     0.71{col 70}{space 3}     1.19
{txt}            rho {c |}{col 17}{res}{space 2}     0.20{col 29}{space 2}     0.04{col 57}{space 4}     0.13{col 70}{space 3}     0.30
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}{txt}
{com}. 
. // References
. `heading'
{res}{txt}
{com}. putdocx text ("References")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. // Appendix
. //// TODO: Reinstate
> //// `heading'
> //// putdocx text ("Appendix")
> 
. //// TODO: Reinstate
> //// `newpara'
> //// The following figures show the distributions of the original and a selection of 
> //// the imputed data.
> //// putdocx textblock end
> //// 
> //// foreach var of newlist y1-y5 y $imputeds {c -(} // newlist as vars only exist in (other) frames.
> ////   display "${c -(}`var'_plot_fname{c )-}"
> ////   putdocx image "${c -(}`var'_plot_fname{c )-}.png", linebreak
> //// {c )-}
> 
. // Save the report to the specified filename.
. putdocx save `"`filename'"', replace
{res}successfully replaced {browse "/Users/cjr/Repos/fhi.eRegQual.2020/products/report.docx":"/Users/cjr/Repos/fhi.eRegQual.2020/products/report.docx"}
{txt}
{com}. 
{txt}end of do-file

{com}. 
{txt}end of do-file

{com}. 