{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}eRegQual Analysis
       {txt}log:  {res}/Users/cjr/Repos/fhi.eRegQual.2020/products/log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 2 Jul 2020, 09:38:26
{txt}
{com}. 
. // Set up Stata.
. do setup/setup
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Set the random number generator seed.
. set seed 1234
{txt}
{com}. 
. // Set up Stata's path to use the "packages" directory for add-on packages.
. net set ado "./packages"
{txt}
{com}. sysdir set PERSONAL "./packages"
{txt}
{com}. 
. // Specify formats.
. set cformat %9.2f
{txt}
{com}. set pformat %5.2f
{txt}
{com}. set sformat %8.2f
{txt}
{com}. 
. 
{txt}end of do-file

{com}. 
. // Set up globals.
. do globals/globals
{txt}
{com}. version 16.1
{txt}
{com}. 
. // The number of imputations to perform.
. // TODO: Set back to 50.
. global m_imputations 10 // Very slightly narrower CI if m=100.
{txt}
{com}. 
. // Define the names of the process outcomes.
. global process_outcomes attendance hypertension diabetes malpresentation
{txt}
{com}. 
. // The variables to adjust for, with their "types". See the generated report for
. // an explanation of why these variables are adjusted for.
. global adj_vars i.strat_var c.cluster_size i.lab_available i.age_over_40 ///
>                 i.primiparous
{txt}
{com}. global adj_var_names // A global with just the *names* of the adj_vars
{txt}
{com}. foreach x of global adj_vars {c -(}
{txt}  2{com}.   local x_name = substr("`x'", 3, .) // Remove the i. or c.
{txt}  3{com}.   global adj_var_names $adj_var_names `x_name'
{txt}  4{com}. {c )-}
{txt}
{com}. 
. // Define paths to the process outcome files.
. global fname_attendance      "data/raw/25June2020_eRegQual process outcomes_attendance.dta"
{txt}
{com}. global fname_hypertension    "data/raw/25June2020_eRegQual process outcomes_hypertension.dta"
{txt}
{com}. global fname_diabetes        "data/raw/25June2020_eRegQual process outcomes_diabetes.dta"
{txt}
{com}. global fname_malpresentation "data/raw/25June2020_eRegQual process outcomes_malpresentation.dta"
{txt}
{com}. 
. // Define data signatures for the process outcome files.
. global datasignature_attendance          "6367:39(51496):3578513271:2127801624"
{txt}
{com}. global datasignature_hypertension        "6367:60(68365):3970041110:3735367683"
{txt}
{com}. global datasignature_diabetes            "6367:38(91264):1895688975:3113856828"
{txt}
{com}. global datasignature_malpresentation     "6367:31(88392):1586201653:3483051938"
{txt}
{com}. 
{txt}end of do-file

{com}. 
. // Import birth outcome data and perform imputation.
. do data/birth_outcomes
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Define the path to the data and the signature we expect it to have.
. local fname "data/raw/04May2020_eRegQual birth outcomes.dta"
{txt}
{com}. local signature "6367:756(27238):862839612:1580475191"
{txt}
{com}. 
. frame create original
{txt}
{com}. frame original {c -(}
.   // Load the data and check its signature is as expected.
.   use "`fname'", replace
.   datasignature
  {res}6367:756(27238):862839612:1580475191
{com}.   assert r(datasignature) == "`signature'"
. 
.   // Globals that specify the imputed and regular variables.
.   global imputeds
.   global regulars
. 
.   // Convert the arm variable from string to integer.
.   encode prettyExposure, generate(arm)
.   label variable arm Arm
.   fvset base 1 arm
.   global regulars $regulars arm
. 
.   // Convert the stratification variable from string to integer.
.   encode bookorgdistricthashed, generate(strat_var)
.   label variable strat_var District
.   fvset base 1 strat_var
.   global regulars $regulars strat_var
. 
.   // Rename and label the cluster identifier variable.
.   rename str_TRIAL_1_Cluster clusterid
{res}{com}.   label variable clusterid Cluster
.   global regulars $regulars clusterid
. 
.   // Rename the components of the composite outcome.
.   rename anemia_at_birth              y1
{res}{com}.   label variable                      y1 "Anemia at birth"
.   rename severehypertension_at_birth  y2
{res}{com}.   label variable                      y2 "Severe hypertension at birth"
.   rename sga_undetected_at_birth      y3
{res}{com}.   label variable                      y3 "SGA undetected at birth"
.   rename malpres_undetected           y4
{res}{com}.   label variable                      y4 "Malpresentation undetected at birth"
.   rename lga                          y5
{res}{com}.   label variable                      y5 "Large for gestational age"
. 
.   // Apply labels to the outcomes.
.   label define yes_no_label 0 "No" 1 "Yes"
.   label values y* yes_no_label
. 
.   // Age.
.   replace age = . if age <= 1 // Correct some mis-coded values of the age variable.
{txt}(35 real changes made, 35 to missing)
{com}.   label variable age "Age (years)"
.   global imputeds $imputeds age
. 
.   // BMI.
.   rename bookbmi bmi
{res}{com}.   replace bmi = . if bmi < 15 | bmi > 48 // Same policy as for categorical version.
{txt}(54 real changes made, 54 to missing)
{com}.   label variable bmi "Body mass index"
.   global imputeds $imputeds bmi
. 
.   // Education.
.   label variable education "Education (years)"
.   global imputeds $imputeds education
. 
.   // Income.
.   generate log_income = log(avgincome) // Log to approximately normalize.
{txt}(404 missing values generated)
{com}.   label variable log_income "Monthly household income (ILS; log scale)"
.   global imputeds $imputeds log_income
. 
.   // Lab availability.
.   label variable lab_available "Lab available"
.   label define lab_available_label 1 "Lab" 0 "No lab"
.   label values lab_available lab_available_label
.   global regulars $regulars lab_available
.   
.   // Generate an indicator for whether each woman is primiparous.
.   rename bookprimi primiparous
{res}{com}.   label variable primiparous   "Parity"
.   label define primiparous_label 1 "Primiparous" 0 "Multiparous"
.   label values primiparous primiparous_label
.   global imputeds $imputeds primiparous
.   
.   // Compute the cluster size from the trial data. We use the trial data for
.   // simplicity and have verified that these agree with the "baseline" data on
.   // trial size. We divide by 100 because cluster sizes range from about 10 to
.   // about 220, and we want to get regression coefficients that are non-null
.   // within two decimal places!
.   by clusterid, sort: generate cluster_size = _N / 100
.   global regulars $regulars cluster_size
. 
.   // Ultrasound available.
.   label variable us_available "US available"
.   global regulars $regulars us_available
. 
.   // Verify that all of the regular variables are complete, and that each of the
.   // variables to be imputed contain missing values.
.   misstable summarize $regulars
{txt}(variables nonmissing or string)
{com}.   assert r(N_eq_dot) + r(N_gt_dot) == .
.   foreach x of varlist y1-y5 $imputeds {c -(}
{txt}  2{com}.     misstable summarize `x'
{txt}  3{com}.     assert r(N_eq_dot) + r(N_gt_dot) != .
{txt}  4{com}.   {c )-}
{txt}{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y1 {c |}{res}     1,743{txt}{space 10}{res}     4,624{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y2 {c |}{res}     2,258{txt}{space 10}{res}     4,109{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y3 {c |}{res}       752{txt}{space 10}{res}     5,615{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y4 {c |}{res}       875{txt}{space 10}{res}     5,492{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y5 {c |}{res}       752{txt}{space 10}{res}     5,615{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
           age {c |}{res}        69{txt}{space 10}{res}     6,298{txt}  {c |}     32         14          45
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
           bmi {c |}{res}       938{txt}{space 10}{res}     5,429{txt}  {c |}   >500   15.42969    47.98243
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
     education {c |}{res}       203{txt}{space 10}{res}     6,164{txt}  {c |}     25          1          24
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
    log_income {c |}{res}       404{txt}{space 10}{res}     5,963{txt}  {c |}    222  -5.926926    8.922658
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
   primiparous {c |}{res}       119{txt}{space 10}{res}     6,248{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{com}. 
.   // Keep only the variables of interest.
.   keep y* $imputeds $regulars TrialOne_adverse_pregoutc
. {c )-}
{txt}
{com}. 
{txt}end of do-file

{com}. do data/impute
{txt}
{com}. version 16.1
{txt}
{com}. 
. frame copy original imputed, replace
{txt}(note: frame {bf:imputed} not found)

{com}. frame imputed {c -(}
.   // Obtain the sample size (before imputation).
.   local sample_size = _N
. 
.   // Set up the imputation and the roles of the variables.
.   mi set mlong
.   mi register imputed $imputeds y1-y5
{res}{txt}{p}
(3434 {it:m}=0 obs. now marked as incomplete)
{p_end}
{com}.   mi register regular $regulars
. 
.   // Perform imputation. Due to collinearity between the constituent outcome
.   // variables y1-y5, these variables are exluded as predictors for one another.
.   // It was not possible to include the stratification variable due to perfect
.   // prediction (possibly too many variables in the models?)
.   mi impute chained                                                    ///
>     (regress)                           age bmi education log_income   ///
>     (logit)                             primiparous                    ///
>     (logit, omit(i.y2 i.y3 i.y4 i.y5))  y1                             ///
>     (logit, omit(i.y1 i.y3 i.y4 i.y5))  y2                             ///
>     (logit, omit(i.y1 i.y2 i.y4 i.y5))  y3                             ///
>     (logit, omit(i.y1 i.y2 i.y3 i.y5))  y4                             ///
>     (logit, omit(i.y1 i.y2 i.y3 i.y4))  y5                             ///
>     = i.arm c.cluster_size i.us_available i.lab_available, ///
>     add($m_imputations)
{res}
{txt}Conditional models:
{p 15 21 2}
{bf:age}: regress age i.primiparous education log_income i.y3 i.y5 i.y4 bmi i.y1 i.y2 ib1.arm cluster_size i.us_available i.lab_available
{p_end}
{p 7 21 2}
{bf:primiparous}: logit primiparous age education log_income i.y3 i.y5 i.y4 bmi i.y1 i.y2 ib1.arm cluster_size i.us_available i.lab_available
{p_end}
{p 9 21 2}
{bf:education}: regress education age i.primiparous log_income i.y3 i.y5 i.y4 bmi i.y1 i.y2 ib1.arm cluster_size i.us_available i.lab_available
{p_end}
{p 8 21 2}
{bf:log_income}: regress log_income age i.primiparous education i.y3 i.y5 i.y4 bmi i.y1 i.y2 ib1.arm cluster_size i.us_available i.lab_available
{p_end}
{p 16 21 2}
{bf:y3}: logit y3 age i.primiparous education log_income bmi ib1.arm cluster_size i.us_available i.lab_available
{p_end}
{p 16 21 2}
{bf:y5}: logit y5 age i.primiparous education log_income bmi ib1.arm cluster_size i.us_available i.lab_available
{p_end}
{p 16 21 2}
{bf:y4}: logit y4 age i.primiparous education log_income bmi ib1.arm cluster_size i.us_available i.lab_available
{p_end}
{p 15 21 2}
{bf:bmi}: regress bmi age i.primiparous education log_income i.y3 i.y5 i.y4 i.y1 i.y2 ib1.arm cluster_size i.us_available i.lab_available
{p_end}
{p 16 21 2}
{bf:y1}: logit y1 age i.primiparous education log_income bmi ib1.arm cluster_size i.us_available i.lab_available
{p_end}
{p 16 21 2}
{bf:y2}: logit y2 age i.primiparous education log_income bmi ib1.arm cluster_size i.us_available i.lab_available
{p_end}

{res}{txt}Performing chained iterations ...
{res}{txt}
Multivariate imputation{txt}{col 45}{ralign 12:Imputations }= {res}      10
{txt}Chained equations{txt}{col 45}{ralign 12:added }= {res}      10
{txt}Imputed: {it:m}=1 through {it:m}=10{txt}{col 45}{ralign 12:updated }= {res}       0

{txt}Initialization: {res}monotone{txt}{col 45}{ralign 12:Iterations }= {res}     100
{txt}{col 45}{ralign 12:burn-in }= {res}      10

{txt}{p 15 15 2}{bf:age}: linear regression{p_end}
{txt}{p 15 15 2}{bf:bmi}: linear regression{p_end}
{txt}{p 9 15 2}{bf:education}: linear regression{p_end}
{txt}{p 8 15 2}{bf:log_income}: linear regression{p_end}
{txt}{p 7 15 2}{bf:primiparous}: logistic regression{p_end}
{txt}{p 16 15 2}{bf:y1}: logistic regression{p_end}
{txt}{p 16 15 2}{bf:y2}: logistic regression{p_end}
{txt}{p 16 15 2}{bf:y3}: logistic regression{p_end}
{txt}{p 16 15 2}{bf:y4}: logistic regression{p_end}
{txt}{p 16 15 2}{bf:y5}: logistic regression{p_end}

{txt}{hline 19}{c TT}{hline 35}{hline 11}
{txt}{col 20}{c |}{center 46:  Observations per {it:m}}
{txt}{col 20}{c LT}{hline 35}{c TT}{hline 10}
{txt}{col 11}Variable {c |}{ralign 12:Complete }{ralign 13:Incomplete }{ralign 10:Imputed }{c |}{ralign 10:Total}
{hline 19}{c +}{hline 35}{c +}{hline 10}
{txt}{ralign 19:age }{c |}{res}       6298           69        69 {txt}{c |}{res}      6367
{txt}{ralign 19:bmi }{c |}{res}       5429          938       938 {txt}{c |}{res}      6367
{txt}{ralign 19:education }{c |}{res}       6164          203       203 {txt}{c |}{res}      6367
{txt}{ralign 19:log_income }{c |}{res}       5963          404       404 {txt}{c |}{res}      6367
{txt}{ralign 19:primiparous }{c |}{res}       6248          119       119 {txt}{c |}{res}      6367
{txt}{ralign 19:y1 }{c |}{res}       4624         1743      1743 {txt}{c |}{res}      6367
{txt}{ralign 19:y2 }{c |}{res}       4109         2258      2258 {txt}{c |}{res}      6367
{txt}{ralign 19:y3 }{c |}{res}       5615          752       752 {txt}{c |}{res}      6367
{txt}{ralign 19:y4 }{c |}{res}       5492          875       875 {txt}{c |}{res}      6367
{txt}{ralign 19:y5 }{c |}{res}       5615          752       752 {txt}{c |}{res}      6367
{txt}{hline 19}{c BT}{hline 35}{c BT}{hline 10}
{p 0 1 1 66}(complete + incomplete = total; imputed is the minimum across {it:m}
 of the number of filled-in observations.){p_end}
{com}. 
.   // Compute age over 40, which is based on age, which is imputed.
.   mi passive: generate age_over_40 = age > 40
{res}{txt}{it:m}=0:
{res}{txt}{it:m}=1:
{res}{txt}{it:m}=2:
{res}{txt}{it:m}=3:
{res}{txt}{it:m}=4:
{res}{txt}{it:m}=5:
{res}{txt}{it:m}=6:
{res}{txt}{it:m}=7:
{res}{txt}{it:m}=8:
{res}{txt}{it:m}=9:
{res}{txt}{it:m}=10:
{res}{com}.   label variable age_over_40 "Age"
.   label define age_over_40_label 1 ">40 years" 0 "≤40 years"
.   label values age_over_40 age_over_40_label
. 
.   // The composite outcome is defined as follows. If:
.   // * All of the outcomes are false -> composite outcome is false;
.   // * At least one of the outcomes is true -> composite outcome is true;
.   // * One or more of the outcomes are missing and all others are false
.   //   -> composite outcome is missing.
.   tempvar all_false
.   mi passive: generate `all_false' = ///
>     (y1 == 0) & (y2 == 0) & (y3 == 0) & (y4 == 0) & (y5 == 0)
{res}{txt}{it:m}=0:
{res}{txt}{it:m}=1:
{res}{txt}{it:m}=2:
{res}{txt}{it:m}=3:
{res}{txt}{it:m}=4:
{res}{txt}{it:m}=5:
{res}{txt}{it:m}=6:
{res}{txt}{it:m}=7:
{res}{txt}{it:m}=8:
{res}{txt}{it:m}=9:
{res}{txt}{it:m}=10:
{res}{com}.   tempvar one_true
.   mi passive: generate `one_true'  = ///
>     (y1 == 1) | (y2 == 1) | (y3 == 1) | (y4 == 1) | (y5 == 1)
{res}{txt}{it:m}=0:
{res}{txt}{it:m}=1:
{res}{txt}{it:m}=2:
{res}{txt}{it:m}=3:
{res}{txt}{it:m}=4:
{res}{txt}{it:m}=5:
{res}{txt}{it:m}=6:
{res}{txt}{it:m}=7:
{res}{txt}{it:m}=8:
{res}{txt}{it:m}=9:
{res}{txt}{it:m}=10:
{res}{com}. 
.   // Compute the composite outcome.
.   mi passive: generate y = .
{res}{txt}{it:m}=0:
(6,367 missing values generated)
{res}{txt}{it:m}=1:
(6,367 missing values generated)
{res}{txt}{it:m}=2:
(6,367 missing values generated)
{res}{txt}{it:m}=3:
(6,367 missing values generated)
{res}{txt}{it:m}=4:
(6,367 missing values generated)
{res}{txt}{it:m}=5:
(6,367 missing values generated)
{res}{txt}{it:m}=6:
(6,367 missing values generated)
{res}{txt}{it:m}=7:
(6,367 missing values generated)
{res}{txt}{it:m}=8:
(6,367 missing values generated)
{res}{txt}{it:m}=9:
(6,367 missing values generated)
{res}{txt}{it:m}=10:
(6,367 missing values generated)
{res}{com}.   mi passive: replace  y = 0 if `all_false'
{res}{txt}{it:m}=0:
(2,818 real changes made)
{res}{txt}{it:m}=1:
(4,757 real changes made)
{res}{txt}{it:m}=2:
(4,740 real changes made)
{res}{txt}{it:m}=3:
(4,727 real changes made)
{res}{txt}{it:m}=4:
(4,761 real changes made)
{res}{txt}{it:m}=5:
(4,763 real changes made)
{res}{txt}{it:m}=6:
(4,756 real changes made)
{res}{txt}{it:m}=7:
(4,750 real changes made)
{res}{txt}{it:m}=8:
(4,732 real changes made)
{res}{txt}{it:m}=9:
(4,741 real changes made)
{res}{txt}{it:m}=10:
(4,758 real changes made)
{res}{com}.   mi passive: replace  y = 1 if `one_true'
{res}{txt}{it:m}=0:
(1,396 real changes made)
{res}{txt}{it:m}=1:
(1,610 real changes made)
{res}{txt}{it:m}=2:
(1,627 real changes made)
{res}{txt}{it:m}=3:
(1,640 real changes made)
{res}{txt}{it:m}=4:
(1,606 real changes made)
{res}{txt}{it:m}=5:
(1,604 real changes made)
{res}{txt}{it:m}=6:
(1,611 real changes made)
{res}{txt}{it:m}=7:
(1,617 real changes made)
{res}{txt}{it:m}=8:
(1,635 real changes made)
{res}{txt}{it:m}=9:
(1,626 real changes made)
{res}{txt}{it:m}=10:
(1,609 real changes made)
{res}{com}.   label variable y "Adverse pregnancy outcome"
. 
.   // Verify that we can correctly recompute the composite outcome using the
.   // original (non-imputed) data.
.   count if y == TrialOne_adverse_pregoutc & _mi_m == 0
  {res}6,367
{com}.   assert r(N) == `sample_size'
. {c )-}
{txt}
{com}. 
. 
{txt}end of do-file

{com}. 
. // Import the process outcome data.
. do data/process_outcomes
{txt}
{com}. version 16.1
{txt}
{com}. 
. foreach outcome of global process_outcomes {c -(}
{txt}  2{com}.   frame create `outcome'
{txt}  3{com}.   frame `outcome' {c -(}
{txt}  4{com}.     // Load the data and check its signature is as expected.
.     use "${c -(}fname_`outcome'{c )-}", replace
{txt}  5{com}.     datasignature
{txt}  6{com}.     assert r(datasignature) == "${c -(}datasignature_`outcome'{c )-}"
{txt}  7{com}. 
.     // Encode/rename arm and cluster identifier variables.
.     encode prettyExposure, generate(arm)
{txt}  8{com}.     rename str_TRIAL_1_Cluster clusterid
{txt}  9{com}. 
.     // Compute the cluster size from the trial data. We use the trial data for
.     // simplicity and have verified that these agree with the "baseline" data on
.     // trial size. We divide by 100 because cluster sizes range from about 10 to
.     // about 220, and we want to get regression coefficients that are non-null
.     // within two decimal places! Note that cluster size computation must be
.     // done before the data set is reshaped to long format, or we will count
.     // one enrollment per visit rather than pregnancy.
.     by clusterid, sort: generate cluster_size = _N / 100
{txt} 10{com}. 
.     // Reshape to long format. Note that the uniqueid variable is not actually
.     // unique but identifies women, who can have multiple pregnancies (but not
.     // twins in this data set). Rows in the wide data frame are pregnancies, so
.     // we simply generate a unique pregnancy number for each row. We generate a 
.     // visit variable, as each woman (pregnancy) may attend clinic multiple times. 
.     generate pregnancy = _n
{txt} 11{com}.     local stubs opportunity_`outcome'_ success_`outcome'_
{txt} 12{com}.     reshape long `stubs', i(pregnancy) j(visit)
{txt} 13{com}. 
.     // While the outcome variable is a factor with three levels, we are only 
.     // interested in the relative odds of success. The other levels are 
.     // "NOT SUCCESSFUL" and "NOT APPLICABLE". Not applicable is not of 
.     // scientific interest here.
.     local success_label_name = "`: value label success_`outcome'_'"
{txt} 14{com}.     drop if      success_`outcome'_ == "NOT APPLICABLE":`success_label_name'
{txt} 15{com}.     generate y = success_`outcome'_ == "SUCCESSFUL":`success_label_name'
{txt} 16{com}. 
.     // Convert the stratification variable from string to integer.
.     encode bookorgdistricthashed, generate(strat_var)
{txt} 17{com}. 
.     // Generate an indicator for whether each woman is aged > 40 years.
.     generate age_over_40 = age > 40
{txt} 18{com}.     
.     // Generate an indicator for whether each woman is primiparous.
.     rename bookprimi primiparous
{txt} 19{com}. 
.     // Keep only the variables of interest.
.     keep y arm pregnancy visit clusterid $adj_var_names
{txt} 20{com}. 
.     // Label the variables
.     label variable y             "Successful `outcome'"
{txt} 21{com}.     label variable arm           "Study arm"
{txt} 22{com}.     label variable pregnancy     "Pregnancy"
{txt} 23{com}.     label variable clusterid     "Cluster"
{txt} 24{com}.     label variable strat_var     "District"
{txt} 25{com}.     label variable lab_available "Lab availability"
{txt} 26{com}.     label variable cluster_size  "Cluster size" // 100s of new enrollments
{txt} 27{com}.     label variable age_over_40   "Age"          // Indicator of age > 40.
{txt} 28{com}.     label variable primiparous   "Parity"       // Indicator of primiparity.
{txt} 29{com}. 
.     // Label values.
.     label define lab_available_label 1 "Lab" 0 "No lab"
{txt} 30{com}.     label values lab_available lab_available_label
{txt} 31{com}.     label define age_over_40_label 1 ">40 years" 0 "≤40 years"
{txt} 32{com}.     label values age_over_40 age_over_40_label
{txt} 33{com}.     label define primiparous_label 1 "Primiparous" 0 "Multiparous"
{txt} 34{com}.     label values primiparous primiparous_label
{txt} 35{com}. 
.     // There should be no missing data.
.     misstable summarize, all
{txt} 36{com}.     assert r(N_lt_dot) == _N
{txt} 37{com}. 
.     // For most of the process outcomes, we have multiple visits within
.     // pregnancy; we model the cluster-randomized design in the estimation.
.     // For malpresentation, there is only one visit and so cluster can be the
.     // panel variable. Note that the xtlogit-based analysis with cluster as the
.     // panel variable gives identical point estimates and confidence intervals
.     // as a melogit-based analysis with cluster as the random effect.
.     if "`outcome'" != "malpresentation" xtset pregnancy visit
{txt} 38{com}.     if "`outcome'" == "malpresentation" xtset clusterid
{txt} 39{com}. 
.     // TODO: If you generate an OR for this analysis, switch the birth outcomes
.     // to OR, too. Make sure you update the report text if you change the link.
.   {c )-}
{txt} 40{com}. {c )-}
  {res}6367:39(51496):3578513271:2127801624
{txt}(note: j = 1 2 3 4 5)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    6367   {txt}->{res}   31835
{txt}Number of variables            {res}      42   {txt}->{res}      35
{txt}j variable (5 values)                     ->   {res}visit
{txt}xij variables:
{res}opportunity_attendance_1 opportunity_attendance_2 ... opportunity_attendance_5{txt}->{res}opportunity_attendance_
success_attendance_1 success_attendance_2 ... success_attendance_5{txt}->{res}success_attendance_
{txt}{hline 77}
(10,132 observations deleted)
{res}{txt}{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
     pregnancy {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}   >500          2        6366
         visit {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      5          1           5
     clusterid {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}    119          1         120
   primiparous {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      2          0           1
  lab_availa~e {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      2          0           1
           arm {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      2          1           2
  cluster_size {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}     70        .09        2.17
             y {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      2          0           1
     strat_var {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      5          1           5
   age_over_40 {c |}{space 10}{space 10}{res}    21,703{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{res}{txt}{col 8}panel variable:  {res}pregnancy (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}visit, 1 to 5
{txt}{col 17}delta:  {res}1 unit
  6367:60(68365):3970041110:3735367683
{txt}(note: j = 1 2 3 4 5 6 7 8)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    6367   {txt}->{res}   50936
{txt}Number of variables            {res}      63   {txt}->{res}      50
{txt}j variable (8 values)                     ->   {res}visit
{txt}xij variables:
{res}opportunity_hypertension_1 opportunity_hypertension_2 ... opportunity_hypertension_8{txt}->{res}opportunity_hypertension_
success_hypertension_1 success_hypertension_2 ... success_hypertension_8{txt}->{res}success_hypertension_
{txt}{hline 77}
(35,383 observations deleted)
{res}{txt}{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
     pregnancy {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}   >500          1        6367
         visit {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      8          1           8
     clusterid {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}    119          1         120
   primiparous {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      2          0           1
  lab_availa~e {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      2          0           1
           arm {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      2          1           2
  cluster_size {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}     70        .09        2.17
             y {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      2          0           1
     strat_var {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      5          1           5
   age_over_40 {c |}{space 10}{space 10}{res}    15,553{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{res}{txt}{col 8}panel variable:  {res}pregnancy (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}visit, 1 to 8, but with gaps
{txt}{col 17}delta:  {res}1 unit
  6367:38(91264):1895688975:3113856828
{txt}(note: j = 1 2 3 4)
(note: success_diabetes_2 not found)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    6367   {txt}->{res}   25468
{txt}Number of variables            {res}      41   {txt}->{res}      37
{txt}j variable (4 values)                     ->   {res}visit
{txt}xij variables:
{res}opportunity_diabetes_1 opportunity_diabetes_2 ... opportunity_diabetes_4{txt}->{res}opportunity_diabetes_
success_diabetes_1 success_diabetes_2 ... success_diabetes_4{txt}->{res}success_diabetes_
{txt}{hline 77}
(13,340 observations deleted)
{res}{txt}{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
     pregnancy {c |}{space 10}{space 10}{res}    12,128{txt}  {c |}   >500          1        6367
         visit {c |}{space 10}{space 10}{res}    12,128{txt}  {c |}      4          1           4
     clusterid {c |}{space 10}{space 10}{res}    12,128{txt}  {c |}    119          1         120
   primiparous {c |}{space 10}{space 10}{res}    12,128{txt}  {c |}      2          0           1
  lab_availa~e {c |}{space 10}{space 10}{res}    12,128{txt}  {c |}      2          0           1
           arm {c |}{space 10}{space 10}{res}    12,128{txt}  {c |}      2          1           2
  cluster_size {c |}{space 10}{space 10}{res}    12,128{txt}  {c |}     70        .09        2.17
             y {c |}{space 10}{space 10}{res}    12,128{txt}  {c |}      2          0           1
     strat_var {c |}{space 10}{space 10}{res}    12,128{txt}  {c |}      5          1           5
   age_over_40 {c |}{space 10}{space 10}{res}    12,128{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{res}{txt}{col 8}panel variable:  {res}pregnancy (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}visit, 1 to 4, but with gaps
{txt}{col 17}delta:  {res}1 unit
  6367:31(88392):1586201653:3483051938
{txt}(note: j = 1)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    6367   {txt}->{res}    6367
{txt}Number of variables            {res}      34   {txt}->{res}      35
{txt}j variable (1 values)                     ->   {res}visit
{txt}xij variables:
          {res}opportunity_malpresentation_1   {txt}->   {res}opportunity_malpresentation_
              success_malpresentation_1   {txt}->   {res}success_malpresentation_
{txt}{hline 77}
(4,427 observations deleted)
{res}{txt}{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
     pregnancy {c |}{space 10}{space 10}{res}     1,940{txt}  {c |}   >500         16        6366
         visit {c |}{space 10}{space 10}{res}     1,940{txt}  {c |}      1          1           1
     clusterid {c |}{space 10}{space 10}{res}     1,940{txt}  {c |}    116          1         120
   primiparous {c |}{space 10}{space 10}{res}     1,940{txt}  {c |}      2          0           1
  lab_availa~e {c |}{space 10}{space 10}{res}     1,940{txt}  {c |}      2          0           1
           arm {c |}{space 10}{space 10}{res}     1,940{txt}  {c |}      2          1           2
  cluster_size {c |}{space 10}{space 10}{res}     1,940{txt}  {c |}     68         .1        2.17
             y {c |}{space 10}{space 10}{res}     1,940{txt}  {c |}      2          0           1
     strat_var {c |}{space 10}{space 10}{res}     1,940{txt}  {c |}      5          1           5
   age_over_40 {c |}{space 10}{space 10}{res}     1,940{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 8}panel variable:  {res}clusterid (unbalanced)
{txt}
{com}. 
{txt}end of do-file

{com}. 
. // Do estimation.
. do estimation/missing          // Calculate percentage of data missing.
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Local macro to compute percentage of data that are missing following a
. // misstable patterns command.
. local pc_miss 100 * (r(N_incomplete) / (r(N_incomplete) + r(N_complete)))
{txt}
{com}. 
. frame imputed {c -(}
.   // Plot the density of each of the continuous imputed variables.
.   foreach var of global imputeds {c -(}
{txt}  2{com}.     quietly misstable patterns `var' if _mi_m == 0
{txt}  3{com}.     global pc_miss_`var' = `pc_miss'
{txt}  4{com}.   {c )-}
. 
.   // Estimate the percentages of missing data for the outcome variables.
.   foreach var of varlist y y1-y5 {c -(}
{txt}  2{com}.     quietly misstable patterns `var' if _mi_m == 0
{txt}  3{com}.     global pc_miss_`var' = `pc_miss'
{txt}  4{com}.   {c )-}
. {c )-}
{txt}
{com}. 
. local miss_vars $pc_miss_y1, $pc_miss_y2, $pc_miss_y3, $pc_miss_y4, $pc_miss_y5
{txt}
{com}. global pc_min_miss = min(`miss_vars')
{txt}
{com}. global pc_max_miss = max(`miss_vars')
{txt}
{com}. 
. 
{txt}end of do-file

{com}. do estimation/mcar             // Test the MCAR hypothesis.
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Test the null hypothesis that the constituent outcomes are jointly MCAR, and
. // the null that the constituent outcomes are jointly CDM (a type of MCAR).
. // P < 0.05 would reject the hypotheses (i.e., as usual, if P>= 0.05, we cannot
. // "conclude" that the data are MCAR or have CDM, merely that we cannot reject
. // those hypotheses).
. frame original {c -(}
.   mcartest y1-y5
{res}{txt}{p 0 6}note: 560 {txt}observations {txt}omitted from EM estimation because of all {txt}imputation variables missing{p_end}
{res}
{txt}Little's MCAR test

Number of obs       = {res}5807
{txt}Chi-square distance = {res}42.4844     
{txt}Degrees of freedom  = {res}34
{txt}Prob > chi-square   = {res}0.1507
{com}.   global p_mcar = r(p)
.   mcartest y1-y5 = i.arm i.strat_var
{res}{txt}{p 0 6}note: 560 {txt}observations {txt}omitted from EM estimation because of all {txt}imputation variables missing{p_end}
{res}
{txt}Little's CDM test

Number of obs       = {res}5807
{txt}Chi-square distance = {res}196.2496    
{txt}Degrees of freedom  = {res}204
{txt}Prob > chi-square   = {res}0.6389
{com}.   global p_cdm  = r(p)
. {c )-}
{txt}
{com}. 
. 
{txt}end of do-file

{com}. do estimation/birth_outcomes   // Analyze the birth outcome data.
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Specify the model.
. local model xtlogit \`var' i.arm $adj_vars
{txt}
{com}. 
. // Compute the complete case estimate.
. tempname original
{txt}
{com}. frame copy imputed `original'
{txt}
{com}. frame `original' {c -(}
.   // Fit the model.
.   mi extract 0, clear
.   xtset clusterid
{txt}{col 8}panel variable:  {res}clusterid (unbalanced)
{com}.   local var y
.   `model', or

{txt}Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-2639.2383}  
Iteration 1:{space 3}log likelihood = {res:-2627.8275}  
Iteration 2:{space 3}log likelihood = {res:-2627.8022}  
Iteration 3:{space 3}log likelihood = {res:-2627.8022}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log likelihood = {res}-2627.8022
{txt}tau = {res} 0.1     {txt}log likelihood = {res}-2642.2346

{txt}Iteration 0:{space 3}log likelihood = {res:-2642.2358}  
Iteration 1:{space 3}log likelihood = {res:-2629.6146}  
Iteration 2:{space 3}log likelihood = {res:-2628.1703}  
Iteration 3:{space 3}log likelihood = {res:-2627.8763}  
Iteration 4:{space 3}log likelihood = {res:-2627.8198}  
Iteration 5:{space 3}log likelihood = {res:-2627.8063}  
Iteration 6:{space 3}log likelihood = {res: -2627.803}  
Iteration 7:{space 3}log likelihood = {res:-2627.8023}  
Iteration 8:{space 3}log likelihood = {res:-2627.8022}  
Iteration 9:{space 3}log likelihood = {res:-2627.8022}  
{res}
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     4,157
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       119

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         6
{txt}{col 63}avg{col 67}={col 69}{res}      34.9
{txt}{col 63}max{col 67}={col 69}{res}       139

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    22.58
{txt}Log likelihood  = {res}-2627.8022{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0072

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}D  {c |}{col 15}{res}{space 2}     0.98{col 27}{space 2}     0.07{col 38}{space 1}   -0.29{col 47}{space 3} 0.77{col 55}{space 4}     0.86{col 68}{space 3}     1.12
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.29{col 27}{space 2}     0.15{col 38}{space 1}    2.16{col 47}{space 3} 0.03{col 55}{space 4}     1.02{col 68}{space 3}     1.63
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.92{col 27}{space 2}     0.14{col 38}{space 1}   -0.54{col 47}{space 3} 0.59{col 55}{space 4}     0.68{col 68}{space 3}     1.25
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.07{col 27}{space 2}     0.13{col 38}{space 1}    0.54{col 47}{space 3} 0.59{col 55}{space 4}     0.84{col 68}{space 3}     1.35
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.38{col 27}{space 2}     0.16{col 38}{space 1}    2.77{col 47}{space 3} 0.01{col 55}{space 4}     1.10{col 68}{space 3}     1.74
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.84{col 27}{space 2}     0.07{col 38}{space 1}   -2.11{col 47}{space 3} 0.03{col 55}{space 4}     0.71{col 68}{space 3}     0.99
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.17{col 27}{space 2}     0.09{col 38}{space 1}    1.95{col 47}{space 3} 0.05{col 55}{space 4}     1.00{col 68}{space 3}     1.37
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}>40 years  {c |}{col 15}{res}{space 2}     1.61{col 27}{space 2}     0.38{col 38}{space 1}    2.02{col 47}{space 3} 0.04{col 55}{space 4}     1.01{col 68}{space 3}     2.57
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Primiparous  {c |}{col 15}{res}{space 2}     0.93{col 27}{space 2}     0.07{col 38}{space 1}   -0.96{col 47}{space 3} 0.34{col 55}{space 4}     0.79{col 68}{space 3}     1.08
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.44{col 27}{space 2}     0.06{col 38}{space 1}   -6.55{col 47}{space 3} 0.00{col 55}{space 4}     0.35{col 68}{space 3}     0.57
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}   -14.02{col 27}{space 2}    21.55{col 55}{space 4}   -56.26{col 68}{space 3}    28.23
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.01{col 55}{space 4}     0.00{col 68}{space 3} 1.35e+06
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}0.00{col 56}{txt}Prob >= chibar2 = {res}1.000
{com}.   estimates store complete_case_estimates
. 
.   // Make globals containing key results.
.   matrix result   = r(table)
.   global cc_or_b  = result["b",      "`var':2.arm"]
.   global cc_or_ll = result["ll",     "`var':2.arm"]
.   global cc_or_ul = result["ul",     "`var':2.arm"]
.   global cc_or_p  = result["pvalue", "`var':2.arm"]
. 
.   // Estimate ICC.
.   loneway `var' clusterid

         {txt}One-way Analysis of Variance for y: Adverse pregnancy outcome

                                             Number of obs = {res}       4,214
                                                 {txt}R-squared = {res}      0.0276

{txt}{col 5}Source{col 27}SS{col 38}df{col 46}MS{col 60}F{col 66}Prob > F
{hline 73}
Between clusterid{res}{col 23} 25.750506{col 34}   118{col 43} .21822463{col 54}     0.98{col 68}0.5307
{txt}Within clusterid{res}{col 23} 907.78723{col 34} 4,095{col 43} .22168186
{txt}{hline 73}
Total{res}{col 23} 933.53773{col 34} 4,213{col 43} .22158503

{txt}{col 10}Intraclass{col 27}Asy.{col 39}
{col 10}correlation{col 27}S.E.{col 38}[95% Conf. Interval]
         {hline 48}
          {res}  0.00000{txt}*  {res}  0.00374       0.00000     0.00734

{txt}{col 10}Estimated SD of clusterid effect{res}{col 49}        .
{txt}{col 10}Estimated SD within clusterid{res}{col 49}  .470831
{txt}{col 10}Est. reliability of a clusterid mean{res}{col 49}  0.00000{txt}*
{col 15}(evaluated at n={res}35.27{txt})

(*) Truncated at zero.
{com}.   global icc    = r(rho)
.   global icc_lb = r(lb)
.   global icc_ub = r(ub)
. {c )-}
{txt}
{com}. 
. // Compute the multiply-imputed estimates.
. tempname imputed
{txt}
{com}. frame copy imputed `imputed'
{txt}
{com}. frame `imputed' {c -(}
.   mi xtset clusterid
{res}{txt}{p}
(passive variables
{res}__000000 __000001
{txt}unregistered because not in {it:m}=0)
{p_end}
{res}{txt}{col 8}panel variable:  {res}clusterid (unbalanced)
{com}. 
.   local mi_opts or errorok noisily
.     // The errorok option is neeeded because, by chance, collinearity
.     // can exist between the stratification variable and the dependent variable.
.     // See the assert below, which specifies when this happens.
. 
.   foreach var of varlist y y1-y5 {c -(} 
{txt}  2{com}.     // Estimate population averaged effects.
.     mi estimate, `mi_opts': `model'
{txt}  3{com}.     estimates store `var'_estimates
{txt}  4{com}. 
.     // Verify that the anticipated imputations were used.
.     if ("`var'" != "y2") assert e(M_mi) == $m_imputations
{txt}  5{com}.     if ("`var'" == "y2") assert e(M_mi) >=  0.7 * $m_imputations
{txt}  6{com}.     
.     // Make globals containing key results.
.     matrix result      = r(table)
{txt}  7{com}.     global rr_b_`var'  = result["b",      "`var':2.arm"]
{txt}  8{com}.     global rr_ll_`var' = result["ll",     "`var':2.arm"]
{txt}  9{com}.     global rr_ul_`var' = result["ul",     "`var':2.arm"]
{txt} 10{com}.     global rr_p_`var'  = result["pvalue", "`var':2.arm"]
{txt} 11{com}.   {c )-}
{res}
{txt}(running {bf:xtlogit} {txt}on {it:m}{txt}=1)

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-3600.2984}  
Iteration 1:{space 3}log likelihood = {res: -3583.582}  
Iteration 2:{space 3}log likelihood = {res:-3583.2618}  
Iteration 3:{space 3}log likelihood = {res:-3583.2617}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log likelihood = {res}-3583.2617
{txt}tau = {res} 0.1     {txt}log likelihood = {res}-3598.5321

{txt}Iteration 0:{space 3}log likelihood = {res:-3598.5418}  
Iteration 1:{space 3}log likelihood = {res:-3585.0134}  
Iteration 2:{space 3}log likelihood = {res:-3583.4669}  
Iteration 3:{space 3}log likelihood = {res:-3583.3155}  
Iteration 4:{space 3}log likelihood = {res:-3583.2753}  
Iteration 5:{space 3}log likelihood = {res: -3583.264}  
Iteration 6:{space 3}log likelihood = {res:-3583.2621}  
Iteration 7:{space 3}log likelihood = {res:-3583.2619}  
Iteration 8:{space 3}log likelihood = {res:-3583.2619}  
{res}
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     6,367
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       119

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         9
{txt}{col 63}avg{col 67}={col 69}{res}      53.5
{txt}{col 63}max{col 67}={col 69}{res}       217

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    33.99
{txt}Log likelihood  = {res}-3583.2619{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0001

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}C  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 11}D  {c |}{col 15}{res}{space 2}     0.01{col 27}{space 2}     0.06{col 38}{space 1}    0.23{col 47}{space 3} 0.82{col 55}{space 4}    -0.10{col 68}{space 3}     0.13
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}5dbc98  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.15{col 27}{space 2}     0.10{col 38}{space 1}    1.47{col 47}{space 3} 0.14{col 55}{space 4}    -0.05{col 68}{space 3}     0.35
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}    -0.18{col 27}{space 2}     0.14{col 38}{space 1}   -1.34{col 47}{space 3} 0.18{col 55}{space 4}    -0.45{col 68}{space 3}     0.08
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.04{col 27}{space 2}     0.10{col 38}{space 1}    0.36{col 47}{space 3} 0.72{col 55}{space 4}    -0.16{col 68}{space 3}     0.23
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.18{col 27}{space 2}     0.10{col 38}{space 1}    1.75{col 47}{space 3} 0.08{col 55}{space 4}    -0.02{col 68}{space 3}     0.37
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}    -0.20{col 27}{space 2}     0.07{col 38}{space 1}   -2.64{col 47}{space 3} 0.01{col 55}{space 4}    -0.34{col 68}{space 3}    -0.05
{txt}{space 13} {c |}
lab_available {c |}
{space 6}No lab  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.13{col 27}{space 2}     0.07{col 38}{space 1}    1.84{col 47}{space 3} 0.07{col 55}{space 4}    -0.01{col 68}{space 3}     0.27
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}≤40 years  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 3}>40 years  {c |}{col 15}{res}{space 2}     0.88{col 27}{space 2}     0.22{col 38}{space 1}    3.90{col 47}{space 3} 0.00{col 55}{space 4}     0.44{col 68}{space 3}     1.32
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Multiparous  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 1}Primiparous  {c |}{col 15}{res}{space 2}    -0.07{col 27}{space 2}     0.07{col 38}{space 1}   -1.05{col 47}{space 3} 0.30{col 55}{space 4}    -0.21{col 68}{space 3}     0.07
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}    -1.10{col 27}{space 2}     0.11{col 38}{space 1}  -10.40{col 47}{space 3} 0.00{col 55}{space 4}    -1.30{col 68}{space 3}    -0.89
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}   -11.82{col 27}{space 2}    15.23{col 55}{space 4}   -41.66{col 68}{space 3}    18.03
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.02{col 55}{space 4}     0.00{col 68}{space 3}  8209.45
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}4.0e-04{col 56}{txt}Prob >= chibar2 = {res}0.492

{txt}(running {bf:xtlogit} {txt}on {it:m}{txt}=2)

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-3618.5961}  
Iteration 1:{space 3}log likelihood = {res: -3605.237}  
Iteration 2:{space 3}log likelihood = {res:-3605.0248}  
Iteration 3:{space 3}log likelihood = {res:-3605.0248}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log likelihood = {res}-3605.0248
{txt}tau = {res} 0.1     {txt}log likelihood = {res}-3620.4525

{txt}Iteration 0:{space 3}log likelihood = {res:-3620.4429}  
Iteration 1:{space 3}log likelihood = {res:-3606.9886}  
Iteration 2:{space 3}log likelihood = {res:-3605.3506}  
Iteration 3:{space 3}log likelihood = {res:-3605.0989}  
Iteration 4:{space 3}log likelihood = {res:-3605.0425}  
Iteration 5:{space 3}log likelihood = {res: -3605.029}  
Iteration 6:{space 3}log likelihood = {res:-3605.0257}  
Iteration 7:{space 3}log likelihood = {res:-3605.0252}  
Iteration 8:{space 3}log likelihood = {res:-3605.0251}  
{res}
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     6,367
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       119

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         9
{txt}{col 63}avg{col 67}={col 69}{res}      53.5
{txt}{col 63}max{col 67}={col 69}{res}       217

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    27.37
{txt}Log likelihood  = {res}-3605.0251{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0012

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}C  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 11}D  {c |}{col 15}{res}{space 2}     0.01{col 27}{space 2}     0.06{col 38}{space 1}    0.25{col 47}{space 3} 0.80{col 55}{space 4}    -0.10{col 68}{space 3}     0.13
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}5dbc98  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.12{col 27}{space 2}     0.10{col 38}{space 1}    1.18{col 47}{space 3} 0.24{col 55}{space 4}    -0.08{col 68}{space 3}     0.32
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}    -0.15{col 27}{space 2}     0.13{col 38}{space 1}   -1.15{col 47}{space 3} 0.25{col 55}{space 4}    -0.41{col 68}{space 3}     0.11
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}    -0.01{col 27}{space 2}     0.10{col 38}{space 1}   -0.08{col 47}{space 3} 0.93{col 55}{space 4}    -0.21{col 68}{space 3}     0.19
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.11{col 27}{space 2}     0.10{col 38}{space 1}    1.13{col 47}{space 3} 0.26{col 55}{space 4}    -0.08{col 68}{space 3}     0.31
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}    -0.17{col 27}{space 2}     0.07{col 38}{space 1}   -2.35{col 47}{space 3} 0.02{col 55}{space 4}    -0.32{col 68}{space 3}    -0.03
{txt}{space 13} {c |}
lab_available {c |}
{space 6}No lab  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.14{col 27}{space 2}     0.07{col 38}{space 1}    2.00{col 47}{space 3} 0.05{col 55}{space 4}     0.00{col 68}{space 3}     0.28
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}≤40 years  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 3}>40 years  {c |}{col 15}{res}{space 2}     0.80{col 27}{space 2}     0.23{col 38}{space 1}    3.50{col 47}{space 3} 0.00{col 55}{space 4}     0.35{col 68}{space 3}     1.24
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Multiparous  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 1}Primiparous  {c |}{col 15}{res}{space 2}    -0.11{col 27}{space 2}     0.07{col 38}{space 1}   -1.61{col 47}{space 3} 0.11{col 55}{space 4}    -0.25{col 68}{space 3}     0.02
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}    -1.06{col 27}{space 2}     0.10{col 38}{space 1}  -10.16{col 47}{space 3} 0.00{col 55}{space 4}    -1.27{col 68}{space 3}    -0.86
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}   -12.21{col 27}{space 2}    10.27{col 55}{space 4}   -32.34{col 68}{space 3}     7.92
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.01{col 55}{space 4}     0.00{col 68}{space 3}    52.44
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}7.1e-04{col 56}{txt}Prob >= chibar2 = {res}0.489

{txt}(running {bf:xtlogit} {txt}on {it:m}{txt}=3)

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-3632.4273}  
Iteration 1:{space 3}log likelihood = {res:  -3619.35}  
Iteration 2:{space 3}log likelihood = {res:-3619.2306}  
Iteration 3:{space 3}log likelihood = {res:-3619.2305}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log likelihood = {res}-3619.2305
{txt}tau = {res} 0.1     {txt}log likelihood = {res}-3633.5972

{txt}Iteration 0:{space 3}log likelihood = {res:-3633.5987}  
Iteration 1:{space 3}log likelihood = {res:-3621.1302}  
Iteration 2:{space 3}log likelihood = {res:-3619.6026}  
Iteration 3:{space 3}log likelihood = {res:-3619.3076}  
Iteration 4:{space 3}log likelihood = {res:-3619.2466}  
Iteration 5:{space 3}log likelihood = {res:-3619.2333}  
Iteration 6:{space 3}log likelihood = {res:-3619.2307}  
Iteration 7:{space 3}log likelihood = {res:-3619.2302}  
Iteration 8:{space 3}log likelihood = {res:-3619.2302}  
{res}
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     6,367
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       119

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         9
{txt}{col 63}avg{col 67}={col 69}{res}      53.5
{txt}{col 63}max{col 67}={col 69}{res}       217

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    26.36
{txt}Log likelihood  = {res}-3619.2302{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0018

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}C  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 11}D  {c |}{col 15}{res}{space 2}    -0.00{col 27}{space 2}     0.06{col 38}{space 1}   -0.01{col 47}{space 3} 0.99{col 55}{space 4}    -0.11{col 68}{space 3}     0.11
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}5dbc98  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.19{col 27}{space 2}     0.10{col 38}{space 1}    1.83{col 47}{space 3} 0.07{col 55}{space 4}    -0.01{col 68}{space 3}     0.38
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}    -0.06{col 27}{space 2}     0.13{col 38}{space 1}   -0.44{col 47}{space 3} 0.66{col 55}{space 4}    -0.32{col 68}{space 3}     0.20
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.04{col 27}{space 2}     0.10{col 38}{space 1}    0.39{col 47}{space 3} 0.70{col 55}{space 4}    -0.16{col 68}{space 3}     0.24
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.22{col 27}{space 2}     0.10{col 38}{space 1}    2.18{col 47}{space 3} 0.03{col 55}{space 4}     0.02{col 68}{space 3}     0.42
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}    -0.19{col 27}{space 2}     0.07{col 38}{space 1}   -2.57{col 47}{space 3} 0.01{col 55}{space 4}    -0.33{col 68}{space 3}    -0.04
{txt}{space 13} {c |}
lab_available {c |}
{space 6}No lab  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.14{col 27}{space 2}     0.07{col 38}{space 1}    1.97{col 47}{space 3} 0.05{col 55}{space 4}     0.00{col 68}{space 3}     0.27
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}≤40 years  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 3}>40 years  {c |}{col 15}{res}{space 2}     0.65{col 27}{space 2}     0.23{col 38}{space 1}    2.85{col 47}{space 3} 0.00{col 55}{space 4}     0.20{col 68}{space 3}     1.10
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Multiparous  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 1}Primiparous  {c |}{col 15}{res}{space 2}    -0.12{col 27}{space 2}     0.07{col 38}{space 1}   -1.75{col 47}{space 3} 0.08{col 55}{space 4}    -0.26{col 68}{space 3}     0.01
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}    -1.09{col 27}{space 2}     0.11{col 38}{space 1}  -10.37{col 47}{space 3} 0.00{col 55}{space 4}    -1.30{col 68}{space 3}    -0.89
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -8.06{col 27}{space 2}    11.31{col 55}{space 4}   -30.22{col 68}{space 3}    14.11
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.02{col 27}{space 2}     0.10{col 55}{space 4}     0.00{col 68}{space 3}  1158.32
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}6.9e-04{col 56}{txt}Prob >= chibar2 = {res}0.490

{txt}(running {bf:xtlogit} {txt}on {it:m}{txt}=4)

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-3595.9582}  
Iteration 1:{space 3}log likelihood = {res:-3583.0809}  
Iteration 2:{space 3}log likelihood = {res:-3582.9838}  
Iteration 3:{space 3}log likelihood = {res:-3582.9837}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log likelihood = {res}-3582.9837
{txt}tau = {res} 0.1     {txt}log likelihood = {res}-3598.2617

{txt}Iteration 0:{space 3}log likelihood = {res:-3598.2523}  
Iteration 1:{space 3}log likelihood = {res:-3585.0863}  
Iteration 2:{space 3}log likelihood = {res:-3583.2272}  
Iteration 3:{space 3}log likelihood = {res:-3583.0521}  
Iteration 4:{space 3}log likelihood = {res:-3583.0012}  
Iteration 5:{space 3}log likelihood = {res:-3582.9877}  
Iteration 6:{space 3}log likelihood = {res:-3582.9847}  
Iteration 7:{space 3}log likelihood = {res:-3582.9843}  
Iteration 8:{space 3}log likelihood = {res:-3582.9842}  
Iteration 9:{space 3}log likelihood = {res:-3582.9842}  
{res}
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     6,367
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       119

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         9
{txt}{col 63}avg{col 67}={col 69}{res}      53.5
{txt}{col 63}max{col 67}={col 69}{res}       217

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    25.48
{txt}Log likelihood  = {res}-3582.9842{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0025

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}C  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 11}D  {c |}{col 15}{res}{space 2}     0.03{col 27}{space 2}     0.06{col 38}{space 1}    0.50{col 47}{space 3} 0.62{col 55}{space 4}    -0.08{col 68}{space 3}     0.14
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}5dbc98  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.19{col 27}{space 2}     0.10{col 38}{space 1}    1.84{col 47}{space 3} 0.07{col 55}{space 4}    -0.01{col 68}{space 3}     0.39
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}    -0.14{col 27}{space 2}     0.14{col 38}{space 1}   -1.01{col 47}{space 3} 0.31{col 55}{space 4}    -0.40{col 68}{space 3}     0.13
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.12{col 27}{space 2}     0.10{col 38}{space 1}    1.20{col 47}{space 3} 0.23{col 55}{space 4}    -0.08{col 68}{space 3}     0.32
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.22{col 27}{space 2}     0.10{col 38}{space 1}    2.16{col 47}{space 3} 0.03{col 55}{space 4}     0.02{col 68}{space 3}     0.42
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}    -0.17{col 27}{space 2}     0.07{col 38}{space 1}   -2.25{col 47}{space 3} 0.02{col 55}{space 4}    -0.31{col 68}{space 3}    -0.02
{txt}{space 13} {c |}
lab_available {c |}
{space 6}No lab  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.12{col 27}{space 2}     0.07{col 38}{space 1}    1.72{col 47}{space 3} 0.09{col 55}{space 4}    -0.02{col 68}{space 3}     0.26
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}≤40 years  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 3}>40 years  {c |}{col 15}{res}{space 2}     0.55{col 27}{space 2}     0.23{col 38}{space 1}    2.36{col 47}{space 3} 0.02{col 55}{space 4}     0.09{col 68}{space 3}     1.01
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Multiparous  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 1}Primiparous  {c |}{col 15}{res}{space 2}    -0.12{col 27}{space 2}     0.07{col 38}{space 1}   -1.63{col 47}{space 3} 0.10{col 55}{space 4}    -0.26{col 68}{space 3}     0.02
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}    -1.16{col 27}{space 2}     0.11{col 38}{space 1}  -10.89{col 47}{space 3} 0.00{col 55}{space 4}    -1.36{col 68}{space 3}    -0.95
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}   -11.47{col 27}{space 2}    10.66{col 55}{space 4}   -32.37{col 68}{space 3}     9.42
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.02{col 55}{space 4}     0.00{col 68}{space 3}   111.25
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}9.4e-04{col 56}{txt}Prob >= chibar2 = {res}0.488

{txt}(running {bf:xtlogit} {txt}on {it:m}{txt}=5)

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-3593.7831}  
Iteration 1:{space 3}log likelihood = {res:-3582.9345}  
Iteration 2:{space 3}log likelihood = {res:-3582.8518}  
Iteration 3:{space 3}log likelihood = {res:-3582.8518}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log likelihood = {res}-3582.8518
{txt}tau = {res} 0.1     {txt}log likelihood = {res}-3595.9812

{txt}Iteration 0:{space 3}log likelihood = {res:-3595.9922}  
Iteration 1:{space 3}log likelihood = {res:-3584.4879}  
Iteration 2:{space 3}log likelihood = {res:-3583.1102}  
Iteration 3:{space 3}log likelihood = {res:-3582.8715}  
Iteration 4:{space 3}log likelihood = {res:-3582.8339}  
Iteration 5:{space 3}log likelihood = {res:-3582.8296}  
Iteration 6:{space 3}log likelihood = {res:-3582.8295}  
{res}
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     6,367
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       119

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         9
{txt}{col 63}avg{col 67}={col 69}{res}      53.5
{txt}{col 63}max{col 67}={col 69}{res}       217

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    21.36
{txt}Log likelihood  = {res}-3582.8295{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0111

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}C  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 11}D  {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.06{col 38}{space 1}    0.06{col 47}{space 3} 0.95{col 55}{space 4}    -0.11{col 68}{space 3}     0.12
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}5dbc98  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.10{col 27}{space 2}     0.10{col 38}{space 1}    1.02{col 47}{space 3} 0.31{col 55}{space 4}    -0.10{col 68}{space 3}     0.31
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}    -0.17{col 27}{space 2}     0.14{col 38}{space 1}   -1.22{col 47}{space 3} 0.22{col 55}{space 4}    -0.43{col 68}{space 3}     0.10
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}    -0.07{col 27}{space 2}     0.10{col 38}{space 1}   -0.66{col 47}{space 3} 0.51{col 55}{space 4}    -0.27{col 68}{space 3}     0.13
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.15{col 27}{space 2}     0.10{col 38}{space 1}    1.49{col 47}{space 3} 0.14{col 55}{space 4}    -0.05{col 68}{space 3}     0.35
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}    -0.15{col 27}{space 2}     0.08{col 38}{space 1}   -1.97{col 47}{space 3} 0.05{col 55}{space 4}    -0.30{col 68}{space 3}    -0.00
{txt}{space 13} {c |}
lab_available {c |}
{space 6}No lab  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.19{col 27}{space 2}     0.07{col 38}{space 1}    2.61{col 47}{space 3} 0.01{col 55}{space 4}     0.05{col 68}{space 3}     0.33
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}≤40 years  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 3}>40 years  {c |}{col 15}{res}{space 2}     0.60{col 27}{space 2}     0.23{col 38}{space 1}    2.58{col 47}{space 3} 0.01{col 55}{space 4}     0.14{col 68}{space 3}     1.05
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Multiparous  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 1}Primiparous  {c |}{col 15}{res}{space 2}    -0.06{col 27}{space 2}     0.07{col 38}{space 1}   -0.91{col 47}{space 3} 0.36{col 55}{space 4}    -0.20{col 68}{space 3}     0.07
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}    -1.12{col 27}{space 2}     0.11{col 38}{space 1}  -10.46{col 47}{space 3} 0.00{col 55}{space 4}    -1.33{col 68}{space 3}    -0.91
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -6.13{col 27}{space 2}     4.86{col 55}{space 4}   -15.66{col 68}{space 3}     3.39
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.05{col 27}{space 2}     0.11{col 55}{space 4}     0.00{col 68}{space 3}     5.46
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 55}{space 4}     0.00{col 68}{space 3}     0.90
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}0.04{col 56}{txt}Prob >= chibar2 = {res}0.416

{txt}(running {bf:xtlogit} {txt}on {it:m}{txt}=6)

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-3601.3814}  
Iteration 1:{space 3}log likelihood = {res:-3589.2635}  
Iteration 2:{space 3}log likelihood = {res:-3589.1331}  
Iteration 3:{space 3}log likelihood = {res:-3589.1331}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log likelihood = {res}-3589.1331
{txt}tau = {res} 0.1     {txt}log likelihood = {res}-3605.0953

{txt}Iteration 0:{space 3}log likelihood = {res:-3605.1103}  
Iteration 1:{space 3}log likelihood = {res:-3591.2653}  
Iteration 2:{space 3}log likelihood = {res:-3589.3964}  
Iteration 3:{space 3}log likelihood = {res:-3589.2051}  
Iteration 4:{space 3}log likelihood = {res:-3589.1525}  
Iteration 5:{space 3}log likelihood = {res:-3589.1373}  
Iteration 6:{space 3}log likelihood = {res:-3589.1341}  
Iteration 7:{space 3}log likelihood = {res:-3589.1336}  
Iteration 8:{space 3}log likelihood = {res:-3589.1336}  
{res}
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     6,367
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       119

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         9
{txt}{col 63}avg{col 67}={col 69}{res}      53.5
{txt}{col 63}max{col 67}={col 69}{res}       217

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    24.77
{txt}Log likelihood  = {res}-3589.1336{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0032

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}C  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 11}D  {c |}{col 15}{res}{space 2}    -0.00{col 27}{space 2}     0.06{col 38}{space 1}   -0.02{col 47}{space 3} 0.99{col 55}{space 4}    -0.12{col 68}{space 3}     0.11
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}5dbc98  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.16{col 27}{space 2}     0.10{col 38}{space 1}    1.58{col 47}{space 3} 0.11{col 55}{space 4}    -0.04{col 68}{space 3}     0.36
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}    -0.06{col 27}{space 2}     0.13{col 38}{space 1}   -0.42{col 47}{space 3} 0.68{col 55}{space 4}    -0.31{col 68}{space 3}     0.20
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}    -0.03{col 27}{space 2}     0.10{col 38}{space 1}   -0.28{col 47}{space 3} 0.78{col 55}{space 4}    -0.23{col 68}{space 3}     0.17
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.18{col 27}{space 2}     0.10{col 38}{space 1}    1.81{col 47}{space 3} 0.07{col 55}{space 4}    -0.01{col 68}{space 3}     0.38
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}    -0.18{col 27}{space 2}     0.07{col 38}{space 1}   -2.42{col 47}{space 3} 0.02{col 55}{space 4}    -0.32{col 68}{space 3}    -0.03
{txt}{space 13} {c |}
lab_available {c |}
{space 6}No lab  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.15{col 27}{space 2}     0.07{col 38}{space 1}    2.21{col 47}{space 3} 0.03{col 55}{space 4}     0.02{col 68}{space 3}     0.29
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}≤40 years  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 3}>40 years  {c |}{col 15}{res}{space 2}     0.68{col 27}{space 2}     0.23{col 38}{space 1}    2.96{col 47}{space 3} 0.00{col 55}{space 4}     0.23{col 68}{space 3}     1.13
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Multiparous  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 1}Primiparous  {c |}{col 15}{res}{space 2}    -0.11{col 27}{space 2}     0.07{col 38}{space 1}   -1.59{col 47}{space 3} 0.11{col 55}{space 4}    -0.25{col 68}{space 3}     0.03
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}    -1.11{col 27}{space 2}     0.11{col 38}{space 1}  -10.51{col 47}{space 3} 0.00{col 55}{space 4}    -1.31{col 68}{space 3}    -0.90
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}   -11.72{col 27}{space 2}     8.31{col 55}{space 4}   -28.00{col 68}{space 3}     4.56
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.01{col 55}{space 4}     0.00{col 68}{space 3}     9.76
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 55}{space 4}     0.00{col 68}{space 3}     0.97
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}9.0e-04{col 56}{txt}Prob >= chibar2 = {res}0.488

{txt}(running {bf:xtlogit} {txt}on {it:m}{txt}=7)

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-3607.8617}  
Iteration 1:{space 3}log likelihood = {res:-3596.8499}  
Iteration 2:{space 3}log likelihood = {res:-3596.7463}  
Iteration 3:{space 3}log likelihood = {res:-3596.7463}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log likelihood = {res}-3596.7463
{txt}tau = {res} 0.1     {txt}log likelihood = {res}-3608.6677

{txt}Iteration 0:{space 3}log likelihood = {res:-3608.6682}  
Iteration 1:{space 3}log likelihood = {res:-3597.9951}  
Iteration 2:{space 3}log likelihood = {res:-3596.7585}  
Iteration 3:{space 3}log likelihood = {res:-3596.6078}  
Iteration 4:{space 3}log likelihood = {res: -3596.598}  
Iteration 5:{space 3}log likelihood = {res:-3596.5978}  
{res}
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     6,367
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       119

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         9
{txt}{col 63}avg{col 67}={col 69}{res}      53.5
{txt}{col 63}max{col 67}={col 69}{res}       217

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    21.19
{txt}Log likelihood  = {res}-3596.5978{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0118

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}C  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 11}D  {c |}{col 15}{res}{space 2}    -0.00{col 27}{space 2}     0.06{col 38}{space 1}   -0.01{col 47}{space 3} 0.99{col 55}{space 4}    -0.12{col 68}{space 3}     0.12
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}5dbc98  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.23{col 27}{space 2}     0.11{col 38}{space 1}    2.21{col 47}{space 3} 0.03{col 55}{space 4}     0.03{col 68}{space 3}     0.44
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}    -0.07{col 27}{space 2}     0.14{col 38}{space 1}   -0.52{col 47}{space 3} 0.60{col 55}{space 4}    -0.35{col 68}{space 3}     0.20
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.10{col 27}{space 2}     0.11{col 38}{space 1}    0.92{col 47}{space 3} 0.36{col 55}{space 4}    -0.11{col 68}{space 3}     0.30
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.20{col 27}{space 2}     0.11{col 38}{space 1}    1.87{col 47}{space 3} 0.06{col 55}{space 4}    -0.01{col 68}{space 3}     0.40
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}    -0.15{col 27}{space 2}     0.08{col 38}{space 1}   -1.96{col 47}{space 3} 0.05{col 55}{space 4}    -0.30{col 68}{space 3}     0.00
{txt}{space 13} {c |}
lab_available {c |}
{space 6}No lab  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.12{col 27}{space 2}     0.07{col 38}{space 1}    1.62{col 47}{space 3} 0.11{col 55}{space 4}    -0.02{col 68}{space 3}     0.26
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}≤40 years  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 3}>40 years  {c |}{col 15}{res}{space 2}     0.63{col 27}{space 2}     0.23{col 38}{space 1}    2.75{col 47}{space 3} 0.01{col 55}{space 4}     0.18{col 68}{space 3}     1.09
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Multiparous  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 1}Primiparous  {c |}{col 15}{res}{space 2}    -0.08{col 27}{space 2}     0.07{col 38}{space 1}   -1.12{col 47}{space 3} 0.26{col 55}{space 4}    -0.22{col 68}{space 3}     0.06
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}    -1.16{col 27}{space 2}     0.11{col 38}{space 1}  -10.46{col 47}{space 3} 0.00{col 55}{space 4}    -1.38{col 68}{space 3}    -0.94
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -5.15{col 27}{space 2}     1.97{col 55}{space 4}    -9.00{col 68}{space 3}    -1.30
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.08{col 27}{space 2}     0.07{col 55}{space 4}     0.01{col 68}{space 3}     0.52
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 55}{space 4}     0.00{col 68}{space 3}     0.08
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}0.30{col 56}{txt}Prob >= chibar2 = {res}0.293

{txt}(running {bf:xtlogit} {txt}on {it:m}{txt}=8)

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-3627.1241}  
Iteration 1:{space 3}log likelihood = {res:-3617.8164}  
Iteration 2:{space 3}log likelihood = {res:-3617.7233}  
Iteration 3:{space 3}log likelihood = {res:-3617.7233}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log likelihood = {res}-3617.7233
{txt}tau = {res} 0.1     {txt}log likelihood = {res}-3631.3047

{txt}Iteration 0:{space 3}log likelihood = {res:-3631.3121}  
Iteration 1:{space 3}log likelihood = {res:-3619.6132}  
Iteration 2:{space 3}log likelihood = {res:-3618.0402}  
Iteration 3:{space 3}log likelihood = {res:-3617.7663}  
Iteration 4:{space 3}log likelihood = {res:-3617.7213}  
Iteration 5:{space 3}log likelihood = {res:-3617.7167}  
Iteration 6:{space 3}log likelihood = {res:-3617.7164}  
{res}
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     6,367
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       119

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         9
{txt}{col 63}avg{col 67}={col 69}{res}      53.5
{txt}{col 63}max{col 67}={col 69}{res}       217

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    18.52
{txt}Log likelihood  = {res}-3617.7164{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0296

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}C  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 11}D  {c |}{col 15}{res}{space 2}    -0.00{col 27}{space 2}     0.06{col 38}{space 1}   -0.03{col 47}{space 3} 0.98{col 55}{space 4}    -0.12{col 68}{space 3}     0.11
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}5dbc98  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.18{col 27}{space 2}     0.10{col 38}{space 1}    1.76{col 47}{space 3} 0.08{col 55}{space 4}    -0.02{col 68}{space 3}     0.38
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}    -0.09{col 27}{space 2}     0.14{col 38}{space 1}   -0.66{col 47}{space 3} 0.51{col 55}{space 4}    -0.36{col 68}{space 3}     0.18
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.05{col 27}{space 2}     0.10{col 38}{space 1}    0.47{col 47}{space 3} 0.64{col 55}{space 4}    -0.15{col 68}{space 3}     0.25
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.18{col 27}{space 2}     0.10{col 38}{space 1}    1.82{col 47}{space 3} 0.07{col 55}{space 4}    -0.01{col 68}{space 3}     0.38
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}    -0.12{col 27}{space 2}     0.07{col 38}{space 1}   -1.58{col 47}{space 3} 0.11{col 55}{space 4}    -0.26{col 68}{space 3}     0.03
{txt}{space 13} {c |}
lab_available {c |}
{space 6}No lab  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.13{col 27}{space 2}     0.07{col 38}{space 1}    1.90{col 47}{space 3} 0.06{col 55}{space 4}    -0.00{col 68}{space 3}     0.27
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}≤40 years  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 3}>40 years  {c |}{col 15}{res}{space 2}     0.65{col 27}{space 2}     0.23{col 38}{space 1}    2.79{col 47}{space 3} 0.01{col 55}{space 4}     0.19{col 68}{space 3}     1.10
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Multiparous  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 1}Primiparous  {c |}{col 15}{res}{space 2}    -0.05{col 27}{space 2}     0.07{col 38}{space 1}   -0.75{col 47}{space 3} 0.45{col 55}{space 4}    -0.19{col 68}{space 3}     0.09
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}    -1.15{col 27}{space 2}     0.11{col 38}{space 1}  -10.83{col 47}{space 3} 0.00{col 55}{space 4}    -1.36{col 68}{space 3}    -0.94
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -6.71{col 27}{space 2}     8.52{col 55}{space 4}   -23.41{col 68}{space 3}     9.98
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.03{col 27}{space 2}     0.15{col 55}{space 4}     0.00{col 68}{space 3}   147.30
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}0.01{col 56}{txt}Prob >= chibar2 = {res}0.453

{txt}(running {bf:xtlogit} {txt}on {it:m}{txt}=9)

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-3617.5263}  
Iteration 1:{space 3}log likelihood = {res:-3610.5218}  
Iteration 2:{space 3}log likelihood = {res:-3610.5009}  
Iteration 3:{space 3}log likelihood = {res:-3610.5009}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log likelihood = {res}-3610.5009
{txt}tau = {res} 0.1     {txt}log likelihood = {res}-3627.4341

{txt}Iteration 0:{space 3}log likelihood = {res:-3627.4381}  
Iteration 1:{space 3}log likelihood = {res:-3613.0968}  
Iteration 2:{space 3}log likelihood = {res:-3610.8388}  
Iteration 3:{space 3}log likelihood = {res:-3610.5846}  
Iteration 4:{space 3}log likelihood = {res:-3610.5215}  
Iteration 5:{space 3}log likelihood = {res:-3610.5058}  
Iteration 6:{space 3}log likelihood = {res:-3610.5019}  
Iteration 7:{space 3}log likelihood = {res:-3610.5011}  
Iteration 8:{space 3}log likelihood = {res: -3610.501}  
Iteration 9:{space 3}log likelihood = {res: -3610.501}  
{res}
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     6,367
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       119

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         9
{txt}{col 63}avg{col 67}={col 69}{res}      53.5
{txt}{col 63}max{col 67}={col 69}{res}       217

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    13.73
{txt}Log likelihood  = {res} -3610.501{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.1324

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}C  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 11}D  {c |}{col 15}{res}{space 2}    -0.03{col 27}{space 2}     0.06{col 38}{space 1}   -0.57{col 47}{space 3} 0.57{col 55}{space 4}    -0.15{col 68}{space 3}     0.08
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}5dbc98  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.13{col 27}{space 2}     0.10{col 38}{space 1}    1.24{col 47}{space 3} 0.21{col 55}{space 4}    -0.07{col 68}{space 3}     0.32
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}    -0.14{col 27}{space 2}     0.13{col 38}{space 1}   -1.01{col 47}{space 3} 0.31{col 55}{space 4}    -0.40{col 68}{space 3}     0.13
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.02{col 27}{space 2}     0.10{col 38}{space 1}    0.25{col 47}{space 3} 0.81{col 55}{space 4}    -0.17{col 68}{space 3}     0.22
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.13{col 27}{space 2}     0.10{col 38}{space 1}    1.29{col 47}{space 3} 0.20{col 55}{space 4}    -0.07{col 68}{space 3}     0.32
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}    -0.17{col 27}{space 2}     0.07{col 38}{space 1}   -2.34{col 47}{space 3} 0.02{col 55}{space 4}    -0.32{col 68}{space 3}    -0.03
{txt}{space 13} {c |}
lab_available {c |}
{space 6}No lab  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.12{col 27}{space 2}     0.07{col 38}{space 1}    1.65{col 47}{space 3} 0.10{col 55}{space 4}    -0.02{col 68}{space 3}     0.25
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}≤40 years  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 3}>40 years  {c |}{col 15}{res}{space 2}     0.26{col 27}{space 2}     0.24{col 38}{space 1}    1.06{col 47}{space 3} 0.29{col 55}{space 4}    -0.22{col 68}{space 3}     0.74
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Multiparous  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 1}Primiparous  {c |}{col 15}{res}{space 2}    -0.06{col 27}{space 2}     0.07{col 38}{space 1}   -0.88{col 47}{space 3} 0.38{col 55}{space 4}    -0.20{col 68}{space 3}     0.08
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}    -1.04{col 27}{space 2}     0.10{col 38}{space 1}   -9.98{col 47}{space 3} 0.00{col 55}{space 4}    -1.25{col 68}{space 3}    -0.84
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}   -13.78{col 27}{space 2}    20.69{col 55}{space 4}   -54.34{col 68}{space 3}    26.78
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.01{col 55}{space 4}     0.00{col 68}{space 3}653511.87
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}1.8e-04{col 56}{txt}Prob >= chibar2 = {res}0.495

{txt}(running {bf:xtlogit} {txt}on {it:m}{txt}=10)

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-3599.2146}  
Iteration 1:{space 3}log likelihood = {res: -3584.447}  
Iteration 2:{space 3}log likelihood = {res: -3584.187}  
Iteration 3:{space 3}log likelihood = {res: -3584.187}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log likelihood = {res} -3584.187
{txt}tau = {res} 0.1     {txt}log likelihood = {res}-3600.6182

{txt}Iteration 0:{space 3}log likelihood = {res:-3600.6349}  
Iteration 1:{space 3}log likelihood = {res:-3586.8587}  
Iteration 2:{space 3}log likelihood = {res:-3584.8391}  
Iteration 3:{space 3}log likelihood = {res:-3584.3324}  
Iteration 4:{space 3}log likelihood = {res:-3584.2252}  
Iteration 5:{space 3}log likelihood = {res:-3584.1965}  
Iteration 6:{space 3}log likelihood = {res:-3584.1891}  
Iteration 7:{space 3}log likelihood = {res:-3584.1875}  
Iteration 8:{space 3}log likelihood = {res:-3584.1873}  
Iteration 9:{space 3}log likelihood = {res:-3584.1872}  
{res}
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     6,367
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       119

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         9
{txt}{col 63}avg{col 67}={col 69}{res}      53.5
{txt}{col 63}max{col 67}={col 69}{res}       217

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    30.43
{txt}Log likelihood  = {res}-3584.1872{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0004

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}C  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 11}D  {c |}{col 15}{res}{space 2}     0.01{col 27}{space 2}     0.06{col 38}{space 1}    0.11{col 47}{space 3} 0.91{col 55}{space 4}    -0.11{col 68}{space 3}     0.12
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}5dbc98  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.19{col 27}{space 2}     0.10{col 38}{space 1}    1.90{col 47}{space 3} 0.06{col 55}{space 4}    -0.01{col 68}{space 3}     0.39
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}    -0.08{col 27}{space 2}     0.13{col 38}{space 1}   -0.60{col 47}{space 3} 0.55{col 55}{space 4}    -0.34{col 68}{space 3}     0.18
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.01{col 27}{space 2}     0.10{col 38}{space 1}    0.12{col 47}{space 3} 0.91{col 55}{space 4}    -0.19{col 68}{space 3}     0.21
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.22{col 27}{space 2}     0.10{col 38}{space 1}    2.14{col 47}{space 3} 0.03{col 55}{space 4}     0.02{col 68}{space 3}     0.41
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}    -0.17{col 27}{space 2}     0.07{col 38}{space 1}   -2.26{col 47}{space 3} 0.02{col 55}{space 4}    -0.31{col 68}{space 3}    -0.02
{txt}{space 13} {c |}
lab_available {c |}
{space 6}No lab  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.11{col 27}{space 2}     0.07{col 38}{space 1}    1.64{col 47}{space 3} 0.10{col 55}{space 4}    -0.02{col 68}{space 3}     0.25
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}≤40 years  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 3}>40 years  {c |}{col 15}{res}{space 2}     0.84{col 27}{space 2}     0.23{col 38}{space 1}    3.72{col 47}{space 3} 0.00{col 55}{space 4}     0.40{col 68}{space 3}     1.29
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Multiparous  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 1}Primiparous  {c |}{col 15}{res}{space 2}    -0.08{col 27}{space 2}     0.07{col 38}{space 1}   -1.13{col 47}{space 3} 0.26{col 55}{space 4}    -0.22{col 68}{space 3}     0.06
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}    -1.13{col 27}{space 2}     0.11{col 38}{space 1}  -10.71{col 47}{space 3} 0.00{col 55}{space 4}    -1.34{col 68}{space 3}    -0.92
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}   -12.60{col 27}{space 2}    14.85{col 55}{space 4}   -41.70{col 68}{space 3}    16.50
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.01{col 55}{space 4}     0.00{col 68}{space 3}  3818.29
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}4.3e-04{col 56}{txt}Prob >= chibar2 = {res}0.492

{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        10
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable: {res:clusterid}{col 49}Number of groups{col 67}= {res}       119
{txt}Random effects u_i ~ {res:Gaussian}{col 49}Obs per group:
{col 49}              min{col 67}= {res}         9
{txt}Integration points = {res:12}{col 49}              avg{col 67}= {res}      53.5
{txt}{col 49}              max{col 67}= {res}       217
{txt}{col 49}Average RVI{col 67}= {res}    0.2079
{txt}{col 49}Largest FMI{col 67}= {res}    0.4073
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}     59.84
{txt}{col 49}        avg{col 67}= {res}    738.64
{txt}{col 49}        max{col 67}= {res}  1,782.77
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res} 2126.3{txt}){col 67}= {res}      2.04
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0320

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}D  {c |}{col 15}{res}{space 2}     1.00{col 27}{space 2}     0.06{col 38}{space 1}    0.05{col 47}{space 3} 0.96{col 55}{space 4}     0.89{col 68}{space 3}     1.13
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.18{col 27}{space 2}     0.13{col 38}{space 1}    1.49{col 47}{space 3} 0.14{col 55}{space 4}     0.95{col 68}{space 3}     1.46
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.89{col 27}{space 2}     0.13{col 38}{space 1}   -0.79{col 47}{space 3} 0.43{col 55}{space 4}     0.67{col 68}{space 3}     1.18
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.03{col 27}{space 2}     0.12{col 38}{space 1}    0.23{col 47}{space 3} 0.82{col 55}{space 4}     0.81{col 68}{space 3}     1.30
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.20{col 27}{space 2}     0.13{col 38}{space 1}    1.65{col 47}{space 3} 0.10{col 55}{space 4}     0.97{col 68}{space 3}     1.48
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.85{col 27}{space 2}     0.07{col 38}{space 1}   -2.13{col 47}{space 3} 0.03{col 55}{space 4}     0.73{col 68}{space 3}     0.99
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.14{col 27}{space 2}     0.09{col 38}{space 1}    1.82{col 47}{space 3} 0.07{col 55}{space 4}     0.99{col 68}{space 3}     1.32
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}>40 years  {c |}{col 15}{res}{space 2}     1.92{col 27}{space 2}     0.57{col 38}{space 1}    2.22{col 47}{space 3} 0.03{col 55}{space 4}     1.07{col 68}{space 3}     3.47
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Primiparous  {c |}{col 15}{res}{space 2}     0.92{col 27}{space 2}     0.07{col 38}{space 1}   -1.16{col 47}{space 3} 0.25{col 55}{space 4}     0.79{col 68}{space 3}     1.06
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.33{col 27}{space 2}     0.04{col 38}{space 1}   -9.75{col 47}{space 3} 0.00{col 55}{space 4}     0.26{col 68}{space 3}     0.41
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -9.97{col 27}{space 2}    12.26{col 55}{space 4}   -34.01{col 68}{space 3}    14.08
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.01{col 27}{space 2}     0.04{col 55}{space 4}     0.00{col 68}{space 3}  1142.81
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}
{txt}(running {bf:xtlogit} {txt}on {it:m}{txt}=1)
note: 0.age_over_40 != 1 predicts failure perfectly
      0.age_over_40 dropped and 82 obs not used

note: 1.age_over_40 omitted because of collinearity

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-558.05338}  
Iteration 1:{space 3}log likelihood = {res:-552.12989}  
Iteration 2:{space 3}log likelihood = {res:-551.84631}  
Iteration 3:{space 3}log likelihood = {res:-551.84525}  
Iteration 4:{space 3}log likelihood = {res:-551.84525}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log likelihood = {res}-551.84525
{txt}tau = {res} 0.1     {txt}log likelihood = {res}   -551.48
{txt}tau = {res} 0.2     {txt}log likelihood = {res}-552.07079

{txt}Iteration 0:{space 3}log likelihood = {res:   -551.48}  
Iteration 1:{space 3}log likelihood = {res:-551.29615}  
Iteration 2:{space 3}log likelihood = {res:-551.29602}  
Iteration 3:{space 3}log likelihood = {res:-551.29602}  
{res}
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     6,285
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       119

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         7
{txt}{col 63}avg{col 67}={col 69}{res}      52.8
{txt}{col 63}max{col 67}={col 69}{res}       216

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}8{txt}){col 67}={col 70}{res}     9.33
{txt}Log likelihood  = {res}-551.29602{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.3149

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y1{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}C  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 11}D  {c |}{col 15}{res}{space 2}     0.22{col 27}{space 2}     0.21{col 38}{space 1}    1.04{col 47}{space 3} 0.30{col 55}{space 4}    -0.19{col 68}{space 3}     0.63
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}5dbc98  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.47{col 27}{space 2}     0.39{col 38}{space 1}    1.22{col 47}{space 3} 0.22{col 55}{space 4}    -0.29{col 68}{space 3}     1.24
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}    -0.30{col 27}{space 2}     0.57{col 38}{space 1}   -0.54{col 47}{space 3} 0.59{col 55}{space 4}    -1.42{col 68}{space 3}     0.81
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.28{col 27}{space 2}     0.38{col 38}{space 1}    0.73{col 47}{space 3} 0.46{col 55}{space 4}    -0.46{col 68}{space 3}     1.02
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.43{col 27}{space 2}     0.38{col 38}{space 1}    1.12{col 47}{space 3} 0.26{col 55}{space 4}    -0.32{col 68}{space 3}     1.18
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}    -0.57{col 27}{space 2}     0.31{col 38}{space 1}   -1.87{col 47}{space 3} 0.06{col 55}{space 4}    -1.17{col 68}{space 3}     0.03
{txt}{space 13} {c |}
lab_available {c |}
{space 6}No lab  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.30{col 27}{space 2}     0.25{col 38}{space 1}    1.22{col 47}{space 3} 0.22{col 55}{space 4}    -0.19{col 68}{space 3}     0.80
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}≤40 years  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 3}>40 years  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Multiparous  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 1}Primiparous  {c |}{col 15}{res}{space 2}    -0.39{col 27}{space 2}     0.26{col 38}{space 1}   -1.49{col 47}{space 3} 0.14{col 55}{space 4}    -0.90{col 68}{space 3}     0.12
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}    -4.20{col 27}{space 2}     0.42{col 38}{space 1}  -10.03{col 47}{space 3} 0.00{col 55}{space 4}    -5.02{col 68}{space 3}    -3.38
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -1.88{col 27}{space 2}     1.08{col 55}{space 4}    -4.00{col 68}{space 3}     0.23
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.39{col 27}{space 2}     0.21{col 55}{space 4}     0.14{col 68}{space 3}     1.12
{txt}          rho {c |}{col 15}{res}{space 2}     0.04{col 27}{space 2}     0.05{col 55}{space 4}     0.01{col 68}{space 3}     0.28
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}1.10{col 56}{txt}Prob >= chibar2 = {res}0.147

{txt}(running {bf:xtlogit} {txt}on {it:m}{txt}=2)

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-579.55087}  
Iteration 1:{space 3}log likelihood = {res:-572.27075}  
Iteration 2:{space 3}log likelihood = {res:-571.95007}  
Iteration 3:{space 3}log likelihood = {res:-571.94905}  
Iteration 4:{space 3}log likelihood = {res:-571.94905}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log likelihood = {res}-571.94905
{txt}tau = {res} 0.1     {txt}log likelihood = {res} -572.0496

{txt}Iteration 0:{space 3}log likelihood = {res: -572.0496}  
Iteration 1:{space 3}log likelihood = {res: -571.8569}  
Iteration 2:{space 3}log likelihood = {res:-571.84651}  
Iteration 3:{space 3}log likelihood = {res:-571.84622}  
Iteration 4:{space 3}log likelihood = {res:-571.84622}  
{res}
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     6,367
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       119

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         9
{txt}{col 63}avg{col 67}={col 69}{res}      53.5
{txt}{col 63}max{col 67}={col 69}{res}       217

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    13.01
{txt}Log likelihood  = {res}-571.84622{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.1622

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y1{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
{space 11}C  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 11}D  {c |}{col 15}{res}{space 2}     0.19{col 27}{space 2}     0.20{col 38}{space 1}    0.97{col 47}{space 3} 0.33{col 55}{space 4}    -0.19{col 68}{space 3}     0.58
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}5dbc98  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.21{col 27}{space 2}     0.37{col 38}{space 1}    0.58{col 47}{space 3} 0.56{col 55}{space 4}    -0.51{col 68}{space 3}     0.93
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.16{col 27}{space 2}     0.45{col 38}{space 1}    0.36{col 47}{space 3} 0.72{col 55}{space 4}    -0.73{col 68}{space 3}     1.06
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.24{col 27}{space 2}     0.35{col 38}{space 1}    0.68{col 47}{space 3} 0.50{col 55}{space 4}    -0.45{col 68}{space 3}     0.93
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.42{col 27}{space 2}     0.35{col 38}{space 1}    1.20{col 47}{space 3} 0.23{col 55}{space 4}    -0.27{col 68}{space 3}     1.11
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}    -0.48{col 27}{space 2}     0.27{col 38}{space 1}   -1.79{col 47}{space 3} 0.07{col 55}{space 4}    -1.00{col 68}{space 3}     0.04
{txt}{space 13} {c |}
lab_available {c |}
{space 6}No lab  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.31{col 27}{space 2}     0.23{col 38}{space 1}    1.33{col 47}{space 3} 0.18{col 55}{space 4}    -0.15{col 68}{space 3}     0.77
{txt}{space 13} {c |}
{space 2}age_over_40 {c |}
{space 3}≤40 years  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 3}>40 years  {c |}{col 15}{res}{space 2}     0.19{col 27}{space 2}     0.73{col 38}{space 1}    0.26{col 47}{space 3} 0.79{col 55}{space 4}    -1.23{col 68}{space 3}     1.61
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 1}Multiparous  {c |}{col 15}{res}{space 2}     0.00{col 27}{txt}  (empty)
{space 1}Primiparous  {c |}{col 15}{res}{space 2}    -0.72{col 27}{space 2}     0.29{col 38}{space 1}   -2.52{col 47}{space 3} 0.01{col 55}{space 4}    -1.29{col 68}{space 3}    -0.16
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}    -4.08{col 27}{space 2}     0.38{col 38}{space 1}  -10.75{col 47}{space 3} 0.00{col 55}{space 4}    -4.82{col 68}{space 3}    -3.34
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -2.77{col 27}{space 2}     2.33{col 55}{space 4}    -7.33{col 68}{space 3}     1.80
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.25{col 27}{space 2}     0.29{col 55}{space 4}     0.03{col 68}{space 3}     2.46
{txt}          rho {c |}{col 15}{res}{space 2}     0.02{col 27}{space 2}     0.04{col 55}{space 4}     0.00{col 68}{space 3}     0.65
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}0.21{col 56}{txt}Prob >= chibar2 = {res}0.325
{err}{bf:mi estimate}: omitted terms vary
{p 4 4 2}The set of omitted variables or categories is not 
consistent between {it:m}=1 and {it:m}=2; 
this is not allowed.  To identify varying sets, you can use
{helpb mi xeq} to run the command on individual imputations 
or you can reissue the command with {bf:mi estimate, noisily}{p_end}
{txt}{search r(498), local:r(498);}
{com}. {c )-}
{txt}{search r(498), local:r(498);}

end of do-file
{search r(498), local:r(498);}

end of do-file

{search r(498), local:r(498);}

{com}. 