{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}eRegQual Analysis
       {txt}log:  {res}/Users/cjr/Repos/fhi.eRegQual.2020/products/log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}18 Aug 2020, 10:28:20
{txt}
{com}. 
. // Set up Stata.
. do setup/setup
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Set the random number generator seed.
. set seed 1234
{txt}
{com}. 
. // Set up Stata's path to use the "packages" directory for add-on packages.
. net set ado "./packages"
{txt}
{com}. sysdir set PERSONAL "./packages"
{txt}
{com}. 
. // Specify formats.
. set cformat %9.2f
{txt}
{com}. set pformat %5.2f
{txt}
{com}. set sformat %8.2f
{txt}
{com}. 
. 
{txt}end of do-file

{com}. 
. // Set up globals.
. do globals/globals
{txt}
{com}. version 16.1
{txt}
{com}. 
. // The number of imputations to perform.
. global m_imputations 50 // Very slightly narrower CI if m=100.
{txt}
{com}. 
. // Define the names of the process outcomes.
. global process_outcomes ""
{txt}
{com}. global process_outcomes $process_outcomes attendance hypertension diabetes
{txt}
{com}. global process_outcomes $process_outcomes malpresentation anemia fetalgrowth
{txt}
{com}. 
. // The variables to adjust for, with their "types". See the generated report for
. // an explanation of why these variables are adjusted for.
. global adj_vars i.strat_var c.cluster_size c.age i.lab_available i.primiparous
{txt}
{com}. global adj_var_names // A global with just the *names* of the adj_vars
{txt}
{com}. foreach x of global adj_vars {c -(}
{txt}  2{com}.   local x_name = substr("`x'", 3, .) // Remove the i. or c.
{txt}  3{com}.   global adj_var_names $adj_var_names `x_name'
{txt}  4{com}. {c )-}
{txt}
{com}. 
. // Define paths to the process outcome files.
. global fname_attendance      "data/raw/25June2020_eRegQual process outcomes_attendance.dta"
{txt}
{com}. global fname_hypertension    "data/raw/25June2020_eRegQual process outcomes_hypertension.dta"
{txt}
{com}. global fname_diabetes        "data/raw/25June2020_eRegQual process outcomes_diabetes.dta"
{txt}
{com}. global fname_malpresentation "data/raw/25June2020_eRegQual process outcomes_malpresentation.dta"
{txt}
{com}. global fname_anemia          "data/raw/02July2020_eRegQual process outcomes_anemia.dta"
{txt}
{com}. global fname_fetalgrowth     "data/raw/10August2020_eRegQual process outcomes_fetalgrowth.dta"
{txt}
{com}. 
. // Define data signatures for the process outcome files.
. global datasignature_attendance          "6367:39(51496):3578513271:2127801624"
{txt}
{com}. global datasignature_hypertension        "6367:60(68365):3970041110:3735367683"
{txt}
{com}. global datasignature_diabetes            "6367:38(91264):1895688975:3113856828"
{txt}
{com}. global datasignature_malpresentation     "6367:31(88392):1586201653:3483051938"
{txt}
{com}. global datasignature_anemia              "6367:51(74410):3453863737:2485498443"
{txt}
{com}. global datasignature_fetalgrowth         "6367:37(83879):2470058122:813121498"
{txt}
{com}. 
. // Define recoding rules for the arm variables of the process outcomes; the 
. // coding of control and intervention vary by outcome. We will adopt the 
. // convention that control is coded as 1 and intervention as 2.
. global recode_attendance   recode arm (1 = 2) (2 = 1)
{txt}
{com}. global recode_hypertension recode arm (1 = 2) (2 = 1)
{txt}
{com}. foreach x in diabetes malpresentation anemia fetalgrowth {c -(}
{txt}  2{com}.   global recode_`x' // No recoding necessary
{txt}  3{com}. {c )-}
{txt}
{com}. 
{txt}end of do-file

{com}. 
. // Import the process outcome data.
. do data/process_outcomes
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Record the maximum percentage of data missing for age for process outcomes.
. global max_miss_age_pc 0
{txt}
{com}. 
. foreach outcome of global process_outcomes {c -(}
{txt}  2{com}.   frame create `outcome'
{txt}  3{com}.   frame `outcome' {c -(}
{txt}  4{com}.     // Load the data and check its signature is as expected.
.     use "${c -(}fname_`outcome'{c )-}", replace
{txt}  5{com}.     datasignature
{txt}  6{com}.     assert r(datasignature) == "${c -(}datasignature_`outcome'{c )-}"
{txt}  7{com}. 
.     // Encode/rename arm and cluster identifier variables.
.     encode prettyExposure, generate(arm)
{txt}  8{com}.     rename str_TRIAL_1_Cluster clusterid
{txt}  9{com}. 
.     // Compute the cluster size from the trial data. We use the trial data for
.     // simplicity and have verified that these agree with the "baseline" data on
.     // trial size. We divide by 100 because cluster sizes range from about 10 to
.     // about 220, and we want to get regression coefficients that are non-null
.     // within two decimal places! Note that cluster size computation must be
.     // done before the data set is reshaped to long format, or we will count
.     // one enrollment per visit rather than pregnancy.
.     by clusterid, sort: generate cluster_size = _N / 100
{txt} 10{com}. 
.     // Reshape to long format. Note that the uniqueid variable is not actually
.     // unique but identifies women, who can have multiple pregnancies (but not
.     // twins in this data set). Rows in the wide data frame are pregnancies, so
.     // we simply generate a unique pregnancy number for each row. We generate a 
.     // visit variable, as each woman (pregnancy) may attend clinic multiple times. 
.     generate pregnancy = _n
{txt} 11{com}.     local stubs opportunity_`outcome'_ success_`outcome'_
{txt} 12{com}.     reshape long `stubs', i(pregnancy) j(visit)
{txt} 13{com}. 
.     // While the outcome variable is a factor with three levels, we are only 
.     // interested in the relative odds of success. The other levels are 
.     // "NOT SUCCESSFUL" and "NOT APPLICABLE". Not applicable is not of 
.     // scientific interest here.
.     local success_label_name = "`: value label success_`outcome'_'"
{txt} 14{com}.     drop if      success_`outcome'_ == "NOT APPLICABLE":`success_label_name'
{txt} 15{com}.     generate y = success_`outcome'_ == "SUCCESSFUL":`success_label_name'
{txt} 16{com}. 
.     // Convert the stratification variable from string to integer.
.     encode bookorgdistricthashed, generate(strat_var)
{txt} 17{com}.     
.     // Generate an indicator for whether each woman is primiparous.
.     rename bookprimi primiparous
{txt} 18{com}. 
.     // Age.
.     replace age = . if age <= 1 // Correct some mis-coded values of the age variable.
{txt} 19{com}.     label variable age "Age (years)"
{txt} 20{com}. 
.     // Keep only the variables of interest.
.     keep y arm pregnancy visit clusterid $adj_var_names
{txt} 21{com}. 
.     // Label the variables
.     label variable y             "Successful `outcome'"
{txt} 22{com}.     label variable arm           "Study arm"
{txt} 23{com}.     label variable pregnancy     "Pregnancy"
{txt} 24{com}.     label variable clusterid     "Cluster"
{txt} 25{com}.     label variable strat_var     "District"
{txt} 26{com}.     label variable lab_available "Lab availability"
{txt} 27{com}.     label variable cluster_size  "Cluster size" // 100s of new enrollments
{txt} 28{com}.     label variable age           "Age (years)"
{txt} 29{com}.     label variable primiparous   "Parity"       // Indicator of primiparity.
{txt} 30{com}. 
.     // Label values and set base level where appropriate.
.     label define lab_available_label                1 "Lab"          0 "No lab"
{txt} 31{com}.     label values lab_available lab_available_label
{txt} 32{com}.     label define primiparous_label                  1 "Primi"        0 "Multi"
{txt} 33{com}.     label values primiparous   primiparous_label
{txt} 34{com}.     
.     // Recode the arm levels, ensure that level 1 is control, and set the
.     // value labels.
.     ${c -(}recode_`outcome'{c )-}
{txt} 35{com}.     fvset base 1 arm
{txt} 36{com}.     label define arm_value_label 1 "Control" 2 "Intervention"
{txt} 37{com}.     label values arm arm_value_label
{txt} 38{com}. 
.     // There should only be missing data for the age variable.
.     describe, short varlist
{txt} 39{com}.     local vars = r(varlist)
{txt} 40{com}.     local vars = ustrtrim(usubinstr("`vars'", "age", "", .))
{txt} 41{com}.     foreach x of local vars {c -(}
{txt} 42{com}.       misstable summarize `x'
{txt} 43{com}.       assert r(N_lt_dot) == .
{txt} 44{com}.     {c )-}
{txt} 45{com}. 
.     // The age variable should contain no more than 1.257% missing data.
.     misstable summarize age
{txt} 46{com}.     local miss_age_pc = 100 * (r(N_eq_dot) / (r(N_eq_dot) + r(N_lt_dot)))
{txt} 47{com}.     if `miss_age_pc' > $max_miss_age_pc global max_miss_age_pc = `miss_age_pc'
{txt} 48{com}.     drop if missing(age)
{txt} 49{com}.     assert r(N_drop) <= 300 // Ensure we did only drop a little data!
{txt} 50{com}. 
.     // For most of the process outcomes, we have multiple visits within
.     // pregnancy; we model the cluster-randomized design in the estimation.
.     // For malpresentation, there is only one visit and so cluster can be the
.     // panel variable. Note that the xtlogit-based analysis with cluster as the
.     // panel variable gives identical point estimates and confidence intervals
.     // as a melogit-based analysis with cluster as the random effect.
.     if "`outcome'" != "malpresentation" xtset pregnancy visit
{txt} 51{com}.     if "`outcome'" == "malpresentation" xtset clusterid
{txt} 52{com}.   {c )-}
{txt} 53{com}. {c )-}
  {res}6367:39(51496):3578513271:2127801624
{txt}(note: j = 1 2 3 4 5)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    6367   {txt}->{res}   31835
{txt}Number of variables            {res}      42   {txt}->{res}      35
{txt}j variable (5 values)                     ->   {res}visit
{txt}xij variables:
{res}opportunity_attendance_1 opportunity_attendance_2 ... opportunity_attendance_5{txt}->{res}opportunity_attendance_
success_attendance_1 success_attendance_2 ... success_attendance_5{txt}->{res}success_attendance_
{txt}{hline 77}
(10,132 observations deleted)
{res}{txt}(128 real changes made, 128 to missing)
(arm: 21703 changes made)

Contains data
  obs:{res}        21,703                          
{txt} vars:{res}            10                          
{txt}Sorted by: {res}pregnancy  visit
     Note: Dataset has changed since last saved.
{txt}(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
           age {c |}{res}       273{txt}{space 10}{res}    21,430{txt}  {c |}     31         14          44
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
(273 observations deleted)
{res}{txt}{col 8}panel variable:  {res}pregnancy (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}visit, 1 to 5
{txt}{col 17}delta:  {res}1 unit
  6367:60(68365):3970041110:3735367683
{txt}(note: j = 1 2 3 4 5 6 7 8)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    6367   {txt}->{res}   50936
{txt}Number of variables            {res}      63   {txt}->{res}      50
{txt}j variable (8 values)                     ->   {res}visit
{txt}xij variables:
{res}opportunity_hypertension_1 opportunity_hypertension_2 ... opportunity_hypertension_8{txt}->{res}opportunity_hypertension_
success_hypertension_1 success_hypertension_2 ... success_hypertension_8{txt}->{res}success_hypertension_
{txt}{hline 77}
(35,383 observations deleted)
{res}{txt}(102 real changes made, 102 to missing)
(arm: 15553 changes made)

Contains data
  obs:{res}        15,553                          
{txt} vars:{res}            10                          
{txt}Sorted by: {res}pregnancy  visit
     Note: Dataset has changed since last saved.
{txt}(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
           age {c |}{res}       170{txt}{space 10}{res}    15,383{txt}  {c |}     32         14          45
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
(170 observations deleted)
{res}{txt}{col 8}panel variable:  {res}pregnancy (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}visit, 1 to 8, but with gaps
{txt}{col 17}delta:  {res}1 unit
  6367:38(91264):1895688975:3113856828
{txt}(note: j = 1 2 3 4)
(note: success_diabetes_2 not found)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    6367   {txt}->{res}   25468
{txt}Number of variables            {res}      41   {txt}->{res}      37
{txt}j variable (4 values)                     ->   {res}visit
{txt}xij variables:
{res}opportunity_diabetes_1 opportunity_diabetes_2 ... opportunity_diabetes_4{txt}->{res}opportunity_diabetes_
success_diabetes_1 success_diabetes_2 ... success_diabetes_4{txt}->{res}success_diabetes_
{txt}{hline 77}
(13,340 observations deleted)
{res}{txt}(68 real changes made, 68 to missing)

Contains data
  obs:{res}        12,128                          
{txt} vars:{res}            10                          
{txt}Sorted by: {res}pregnancy  visit
     Note: Dataset has changed since last saved.
{txt}(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
           age {c |}{res}       134{txt}{space 10}{res}    11,994{txt}  {c |}     32         14          45
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
(134 observations deleted)
{res}{txt}{col 8}panel variable:  {res}pregnancy (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}visit, 1 to 4, but with gaps
{txt}{col 17}delta:  {res}1 unit
  6367:31(88392):1586201653:3483051938
{txt}(note: j = 1)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    6367   {txt}->{res}    6367
{txt}Number of variables            {res}      34   {txt}->{res}      35
{txt}j variable (1 values)                     ->   {res}visit
{txt}xij variables:
          {res}opportunity_malpresentation_1   {txt}->   {res}opportunity_malpresentation_
              success_malpresentation_1   {txt}->   {res}success_malpresentation_
{txt}{hline 77}
(4,427 observations deleted)
{res}{txt}(13 real changes made, 13 to missing)

Contains data
  obs:{res}         1,940                          
{txt} vars:{res}            10                          
{txt}Sorted by: {res}pregnancy  visit
     Note: Dataset has changed since last saved.
{txt}(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
           age {c |}{res}        21{txt}{space 10}{res}     1,919{txt}  {c |}     30         15          44
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
(21 observations deleted)
{col 8}panel variable:  {res}clusterid (unbalanced)
  6367:51(74410):3453863737:2485498443
{txt}(note: j = 1 2 3 4 5)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    6367   {txt}->{res}   31835
{txt}Number of variables            {res}      54   {txt}->{res}      47
{txt}j variable (5 values)                     ->   {res}visit
{txt}xij variables:
{res}opportunity_anemia_1 opportunity_anemia_2 ... opportunity_anemia_5{txt}->{res}opportunity_anemia_
success_anemia_1 success_anemia_2 ... success_anemia_5{txt}->{res}success_anemia_
{txt}{hline 77}
(21,333 observations deleted)
{res}{txt}(66 real changes made, 66 to missing)

Contains data
  obs:{res}        10,502                          
{txt} vars:{res}            10                          
{txt}Sorted by: {res}pregnancy  visit
     Note: Dataset has changed since last saved.
{txt}(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
           age {c |}{res}       115{txt}{space 10}{res}    10,387{txt}  {c |}     32         14          45
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
(115 observations deleted)
{res}{txt}{col 8}panel variable:  {res}pregnancy (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}visit, 1 to 5, but with gaps
{txt}{col 17}delta:  {res}1 unit
  6367:37(83879):2470058122:813121498
{txt}(note: j = 1 2 3)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    6367   {txt}->{res}   19101
{txt}Number of variables            {res}      40   {txt}->{res}      37
{txt}j variable (3 values)                     ->   {res}visit
{txt}xij variables:
{res}opportunity_fetalgrowth_1 opportunity_fetalgrowth_2 opportunity_fetalgrowth_3{txt}->{res}opportunity_fetalgrowth_
success_fetalgrowth_1 success_fetalgrowth_2 success_fetalgrowth_3{txt}->{res}success_fetalgrowth_
{txt}{hline 77}
(17,936 observations deleted)
{res}{txt}(4 real changes made, 4 to missing)

Contains data
  obs:{res}         1,165                          
{txt} vars:{res}            10                          
{txt}Sorted by: {res}pregnancy  visit
     Note: Dataset has changed since last saved.
{txt}(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
           age {c |}{res}        10{txt}{space 10}{res}     1,155{txt}  {c |}     29         15          43
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
(10 observations deleted)
{res}{txt}{col 8}panel variable:  {res}pregnancy (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}visit, 1 to 3, but with a gap
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. 
{txt}end of do-file

{com}. 
. // Import birth outcome data and perform imputation.
. do data/birth_outcomes
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Define the path to the data and the signature we expect it to have.
. local fname "data/raw/04May2020_eRegQual birth outcomes.dta"
{txt}
{com}. local signature "6367:756(27238):862839612:1580475191"
{txt}
{com}. 
. frame create original
{txt}
{com}. frame original {c -(}
.   // Load the data and check its signature is as expected.
.   use "`fname'", replace
.   datasignature
  {res}6367:756(27238):862839612:1580475191
{com}.   assert r(datasignature) == "`signature'"
. 
.   // Globals that specify the imputed and regular variables.
.   global imputeds
.   global regulars
. 
.   // Convert the arm variable from string to integer.
.   encode prettyExposure, generate(arm)
.   label variable arm Arm
.   label define birth_outcome_arm_label 1 "Intervention" 2 "Control"
.   label values arm birth_outcome_arm_label
.   fvset base 2 arm
.   global regulars $regulars arm
. 
.   // Convert the stratification variable from string to integer.
.   encode bookorgdistricthashed, generate(strat_var)
.   label variable strat_var District
.   fvset base 1 strat_var
.   global regulars $regulars strat_var
. 
.   // Rename and label the cluster identifier variable.
.   rename str_TRIAL_1_Cluster clusterid
{res}{com}.   label variable clusterid Cluster
.   global regulars $regulars clusterid
. 
.   // Rename the components of the composite outcome.
.   rename anemia_at_birth              y1
{res}{com}.   label variable                      y1 "Anemia at birth"
.   rename severehypertension_at_birth  y2
{res}{com}.   label variable                      y2 "Severe hypertension at birth"
.   rename sga_undetected_at_birth      y3
{res}{com}.   label variable                      y3 "SGA undetected at birth"
.   rename malpres_undetected           y4
{res}{com}.   label variable                      y4 "Malpresentation undetected at birth"
.   rename lga                          y5
{res}{com}.   label variable                      y5 "Large for gestational age"
. 
.   // Apply labels to the outcomes.
.   label define yes_no_label 0 "No" 1 "Yes"
.   label values y* yes_no_label
. 
.   // Age.
.   replace age = . if age <= 1 // Correct some mis-coded values of the age variable.
{txt}(35 real changes made, 35 to missing)
{com}.   label variable age "Age (years)"
.   global imputeds $imputeds age
. 
.   // BMI.
.   rename bookbmi bmi
{res}{com}.   replace bmi = . if bmi < 15 | bmi > 48 // Same policy as for categorical version.
{txt}(54 real changes made, 54 to missing)
{com}.   label variable bmi "Body mass index"
.   global imputeds $imputeds bmi
. 
.   // Education.
.   label variable education "Education (years)"
.   global imputeds $imputeds education
. 
.   // Income.
.   generate log_income = log(avgincome) // Log to approximately normalize.
{txt}(404 missing values generated)
{com}.   label variable log_income "Monthly household income (ILS; log scale)"
.   global imputeds $imputeds log_income
. 
.   // Lab availability.
.   label variable lab_available "Lab available"
.   label define lab_available_label 1 "Lab" 0 "No lab"
.   label values lab_available lab_available_label
.   global regulars $regulars lab_available
.   
.   // Generate an indicator for whether each woman is primiparous.
.   rename bookprimi primiparous
{res}{com}.   label variable primiparous   "Parity"
.   label define primiparous_label 1 "Primi" 0 "Multi"
.   label values primiparous primiparous_label
.   global imputeds $imputeds primiparous
. 
.   // Generate an indicator for stillbirth. Because this is a secondary outcome
.   // and data are missing for <5% of women, we will not impute.
.   rename stillbirth_reported stillbirth
{res}{com}.   label variable stillbirth   "Stillbirth"
.   label define stillbirth_label 1 "Stillbirth" 0 "Live birth"
.   label values stillbirth stillbirth_label
.   
.   // Compute the cluster size from the trial data. We use the trial data for
.   // simplicity and have verified that these agree with the "baseline" data on
.   // trial size. We divide by 100 because cluster sizes range from about 10 to
.   // about 220, and we want to get regression coefficients that are non-null
.   // within two decimal places!
.   by clusterid, sort: generate cluster_size = _N / 100
.   global regulars $regulars cluster_size
. 
.   // Ultrasound available.
.   label variable us_available "US available"
.   global regulars $regulars us_available
. 
.   // Keep only the variables of interest.
.   keep y* $imputeds $regulars TrialOne_adverse_pregoutc stillbirth
. 
.   // Verify that all of the regular variables are complete, that each of the
.   // variables to be imputed contain missing values, and that the threshold on
.   // the percentage of missing data we tolerate to perform a complete case
.   // analysis applies to the stillbirth variable.
.   foreach x of global regulars {c -(}
{txt}  2{com}.     misstable summarize `x'
{txt}  3{com}.     assert r(N_lt_dot) == .
{txt}  4{com}.   {c )-}
{txt}(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
(variables nonmissing or string)
{com}.   foreach x of varlist y1-y5 $imputeds {c -(}
{txt}  2{com}.     misstable summarize `x'
{txt}  3{com}.     assert r(N_lt_dot) < _N
{txt}  4{com}.   {c )-}
{txt}{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y1 {c |}{res}     1,743{txt}{space 10}{res}     4,624{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y2 {c |}{res}     2,258{txt}{space 10}{res}     4,109{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y3 {c |}{res}       752{txt}{space 10}{res}     5,615{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y4 {c |}{res}       875{txt}{space 10}{res}     5,492{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
            y5 {c |}{res}       752{txt}{space 10}{res}     5,615{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
           age {c |}{res}        69{txt}{space 10}{res}     6,298{txt}  {c |}     32         14          45
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
           bmi {c |}{res}       938{txt}{space 10}{res}     5,429{txt}  {c |}   >500   15.42969    47.98243
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
     education {c |}{res}       203{txt}{space 10}{res}     6,164{txt}  {c |}     25          1          24
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
    log_income {c |}{res}       404{txt}{space 10}{res}     5,963{txt}  {c |}    222  -5.926926    8.922658
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
   primiparous {c |}{res}       119{txt}{space 10}{res}     6,248{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{com}.   misstable summarize stillbirth
{txt}{col 64}Obs<.
{col 49}{c TLC}{hline 30}
{col 16}{c |}{col 49}{c |} Unique
{col 7}Variable {c |}{col 22}Obs=.{col 32}Obs>.{col 42}Obs<.{col 49}{c |} values{col 65}Min{col 77}Max
  {hline 13}{c +}{hline 32}{c +}{hline 30}
    stillbirth {c |}{res}       279{txt}{space 10}{res}     6,088{txt}  {c |}      2          0           1
  {hline 13}{c BT}{hline 32}{c BT}{hline 30}
{com}.   assert r(N_eq_dot) / (r(N_eq_dot) + r(N_lt_dot)) < 0.05
. {c )-}
{txt}
{com}. 
{txt}end of do-file

{com}. do data/impute
{txt}
{com}. version 16.1
{txt}
{com}. 
. frame copy original imputed, replace
{txt}(note: frame {bf:imputed} not found)

{com}. frame imputed {c -(}
.   // Obtain the sample size (before imputation).
.   local sample_size = _N
. 
.   // Set up the imputation and the roles of the variables.
.   mi set mlong
.   mi register imputed $imputeds y1-y5
{res}{txt}{p}
(3434 {it:m}=0 obs. now marked as incomplete)
{p_end}
{com}.   mi register regular $regulars
. 
.   // Perform imputation. Due to collinearity between the constituent outcome
.   // variables y1-y5, these variables are exluded as predictors for one another.
.   // It was not possible to include the stratification variable due to perfect
.   // prediction (possibly too many variables in the models?)
.   mi impute chained                                                    ///
>     (regress)                           age bmi education log_income   ///
>     (logit)                             primiparous                    ///
>     (logit, omit(i.y2 i.y3 i.y4 i.y5))  y1                             ///
>     (logit, omit(i.y1 i.y3 i.y4 i.y5))  y2                             ///
>     (logit, omit(i.y1 i.y2 i.y4 i.y5))  y3                             ///
>     (logit, omit(i.y1 i.y2 i.y3 i.y5))  y4                             ///
>     (logit, omit(i.y1 i.y2 i.y3 i.y4))  y5                             ///
>     = i.arm c.cluster_size i.us_available i.lab_available, ///
>     add($m_imputations)
{res}
{txt}Conditional models:
{p 15 21 2}
{bf:age}: regress age i.primiparous education log_income i.y3 i.y5 i.y4 bmi i.y1 i.y2 ib2.arm cluster_size i.us_available i.lab_available
{p_end}
{p 7 21 2}
{bf:primiparous}: logit primiparous age education log_income i.y3 i.y5 i.y4 bmi i.y1 i.y2 ib2.arm cluster_size i.us_available i.lab_available
{p_end}
{p 9 21 2}
{bf:education}: regress education age i.primiparous log_income i.y3 i.y5 i.y4 bmi i.y1 i.y2 ib2.arm cluster_size i.us_available i.lab_available
{p_end}
{p 8 21 2}
{bf:log_income}: regress log_income age i.primiparous education i.y3 i.y5 i.y4 bmi i.y1 i.y2 ib2.arm cluster_size i.us_available i.lab_available
{p_end}
{p 16 21 2}
{bf:y3}: logit y3 age i.primiparous education log_income bmi ib2.arm cluster_size i.us_available i.lab_available
{p_end}
{p 16 21 2}
{bf:y5}: logit y5 age i.primiparous education log_income bmi ib2.arm cluster_size i.us_available i.lab_available
{p_end}
{p 16 21 2}
{bf:y4}: logit y4 age i.primiparous education log_income bmi ib2.arm cluster_size i.us_available i.lab_available
{p_end}
{p 15 21 2}
{bf:bmi}: regress bmi age i.primiparous education log_income i.y3 i.y5 i.y4 i.y1 i.y2 ib2.arm cluster_size i.us_available i.lab_available
{p_end}
{p 16 21 2}
{bf:y1}: logit y1 age i.primiparous education log_income bmi ib2.arm cluster_size i.us_available i.lab_available
{p_end}
{p 16 21 2}
{bf:y2}: logit y2 age i.primiparous education log_income bmi ib2.arm cluster_size i.us_available i.lab_available
{p_end}

{res}{txt}Performing chained iterations ...
{res}{txt}
Multivariate imputation{txt}{col 45}{ralign 12:Imputations }= {res}      50
{txt}Chained equations{txt}{col 45}{ralign 12:added }= {res}      50
{txt}Imputed: {it:m}=1 through {it:m}=50{txt}{col 45}{ralign 12:updated }= {res}       0

{txt}Initialization: {res}monotone{txt}{col 45}{ralign 12:Iterations }= {res}     500
{txt}{col 45}{ralign 12:burn-in }= {res}      10

{txt}{p 15 15 2}{bf:age}: linear regression{p_end}
{txt}{p 15 15 2}{bf:bmi}: linear regression{p_end}
{txt}{p 9 15 2}{bf:education}: linear regression{p_end}
{txt}{p 8 15 2}{bf:log_income}: linear regression{p_end}
{txt}{p 7 15 2}{bf:primiparous}: logistic regression{p_end}
{txt}{p 16 15 2}{bf:y1}: logistic regression{p_end}
{txt}{p 16 15 2}{bf:y2}: logistic regression{p_end}
{txt}{p 16 15 2}{bf:y3}: logistic regression{p_end}
{txt}{p 16 15 2}{bf:y4}: logistic regression{p_end}
{txt}{p 16 15 2}{bf:y5}: logistic regression{p_end}

{txt}{hline 19}{c TT}{hline 35}{hline 11}
{txt}{col 20}{c |}{center 46:  Observations per {it:m}}
{txt}{col 20}{c LT}{hline 35}{c TT}{hline 10}
{txt}{col 11}Variable {c |}{ralign 12:Complete }{ralign 13:Incomplete }{ralign 10:Imputed }{c |}{ralign 10:Total}
{hline 19}{c +}{hline 35}{c +}{hline 10}
{txt}{ralign 19:age }{c |}{res}       6298           69        69 {txt}{c |}{res}      6367
{txt}{ralign 19:bmi }{c |}{res}       5429          938       938 {txt}{c |}{res}      6367
{txt}{ralign 19:education }{c |}{res}       6164          203       203 {txt}{c |}{res}      6367
{txt}{ralign 19:log_income }{c |}{res}       5963          404       404 {txt}{c |}{res}      6367
{txt}{ralign 19:primiparous }{c |}{res}       6248          119       119 {txt}{c |}{res}      6367
{txt}{ralign 19:y1 }{c |}{res}       4624         1743      1743 {txt}{c |}{res}      6367
{txt}{ralign 19:y2 }{c |}{res}       4109         2258      2258 {txt}{c |}{res}      6367
{txt}{ralign 19:y3 }{c |}{res}       5615          752       752 {txt}{c |}{res}      6367
{txt}{ralign 19:y4 }{c |}{res}       5492          875       875 {txt}{c |}{res}      6367
{txt}{ralign 19:y5 }{c |}{res}       5615          752       752 {txt}{c |}{res}      6367
{txt}{hline 19}{c BT}{hline 35}{c BT}{hline 10}
{p 0 1 1 66}(complete + incomplete = total; imputed is the minimum across {it:m}
 of the number of filled-in observations.){p_end}
{com}. 
.   // The composite outcome is defined as follows. If:
.   // * All of the outcomes are false -> composite outcome is false;
.   // * At least one of the outcomes is true -> composite outcome is true;
.   // * One or more of the outcomes are missing and all others are false
.   //   -> composite outcome is missing.
.   tempvar all_false
.   mi passive: generate `all_false' = ///
>     (y1 == 0) & (y2 == 0) & (y3 == 0) & (y4 == 0) & (y5 == 0)
{res}{txt}{it:m}=0:
{res}{txt}{it:m}=1:
{res}{txt}{it:m}=2:
{res}{txt}{it:m}=3:
{res}{txt}{it:m}=4:
{res}{txt}{it:m}=5:
{res}{txt}{it:m}=6:
{res}{txt}{it:m}=7:
{res}{txt}{it:m}=8:
{res}{txt}{it:m}=9:
{res}{txt}{it:m}=10:
{res}{txt}{it:m}=11:
{res}{txt}{it:m}=12:
{res}{txt}{it:m}=13:
{res}{txt}{it:m}=14:
{res}{txt}{it:m}=15:
{res}{txt}{it:m}=16:
{res}{txt}{it:m}=17:
{res}{txt}{it:m}=18:
{res}{txt}{it:m}=19:
{res}{txt}{it:m}=20:
{res}{txt}{it:m}=21:
{res}{txt}{it:m}=22:
{res}{txt}{it:m}=23:
{res}{txt}{it:m}=24:
{res}{txt}{it:m}=25:
{res}{txt}{it:m}=26:
{res}{txt}{it:m}=27:
{res}{txt}{it:m}=28:
{res}{txt}{it:m}=29:
{res}{txt}{it:m}=30:
{res}{txt}{it:m}=31:
{res}{txt}{it:m}=32:
{res}{txt}{it:m}=33:
{res}{txt}{it:m}=34:
{res}{txt}{it:m}=35:
{res}{txt}{it:m}=36:
{res}{txt}{it:m}=37:
{res}{txt}{it:m}=38:
{res}{txt}{it:m}=39:
{res}{txt}{it:m}=40:
{res}{txt}{it:m}=41:
{res}{txt}{it:m}=42:
{res}{txt}{it:m}=43:
{res}{txt}{it:m}=44:
{res}{txt}{it:m}=45:
{res}{txt}{it:m}=46:
{res}{txt}{it:m}=47:
{res}{txt}{it:m}=48:
{res}{txt}{it:m}=49:
{res}{txt}{it:m}=50:
{res}{com}.   tempvar one_true
.   mi passive: generate `one_true'  = ///
>     (y1 == 1) | (y2 == 1) | (y3 == 1) | (y4 == 1) | (y5 == 1)
{res}{txt}{it:m}=0:
{res}{txt}{it:m}=1:
{res}{txt}{it:m}=2:
{res}{txt}{it:m}=3:
{res}{txt}{it:m}=4:
{res}{txt}{it:m}=5:
{res}{txt}{it:m}=6:
{res}{txt}{it:m}=7:
{res}{txt}{it:m}=8:
{res}{txt}{it:m}=9:
{res}{txt}{it:m}=10:
{res}{txt}{it:m}=11:
{res}{txt}{it:m}=12:
{res}{txt}{it:m}=13:
{res}{txt}{it:m}=14:
{res}{txt}{it:m}=15:
{res}{txt}{it:m}=16:
{res}{txt}{it:m}=17:
{res}{txt}{it:m}=18:
{res}{txt}{it:m}=19:
{res}{txt}{it:m}=20:
{res}{txt}{it:m}=21:
{res}{txt}{it:m}=22:
{res}{txt}{it:m}=23:
{res}{txt}{it:m}=24:
{res}{txt}{it:m}=25:
{res}{txt}{it:m}=26:
{res}{txt}{it:m}=27:
{res}{txt}{it:m}=28:
{res}{txt}{it:m}=29:
{res}{txt}{it:m}=30:
{res}{txt}{it:m}=31:
{res}{txt}{it:m}=32:
{res}{txt}{it:m}=33:
{res}{txt}{it:m}=34:
{res}{txt}{it:m}=35:
{res}{txt}{it:m}=36:
{res}{txt}{it:m}=37:
{res}{txt}{it:m}=38:
{res}{txt}{it:m}=39:
{res}{txt}{it:m}=40:
{res}{txt}{it:m}=41:
{res}{txt}{it:m}=42:
{res}{txt}{it:m}=43:
{res}{txt}{it:m}=44:
{res}{txt}{it:m}=45:
{res}{txt}{it:m}=46:
{res}{txt}{it:m}=47:
{res}{txt}{it:m}=48:
{res}{txt}{it:m}=49:
{res}{txt}{it:m}=50:
{res}{com}. 
.   // Compute the composite outcome.
.   mi passive: generate y = .
{res}{txt}{it:m}=0:
(6,367 missing values generated)
{res}{txt}{it:m}=1:
(6,367 missing values generated)
{res}{txt}{it:m}=2:
(6,367 missing values generated)
{res}{txt}{it:m}=3:
(6,367 missing values generated)
{res}{txt}{it:m}=4:
(6,367 missing values generated)
{res}{txt}{it:m}=5:
(6,367 missing values generated)
{res}{txt}{it:m}=6:
(6,367 missing values generated)
{res}{txt}{it:m}=7:
(6,367 missing values generated)
{res}{txt}{it:m}=8:
(6,367 missing values generated)
{res}{txt}{it:m}=9:
(6,367 missing values generated)
{res}{txt}{it:m}=10:
(6,367 missing values generated)
{res}{txt}{it:m}=11:
(6,367 missing values generated)
{res}{txt}{it:m}=12:
(6,367 missing values generated)
{res}{txt}{it:m}=13:
(6,367 missing values generated)
{res}{txt}{it:m}=14:
(6,367 missing values generated)
{res}{txt}{it:m}=15:
(6,367 missing values generated)
{res}{txt}{it:m}=16:
(6,367 missing values generated)
{res}{txt}{it:m}=17:
(6,367 missing values generated)
{res}{txt}{it:m}=18:
(6,367 missing values generated)
{res}{txt}{it:m}=19:
(6,367 missing values generated)
{res}{txt}{it:m}=20:
(6,367 missing values generated)
{res}{txt}{it:m}=21:
(6,367 missing values generated)
{res}{txt}{it:m}=22:
(6,367 missing values generated)
{res}{txt}{it:m}=23:
(6,367 missing values generated)
{res}{txt}{it:m}=24:
(6,367 missing values generated)
{res}{txt}{it:m}=25:
(6,367 missing values generated)
{res}{txt}{it:m}=26:
(6,367 missing values generated)
{res}{txt}{it:m}=27:
(6,367 missing values generated)
{res}{txt}{it:m}=28:
(6,367 missing values generated)
{res}{txt}{it:m}=29:
(6,367 missing values generated)
{res}{txt}{it:m}=30:
(6,367 missing values generated)
{res}{txt}{it:m}=31:
(6,367 missing values generated)
{res}{txt}{it:m}=32:
(6,367 missing values generated)
{res}{txt}{it:m}=33:
(6,367 missing values generated)
{res}{txt}{it:m}=34:
(6,367 missing values generated)
{res}{txt}{it:m}=35:
(6,367 missing values generated)
{res}{txt}{it:m}=36:
(6,367 missing values generated)
{res}{txt}{it:m}=37:
(6,367 missing values generated)
{res}{txt}{it:m}=38:
(6,367 missing values generated)
{res}{txt}{it:m}=39:
(6,367 missing values generated)
{res}{txt}{it:m}=40:
(6,367 missing values generated)
{res}{txt}{it:m}=41:
(6,367 missing values generated)
{res}{txt}{it:m}=42:
(6,367 missing values generated)
{res}{txt}{it:m}=43:
(6,367 missing values generated)
{res}{txt}{it:m}=44:
(6,367 missing values generated)
{res}{txt}{it:m}=45:
(6,367 missing values generated)
{res}{txt}{it:m}=46:
(6,367 missing values generated)
{res}{txt}{it:m}=47:
(6,367 missing values generated)
{res}{txt}{it:m}=48:
(6,367 missing values generated)
{res}{txt}{it:m}=49:
(6,367 missing values generated)
{res}{txt}{it:m}=50:
(6,367 missing values generated)
{res}{com}.   mi passive: replace  y = 0 if `all_false'
{res}{txt}{it:m}=0:
(2,818 real changes made)
{res}{txt}{it:m}=1:
(4,771 real changes made)
{res}{txt}{it:m}=2:
(4,742 real changes made)
{res}{txt}{it:m}=3:
(4,707 real changes made)
{res}{txt}{it:m}=4:
(4,762 real changes made)
{res}{txt}{it:m}=5:
(4,766 real changes made)
{res}{txt}{it:m}=6:
(4,763 real changes made)
{res}{txt}{it:m}=7:
(4,751 real changes made)
{res}{txt}{it:m}=8:
(4,748 real changes made)
{res}{txt}{it:m}=9:
(4,732 real changes made)
{res}{txt}{it:m}=10:
(4,767 real changes made)
{res}{txt}{it:m}=11:
(4,750 real changes made)
{res}{txt}{it:m}=12:
(4,746 real changes made)
{res}{txt}{it:m}=13:
(4,742 real changes made)
{res}{txt}{it:m}=14:
(4,759 real changes made)
{res}{txt}{it:m}=15:
(4,775 real changes made)
{res}{txt}{it:m}=16:
(4,746 real changes made)
{res}{txt}{it:m}=17:
(4,732 real changes made)
{res}{txt}{it:m}=18:
(4,750 real changes made)
{res}{txt}{it:m}=19:
(4,744 real changes made)
{res}{txt}{it:m}=20:
(4,763 real changes made)
{res}{txt}{it:m}=21:
(4,759 real changes made)
{res}{txt}{it:m}=22:
(4,749 real changes made)
{res}{txt}{it:m}=23:
(4,769 real changes made)
{res}{txt}{it:m}=24:
(4,751 real changes made)
{res}{txt}{it:m}=25:
(4,759 real changes made)
{res}{txt}{it:m}=26:
(4,745 real changes made)
{res}{txt}{it:m}=27:
(4,756 real changes made)
{res}{txt}{it:m}=28:
(4,736 real changes made)
{res}{txt}{it:m}=29:
(4,780 real changes made)
{res}{txt}{it:m}=30:
(4,757 real changes made)
{res}{txt}{it:m}=31:
(4,751 real changes made)
{res}{txt}{it:m}=32:
(4,753 real changes made)
{res}{txt}{it:m}=33:
(4,756 real changes made)
{res}{txt}{it:m}=34:
(4,721 real changes made)
{res}{txt}{it:m}=35:
(4,751 real changes made)
{res}{txt}{it:m}=36:
(4,752 real changes made)
{res}{txt}{it:m}=37:
(4,733 real changes made)
{res}{txt}{it:m}=38:
(4,758 real changes made)
{res}{txt}{it:m}=39:
(4,770 real changes made)
{res}{txt}{it:m}=40:
(4,728 real changes made)
{res}{txt}{it:m}=41:
(4,742 real changes made)
{res}{txt}{it:m}=42:
(4,739 real changes made)
{res}{txt}{it:m}=43:
(4,725 real changes made)
{res}{txt}{it:m}=44:
(4,753 real changes made)
{res}{txt}{it:m}=45:
(4,781 real changes made)
{res}{txt}{it:m}=46:
(4,741 real changes made)
{res}{txt}{it:m}=47:
(4,751 real changes made)
{res}{txt}{it:m}=48:
(4,747 real changes made)
{res}{txt}{it:m}=49:
(4,755 real changes made)
{res}{txt}{it:m}=50:
(4,749 real changes made)
{res}{com}.   mi passive: replace  y = 1 if `one_true'
{res}{txt}{it:m}=0:
(1,396 real changes made)
{res}{txt}{it:m}=1:
(1,596 real changes made)
{res}{txt}{it:m}=2:
(1,625 real changes made)
{res}{txt}{it:m}=3:
(1,660 real changes made)
{res}{txt}{it:m}=4:
(1,605 real changes made)
{res}{txt}{it:m}=5:
(1,601 real changes made)
{res}{txt}{it:m}=6:
(1,604 real changes made)
{res}{txt}{it:m}=7:
(1,616 real changes made)
{res}{txt}{it:m}=8:
(1,619 real changes made)
{res}{txt}{it:m}=9:
(1,635 real changes made)
{res}{txt}{it:m}=10:
(1,600 real changes made)
{res}{txt}{it:m}=11:
(1,617 real changes made)
{res}{txt}{it:m}=12:
(1,621 real changes made)
{res}{txt}{it:m}=13:
(1,625 real changes made)
{res}{txt}{it:m}=14:
(1,608 real changes made)
{res}{txt}{it:m}=15:
(1,592 real changes made)
{res}{txt}{it:m}=16:
(1,621 real changes made)
{res}{txt}{it:m}=17:
(1,635 real changes made)
{res}{txt}{it:m}=18:
(1,617 real changes made)
{res}{txt}{it:m}=19:
(1,623 real changes made)
{res}{txt}{it:m}=20:
(1,604 real changes made)
{res}{txt}{it:m}=21:
(1,608 real changes made)
{res}{txt}{it:m}=22:
(1,618 real changes made)
{res}{txt}{it:m}=23:
(1,598 real changes made)
{res}{txt}{it:m}=24:
(1,616 real changes made)
{res}{txt}{it:m}=25:
(1,608 real changes made)
{res}{txt}{it:m}=26:
(1,622 real changes made)
{res}{txt}{it:m}=27:
(1,611 real changes made)
{res}{txt}{it:m}=28:
(1,631 real changes made)
{res}{txt}{it:m}=29:
(1,587 real changes made)
{res}{txt}{it:m}=30:
(1,610 real changes made)
{res}{txt}{it:m}=31:
(1,616 real changes made)
{res}{txt}{it:m}=32:
(1,614 real changes made)
{res}{txt}{it:m}=33:
(1,611 real changes made)
{res}{txt}{it:m}=34:
(1,646 real changes made)
{res}{txt}{it:m}=35:
(1,616 real changes made)
{res}{txt}{it:m}=36:
(1,615 real changes made)
{res}{txt}{it:m}=37:
(1,634 real changes made)
{res}{txt}{it:m}=38:
(1,609 real changes made)
{res}{txt}{it:m}=39:
(1,597 real changes made)
{res}{txt}{it:m}=40:
(1,639 real changes made)
{res}{txt}{it:m}=41:
(1,625 real changes made)
{res}{txt}{it:m}=42:
(1,628 real changes made)
{res}{txt}{it:m}=43:
(1,642 real changes made)
{res}{txt}{it:m}=44:
(1,614 real changes made)
{res}{txt}{it:m}=45:
(1,586 real changes made)
{res}{txt}{it:m}=46:
(1,626 real changes made)
{res}{txt}{it:m}=47:
(1,616 real changes made)
{res}{txt}{it:m}=48:
(1,620 real changes made)
{res}{txt}{it:m}=49:
(1,612 real changes made)
{res}{txt}{it:m}=50:
(1,618 real changes made)
{res}{com}.   label variable y "Adverse pregnancy outcome"
.   label values y yes_no_label
. 
.   // Verify that we can correctly recompute the composite outcome using the
.   // original (non-imputed) data.
.   count if y == TrialOne_adverse_pregoutc & _mi_m == 0
  {res}6,367
{com}.   assert r(N) == `sample_size'
. {c )-}
{txt}
{com}. 
. 
{txt}end of do-file

{com}. 
. // Do estimation.
. do estimation/missing          // Calculate percentage of data missing.
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Local macro to compute percentage of data that are missing following a
. // misstable patterns command.
. local pc_miss 100 * (r(N_incomplete) / (r(N_incomplete) + r(N_complete)))
{txt}
{com}. 
. frame imputed {c -(}
.   // Plot the density of each of the continuous imputed variables.
.   foreach var of global imputeds {c -(}
{txt}  2{com}.     quietly misstable patterns `var' if _mi_m == 0
{txt}  3{com}.     global pc_miss_`var' = `pc_miss'
{txt}  4{com}.   {c )-}
. 
.   // Estimate the percentages of missing data for the outcome variables.
.   foreach var of varlist y y1-y5 {c -(}
{txt}  2{com}.     quietly misstable patterns `var' if _mi_m == 0
{txt}  3{com}.     global pc_miss_`var' = `pc_miss'
{txt}  4{com}.   {c )-}
. {c )-}
{txt}
{com}. 
. local miss_vars $pc_miss_y1, $pc_miss_y2, $pc_miss_y3, $pc_miss_y4, $pc_miss_y5
{txt}
{com}. global pc_min_miss = min(`miss_vars')
{txt}
{com}. global pc_max_miss = max(`miss_vars')
{txt}
{com}. 
. 
{txt}end of do-file

{com}. do estimation/mcar             // Test the MCAR hypothesis.
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Test the null hypothesis that the constituent outcomes are jointly MCAR, and
. // the null that the constituent outcomes are jointly CDM (a type of MCAR).
. // P < 0.05 would reject the hypotheses (i.e., as usual, if P>= 0.05, we cannot
. // "conclude" that the data are MCAR or have CDM, merely that we cannot reject
. // those hypotheses).
. frame original {c -(}
.   mcartest y1-y5
{res}{txt}{p 0 6}note: 560 {txt}observations {txt}omitted from EM estimation because of all {txt}imputation variables missing{p_end}
{res}
{txt}Little's MCAR test

Number of obs       = {res}5807
{txt}Chi-square distance = {res}42.4844     
{txt}Degrees of freedom  = {res}34
{txt}Prob > chi-square   = {res}0.1507
{com}.   global p_mcar = r(p)
.   mcartest y1-y5 = i.arm i.strat_var
{res}{txt}{p 0 6}note: 560 {txt}observations {txt}omitted from EM estimation because of all {txt}imputation variables missing{p_end}
{res}
{txt}Little's CDM test

Number of obs       = {res}5807
{txt}Chi-square distance = {res}196.2496    
{txt}Degrees of freedom  = {res}204
{txt}Prob > chi-square   = {res}0.6389
{com}.   global p_cdm  = r(p)
. {c )-}
{txt}
{com}. 
. 
{txt}end of do-file

{com}. do estimation/birth_outcomes   // Analyze the birth outcome data.
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Specify the model.
. local model xtlogit \`var' i.arm $adj_vars
{txt}
{com}. 
. // Compute complete case estimates.
. tempname original
{txt}
{com}. frame copy imputed `original'
{txt}
{com}. frame `original' {c -(}
.   // Fit the model.
.   mi extract 0, clear
.   xtset clusterid
{txt}{col 8}panel variable:  {res}clusterid (unbalanced)
{com}. 
.   local cc_outcomes y stillbirth
.   foreach var of local cc_outcomes {c -(}
{txt}  2{com}.     `model', or
{txt}  3{com}.     if "`var'" == "stillbirth" {c -(}
{txt}  4{com}.       estimates store `var'_estimates
{txt}  5{com}.       continue
{txt}  6{com}.     {c )-}
{txt}  7{com}.     estimates store complete_case_estimates
{txt}  8{com}. 
.     // Make globals containing key results.
.     matrix result   = r(table)
{txt}  9{com}.     global cc_or_b  = result["b",      "`var':2.arm"]
{txt} 10{com}.     global cc_or_ll = result["ll",     "`var':2.arm"]
{txt} 11{com}.     global cc_or_ul = result["ul",     "`var':2.arm"]
{txt} 12{com}.     global cc_or_p  = result["pvalue", "`var':2.arm"]
{txt} 13{com}. 
.     // Estimate ICC.
.     loneway `var' clusterid
{txt} 14{com}.     global icc    = r(rho)
{txt} 15{com}.     global icc_lb = r(lb)
{txt} 16{com}.     global icc_ub = r(ub)
{txt} 17{com}.   {c )-}

{txt}Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-2617.5287}  
Iteration 1:{space 3}log likelihood = {res:-2595.5972}  
Iteration 2:{space 3}log likelihood = {res:-2595.5544}  
Iteration 3:{space 3}log likelihood = {res:-2595.5544}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log likelihood = {res}-2595.5544
{txt}tau = {res} 0.1     {txt}log likelihood = {res}-2609.0839

{txt}Iteration 0:{space 3}log likelihood = {res:-2609.0858}  
Iteration 1:{space 3}log likelihood = {res:-2597.2351}  
Iteration 2:{space 3}log likelihood = {res:-2595.8802}  
Iteration 3:{space 3}log likelihood = {res:-2595.6237}  
Iteration 4:{space 3}log likelihood = {res:-2595.5712}  
Iteration 5:{space 3}log likelihood = {res:-2595.5584}  
Iteration 6:{space 3}log likelihood = {res:-2595.5552}  
Iteration 7:{space 3}log likelihood = {res:-2595.5545}  
Iteration 8:{space 3}log likelihood = {res:-2595.5545}  
Iteration 9:{space 3}log likelihood = {res:-2595.5545}  
{res}
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     4,124
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       119

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         5
{txt}{col 63}avg{col 67}={col 69}{res}      34.7
{txt}{col 63}max{col 67}={col 69}{res}       139

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    43.29
{txt}Log likelihood  = {res}-2595.5545{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.02{col 27}{space 2}     0.07{col 38}{space 1}    0.27{col 47}{space 3} 0.79{col 55}{space 4}     0.89{col 68}{space 3}     1.16
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.27{col 27}{space 2}     0.15{col 38}{space 1}    2.04{col 47}{space 3} 0.04{col 55}{space 4}     1.01{col 68}{space 3}     1.61
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.94{col 27}{space 2}     0.15{col 38}{space 1}   -0.41{col 47}{space 3} 0.68{col 55}{space 4}     0.69{col 68}{space 3}     1.27
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.06{col 27}{space 2}     0.13{col 38}{space 1}    0.47{col 47}{space 3} 0.64{col 55}{space 4}     0.84{col 68}{space 3}     1.34
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.37{col 27}{space 2}     0.16{col 38}{space 1}    2.67{col 47}{space 3} 0.01{col 55}{space 4}     1.09{col 68}{space 3}     1.73
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.85{col 27}{space 2}     0.07{col 38}{space 1}   -1.98{col 47}{space 3} 0.05{col 55}{space 4}     0.72{col 68}{space 3}     1.00
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.03{col 27}{space 2}     0.01{col 38}{space 1}    5.07{col 47}{space 3} 0.00{col 55}{space 4}     1.02{col 68}{space 3}     1.05
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.15{col 27}{space 2}     0.09{col 38}{space 1}    1.78{col 47}{space 3} 0.08{col 55}{space 4}     0.99{col 68}{space 3}     1.35
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.09{col 27}{space 2}     0.10{col 38}{space 1}    1.02{col 47}{space 3} 0.31{col 55}{space 4}     0.92{col 68}{space 3}     1.30
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.18{col 27}{space 2}     0.04{col 38}{space 1}   -7.84{col 47}{space 3} 0.00{col 55}{space 4}     0.12{col 68}{space 3}     0.28
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}   -13.75{col 27}{space 2}    21.71{col 55}{space 4}   -56.30{col 68}{space 3}    28.79
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.01{col 55}{space 4}     0.00{col 68}{space 3} 1.79e+06
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}1.5e-04{col 56}{txt}Prob >= chibar2 = {res}0.495

         {txt}One-way Analysis of Variance for y: Adverse pregnancy outcome

                                             Number of obs = {res}       4,214
                                                 {txt}R-squared = {res}      0.0276

{txt}{col 5}Source{col 27}SS{col 38}df{col 46}MS{col 60}F{col 66}Prob > F
{hline 73}
Between clusterid{res}{col 23} 25.750506{col 34}   118{col 43} .21822463{col 54}     0.98{col 68}0.5307
{txt}Within clusterid{res}{col 23} 907.78723{col 34} 4,095{col 43} .22168186
{txt}{hline 73}
Total{res}{col 23} 933.53773{col 34} 4,213{col 43} .22158503

{txt}{col 10}Intraclass{col 27}Asy.{col 39}
{col 10}correlation{col 27}S.E.{col 38}[95% Conf. Interval]
         {hline 48}
          {res}  0.00000{txt}*  {res}  0.00374       0.00000     0.00734

{txt}{col 10}Estimated SD of clusterid effect{res}{col 49}        .
{txt}{col 10}Estimated SD within clusterid{res}{col 49}  .470831
{txt}{col 10}Est. reliability of a clusterid mean{res}{col 49}  0.00000{txt}*
{col 15}(evaluated at n={res}35.27{txt})

(*) Truncated at zero.

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-249.67727}  
Iteration 1:{space 3}log likelihood = {res:-246.46082}  
Iteration 2:{space 3}log likelihood = {res:-245.83218}  
Iteration 3:{space 3}log likelihood = {res:-245.83146}  
Iteration 4:{space 3}log likelihood = {res:-245.83146}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log likelihood = {res}-245.83146
{txt}tau = {res} 0.1     {txt}log likelihood = {res}-245.87509

{txt}Iteration 0:{space 3}log likelihood = {res:-245.87509}  
Iteration 1:{space 3}log likelihood = {res:-245.81515}  
Iteration 2:{space 3}log likelihood = {res:-245.81339}  
Iteration 3:{space 3}log likelihood = {res:-245.81337}  
{res}
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     5,919
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       119

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         7
{txt}{col 63}avg{col 67}={col 69}{res}      49.7
{txt}{col 63}max{col 67}={col 69}{res}       216

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}     7.91
{txt}Log likelihood  = {res}-245.81337{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.5434

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   stillbirth{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.07{col 27}{space 2}     0.34{col 38}{space 1}    0.22{col 47}{space 3} 0.83{col 55}{space 4}     0.57{col 68}{space 3}     2.00
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.39{col 27}{space 2}     0.19{col 38}{space 1}   -1.94{col 47}{space 3} 0.05{col 55}{space 4}     0.15{col 68}{space 3}     1.01
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.61{col 27}{space 2}     0.38{col 38}{space 1}   -0.80{col 47}{space 3} 0.42{col 55}{space 4}     0.18{col 68}{space 3}     2.05
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.30{col 27}{space 2}     0.16{col 38}{space 1}   -2.25{col 47}{space 3} 0.02{col 55}{space 4}     0.11{col 68}{space 3}     0.86
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.42{col 27}{space 2}     0.20{col 38}{space 1}   -1.84{col 47}{space 3} 0.07{col 55}{space 4}     0.17{col 68}{space 3}     1.06
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.82{col 27}{space 2}     0.34{col 38}{space 1}   -0.47{col 47}{space 3} 0.64{col 55}{space 4}     0.37{col 68}{space 3}     1.85
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.03{col 27}{space 2}     0.03{col 38}{space 1}    0.94{col 47}{space 3} 0.35{col 55}{space 4}     0.97{col 68}{space 3}     1.09
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.81{col 27}{space 2}     0.32{col 38}{space 1}   -0.55{col 47}{space 3} 0.58{col 55}{space 4}     0.38{col 68}{space 3}     1.74
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.13{col 27}{space 2}     0.47{col 38}{space 1}    0.29{col 47}{space 3} 0.78{col 55}{space 4}     0.50{col 68}{space 3}     2.55
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.01{col 27}{space 2}     0.01{col 38}{space 1}   -4.94{col 47}{space 3} 0.00{col 55}{space 4}     0.00{col 68}{space 3}     0.06
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -2.62{col 27}{space 2}     5.39{col 55}{space 4}   -13.18{col 68}{space 3}     7.94
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.27{col 27}{space 2}     0.73{col 55}{space 4}     0.00{col 68}{space 3}    52.88
{txt}          rho {c |}{col 15}{res}{space 2}     0.02{col 27}{space 2}     0.11{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}0.04{col 56}{txt}Prob >= chibar2 = {res}0.425
{com}. {c )-}
{txt}
{com}. 
. // Compute the multiply-imputed estimates.
. tempname imputed
{txt}
{com}. frame copy imputed `imputed'
{txt}
{com}. frame `imputed' {c -(}
.   mi xtset clusterid
{res}{txt}{p}
(passive variables
{res}__000000 __000001
{txt}unregistered because not in {it:m}=0)
{p_end}
{res}{txt}{col 8}panel variable:  {res}clusterid (unbalanced)
{com}. 
.   local mi_opts or errorok
.     // The errorok option is neeeded because, by chance, collinearity
.     // can exist between the stratification variable and the dependent variable.
.     // See the assert below, which specifies when this happens.
. 
.   foreach var of varlist y y1-y5 {c -(}
{txt}  2{com}.     local this_model "`model'"
{txt}  3{com}.     if "`var'" == "y2" {c -(}
{txt}  4{com}.       // For this variable, the stratification variable predicts outcome
.       // perfectly for one of the districts in some imputations, resulting in 
.       // it being dropped from analysis in some analyses of imputed data sets,
.       // resulting in an error in mi estimate.
.       local this_model = ustrtrim(usubinstr("`this_model'", "i.strat_var", "", .))
{txt}  5{com}.     {c )-}
{txt}  6{com}. 
.     mi estimate, `mi_opts': `this_model'
{txt}  7{com}.     estimates store `var'_estimates
{txt}  8{com}. 
.     // Verify that the anticipated imputations were used.
.     if ("`var'" != "y2") assert e(M_mi) == $m_imputations
{txt}  9{com}.     if ("`var'" == "y2") assert e(M_mi) >=  0.7 * $m_imputations
{txt} 10{com}.     
.     // Make globals containing key results.
.     matrix result      = r(table)
{txt} 11{com}.     global rr_b_`var'  = result["b",      "`var':2.arm"]
{txt} 12{com}.     global rr_ll_`var' = result["ll",     "`var':2.arm"]
{txt} 13{com}.     global rr_ul_`var' = result["ul",     "`var':2.arm"]
{txt} 14{com}.     global rr_p_`var'  = result["pvalue", "`var':2.arm"]
{txt} 15{com}.   {c )-}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable: {res:clusterid}{col 49}Number of groups{col 67}= {res}       119
{txt}Random effects u_i ~ {res:Gaussian}{col 49}Obs per group:
{col 49}              min{col 67}= {res}         9
{txt}Integration points = {res:12}{col 49}              avg{col 67}= {res}      53.5
{txt}{col 49}              max{col 67}= {res}       217
{txt}{col 49}Average RVI{col 67}= {res}    0.1744
{txt}{col 49}Largest FMI{col 67}= {res}    0.2199
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1,027.37
{txt}{col 49}        avg{col 67}= {res}  2,919.48
{txt}{col 49}        max{col 67}= {res} 13,007.76
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}17674.9{txt}){col 67}= {res}      3.91
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     0.99{col 27}{space 2}     0.06{col 38}{space 1}   -0.15{col 47}{space 3} 0.88{col 55}{space 4}     0.87{col 68}{space 3}     1.12
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.18{col 27}{space 2}     0.13{col 38}{space 1}    1.47{col 47}{space 3} 0.14{col 55}{space 4}     0.95{col 68}{space 3}     1.47
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.92{col 27}{space 2}     0.13{col 38}{space 1}   -0.59{col 47}{space 3} 0.55{col 55}{space 4}     0.69{col 68}{space 3}     1.22
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.06{col 27}{space 2}     0.12{col 38}{space 1}    0.54{col 47}{space 3} 0.59{col 55}{space 4}     0.85{col 68}{space 3}     1.34
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.21{col 27}{space 2}     0.13{col 38}{space 1}    1.73{col 47}{space 3} 0.08{col 55}{space 4}     0.98{col 68}{space 3}     1.50
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.87{col 27}{space 2}     0.07{col 38}{space 1}   -1.71{col 47}{space 3} 0.09{col 55}{space 4}     0.75{col 68}{space 3}     1.02
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.03{col 27}{space 2}     0.01{col 38}{space 1}    4.69{col 47}{space 3} 0.00{col 55}{space 4}     1.02{col 68}{space 3}     1.04
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.12{col 27}{space 2}     0.09{col 38}{space 1}    1.50{col 47}{space 3} 0.13{col 55}{space 4}     0.97{col 68}{space 3}     1.30
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.05{col 27}{space 2}     0.09{col 38}{space 1}    0.61{col 47}{space 3} 0.55{col 55}{space 4}     0.89{col 68}{space 3}     1.24
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.15{col 27}{space 2}     0.03{col 38}{space 1}   -9.26{col 47}{space 3} 0.00{col 55}{space 4}     0.10{col 68}{space 3}     0.22
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -9.32{col 27}{space 2}    11.10{col 55}{space 4}   -31.09{col 68}{space 3}    12.44
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.01{col 27}{space 2}     0.05{col 55}{space 4}     0.00{col 68}{space 3}   501.73
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable: {res:clusterid}{col 49}Number of groups{col 67}= {res}       119
{txt}Random effects u_i ~ {res:Gaussian}{col 49}Obs per group:
{col 49}              min{col 67}= {res}         9
{txt}Integration points = {res:12}{col 49}              avg{col 67}= {res}      53.5
{txt}{col 49}              max{col 67}= {res}       217
{txt}{col 49}Average RVI{col 67}= {res}    0.3548
{txt}{col 49}Largest FMI{col 67}= {res}    0.3678
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}    369.01
{txt}{col 49}        avg{col 67}= {res}  1,239.33
{txt}{col 49}        max{col 67}= {res}  7,228.29
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res} 5568.4{txt}){col 67}= {res}      1.21
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.2849

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y1{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     0.82{col 27}{space 2}     0.20{col 38}{space 1}   -0.83{col 47}{space 3} 0.41{col 55}{space 4}     0.51{col 68}{space 3}     1.31
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.51{col 27}{space 2}     0.69{col 38}{space 1}    0.90{col 47}{space 3} 0.37{col 55}{space 4}     0.62{col 68}{space 3}     3.69
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     1.20{col 27}{space 2}     0.67{col 38}{space 1}    0.33{col 47}{space 3} 0.74{col 55}{space 4}     0.41{col 68}{space 3}     3.57
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.54{col 27}{space 2}     0.66{col 38}{space 1}    1.00{col 47}{space 3} 0.32{col 55}{space 4}     0.66{col 68}{space 3}     3.56
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.69{col 27}{space 2}     0.72{col 38}{space 1}    1.24{col 47}{space 3} 0.22{col 55}{space 4}     0.74{col 68}{space 3}     3.91
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.62{col 27}{space 2}     0.20{col 38}{space 1}   -1.51{col 47}{space 3} 0.13{col 55}{space 4}     0.33{col 68}{space 3}     1.15
{txt}{space 10}age {c |}{col 15}{res}{space 2}     0.96{col 27}{space 2}     0.02{col 38}{space 1}   -1.80{col 47}{space 3} 0.07{col 55}{space 4}     0.91{col 68}{space 3}     1.00
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.42{col 27}{space 2}     0.39{col 38}{space 1}    1.29{col 47}{space 3} 0.20{col 55}{space 4}     0.83{col 68}{space 3}     2.43
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     0.50{col 27}{space 2}     0.18{col 38}{space 1}   -1.95{col 47}{space 3} 0.05{col 55}{space 4}     0.25{col 68}{space 3}     1.01
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.05{col 27}{space 2}     0.04{col 38}{space 1}   -3.73{col 47}{space 3} 0.00{col 55}{space 4}     0.01{col 68}{space 3}     0.25
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -5.58{col 27}{space 2}    14.69{col 55}{space 4}   -34.38{col 68}{space 3}    23.23
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.06{col 27}{space 2}     0.45{col 55}{space 4}     0.00{col 68}{space 3}110504.95
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.02{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable: {res:clusterid}{col 49}Number of groups{col 67}= {res}       119
{txt}Random effects u_i ~ {res:Gaussian}{col 49}Obs per group:
{col 49}              min{col 67}= {res}         9
{txt}Integration points = {res:12}{col 49}              avg{col 67}= {res}      53.5
{txt}{col 49}              max{col 67}= {res}       217
{txt}{col 49}Average RVI{col 67}= {res}    0.6376
{txt}{col 49}Largest FMI{col 67}= {res}    0.5243
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}    181.87
{txt}{col 49}        avg{col 67}= {res}435,181.00
{txt}{col 49}        max{col 67}= {res}3044654.56
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   5{txt},{res} 1241.9{txt}){col 67}= {res}      5.89
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y2{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     0.61{col 27}{space 2}     0.25{col 38}{space 1}   -1.21{col 47}{space 3} 0.23{col 55}{space 4}     0.27{col 68}{space 3}     1.36
{txt}{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.79{col 27}{space 2}     0.41{col 38}{space 1}   -0.44{col 47}{space 3} 0.66{col 55}{space 4}     0.29{col 68}{space 3}     2.20
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.19{col 27}{space 2}     0.04{col 38}{space 1}    4.80{col 47}{space 3} 0.00{col 55}{space 4}     1.11{col 68}{space 3}     1.28
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.93{col 27}{space 2}     0.41{col 38}{space 1}   -0.17{col 47}{space 3} 0.86{col 55}{space 4}     0.39{col 68}{space 3}     2.22
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     4.90{col 27}{space 2}     2.48{col 38}{space 1}    3.14{col 47}{space 3} 0.00{col 55}{space 4}     1.81{col 68}{space 3}    13.26
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 38}{space 1}   -7.94{col 47}{space 3} 0.00{col 55}{space 4}     0.00{col 68}{space 3}     0.00
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -5.22{col 27}{space 2}    70.80{col 55}{space 4}  -143.98{col 68}{space 3}   133.53
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.07{col 27}{space 2}     2.60{col 55}{space 4}     0.00{col 68}{space 3} 9.92e+28
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.12{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable: {res:clusterid}{col 49}Number of groups{col 67}= {res}       119
{txt}Random effects u_i ~ {res:Gaussian}{col 49}Obs per group:
{col 49}              min{col 67}= {res}         9
{txt}Integration points = {res:12}{col 49}              avg{col 67}= {res}      53.5
{txt}{col 49}              max{col 67}= {res}       217
{txt}{col 49}Average RVI{col 67}= {res}    0.1141
{txt}{col 49}Largest FMI{col 67}= {res}    0.1792
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1,543.64
{txt}{col 49}        avg{col 67}= {res}  4,313.44
{txt}{col 49}        max{col 67}= {res}  6,433.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}39016.5{txt}){col 67}= {res}      3.25
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0006

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y3{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.00{col 27}{space 2}     0.11{col 38}{space 1}    0.00{col 47}{space 3} 1.00{col 55}{space 4}     0.81{col 68}{space 3}     1.24
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.95{col 27}{space 2}     0.18{col 38}{space 1}   -0.30{col 47}{space 3} 0.77{col 55}{space 4}     0.65{col 68}{space 3}     1.37
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.65{col 27}{space 2}     0.17{col 38}{space 1}   -1.65{col 47}{space 3} 0.10{col 55}{space 4}     0.39{col 68}{space 3}     1.09
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.95{col 27}{space 2}     0.18{col 38}{space 1}   -0.25{col 47}{space 3} 0.80{col 55}{space 4}     0.66{col 68}{space 3}     1.38
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.01{col 27}{space 2}     0.19{col 38}{space 1}    0.05{col 47}{space 3} 0.96{col 55}{space 4}     0.70{col 68}{space 3}     1.45
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.88{col 27}{space 2}     0.13{col 38}{space 1}   -0.87{col 47}{space 3} 0.38{col 55}{space 4}     0.66{col 68}{space 3}     1.18
{txt}{space 10}age {c |}{col 15}{res}{space 2}     0.97{col 27}{space 2}     0.01{col 38}{space 1}   -2.64{col 47}{space 3} 0.01{col 55}{space 4}     0.95{col 68}{space 3}     0.99
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.26{col 27}{space 2}     0.16{col 38}{space 1}    1.75{col 47}{space 3} 0.08{col 55}{space 4}     0.97{col 68}{space 3}     1.62
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.34{col 27}{space 2}     0.16{col 38}{space 1}    2.39{col 47}{space 3} 0.02{col 55}{space 4}     1.05{col 68}{space 3}     1.71
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.17{col 27}{space 2}     0.06{col 38}{space 1}   -5.21{col 47}{space 3} 0.00{col 55}{space 4}     0.08{col 68}{space 3}     0.33
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -3.04{col 27}{space 2}     0.74{col 55}{space 4}    -4.50{col 68}{space 3}    -1.59
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.22{col 27}{space 2}     0.08{col 55}{space 4}     0.11{col 68}{space 3}     0.45
{txt}          rho {c |}{col 15}{res}{space 2}     0.01{col 27}{space 2}     0.01{col 55}{space 4}     0.00{col 68}{space 3}     0.06
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable: {res:clusterid}{col 49}Number of groups{col 67}= {res}       119
{txt}Random effects u_i ~ {res:Gaussian}{col 49}Obs per group:
{col 49}              min{col 67}= {res}         9
{txt}Integration points = {res:12}{col 49}              avg{col 67}= {res}      53.5
{txt}{col 49}              max{col 67}= {res}       217
{txt}{col 49}Average RVI{col 67}= {res}    0.1584
{txt}{col 49}Largest FMI{col 67}= {res}    0.1953
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1,301.14
{txt}{col 49}        avg{col 67}= {res}  3,218.72
{txt}{col 49}        max{col 67}= {res} 12,835.65
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}20776.0{txt}){col 67}= {res}      3.35
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0004

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y4{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     0.93{col 27}{space 2}     0.15{col 38}{space 1}   -0.44{col 47}{space 3} 0.66{col 55}{space 4}     0.68{col 68}{space 3}     1.27
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.23{col 27}{space 2}     0.39{col 38}{space 1}    0.67{col 47}{space 3} 0.51{col 55}{space 4}     0.66{col 68}{space 3}     2.29
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.76{col 27}{space 2}     0.36{col 38}{space 1}   -0.57{col 47}{space 3} 0.57{col 55}{space 4}     0.31{col 68}{space 3}     1.91
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.70{col 27}{space 2}     0.51{col 38}{space 1}    1.79{col 47}{space 3} 0.07{col 55}{space 4}     0.95{col 68}{space 3}     3.05
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.49{col 27}{space 2}     0.45{col 38}{space 1}    1.32{col 47}{space 3} 0.19{col 55}{space 4}     0.82{col 68}{space 3}     2.71
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.67{col 27}{space 2}     0.15{col 38}{space 1}   -1.80{col 47}{space 3} 0.07{col 55}{space 4}     0.43{col 68}{space 3}     1.04
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.05{col 27}{space 2}     0.02{col 38}{space 1}    3.26{col 47}{space 3} 0.00{col 55}{space 4}     1.02{col 68}{space 3}     1.08
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.98{col 27}{space 2}     0.19{col 38}{space 1}   -0.12{col 47}{space 3} 0.91{col 55}{space 4}     0.67{col 68}{space 3}     1.43
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.90{col 27}{space 2}     0.36{col 38}{space 1}    3.37{col 47}{space 3} 0.00{col 55}{space 4}     1.31{col 68}{space 3}     2.75
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.01{col 27}{space 2}     0.00{col 38}{space 1}   -9.26{col 47}{space 3} 0.00{col 55}{space 4}     0.00{col 68}{space 3}     0.02
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -6.96{col 27}{space 2}    16.65{col 55}{space 4}   -39.60{col 68}{space 3}    25.67
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.03{col 27}{space 2}     0.26{col 55}{space 4}     0.00{col 68}{space 3}375349.91
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable: {res:clusterid}{col 49}Number of groups{col 67}= {res}       119
{txt}Random effects u_i ~ {res:Gaussian}{col 49}Obs per group:
{col 49}              min{col 67}= {res}         9
{txt}Integration points = {res:12}{col 49}              avg{col 67}= {res}      53.5
{txt}{col 49}              max{col 67}= {res}       217
{txt}{col 49}Average RVI{col 67}= {res}    0.1262
{txt}{col 49}Largest FMI{col 67}= {res}    0.1744
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1,630.26
{txt}{col 49}        avg{col 67}= {res}  3,551.43
{txt}{col 49}        max{col 67}= {res}  7,235.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}31113.5{txt}){col 67}= {res}      9.38
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y5{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.06{col 27}{space 2}     0.09{col 38}{space 1}    0.73{col 47}{space 3} 0.46{col 55}{space 4}     0.90{col 68}{space 3}     1.25
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.21{col 27}{space 2}     0.18{col 38}{space 1}    1.31{col 47}{space 3} 0.19{col 55}{space 4}     0.91{col 68}{space 3}     1.61
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     1.13{col 27}{space 2}     0.21{col 38}{space 1}    0.67{col 47}{space 3} 0.51{col 55}{space 4}     0.79{col 68}{space 3}     1.63
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.96{col 27}{space 2}     0.15{col 38}{space 1}   -0.24{col 47}{space 3} 0.81{col 55}{space 4}     0.71{col 68}{space 3}     1.30
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.15{col 27}{space 2}     0.17{col 38}{space 1}    0.93{col 47}{space 3} 0.35{col 55}{space 4}     0.86{col 68}{space 3}     1.53
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.97{col 27}{space 2}     0.10{col 38}{space 1}   -0.32{col 47}{space 3} 0.75{col 55}{space 4}     0.79{col 68}{space 3}     1.18
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.05{col 27}{space 2}     0.01{col 38}{space 1}    6.61{col 47}{space 3} 0.00{col 55}{space 4}     1.03{col 68}{space 3}     1.06
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.02{col 27}{space 2}     0.10{col 38}{space 1}    0.21{col 47}{space 3} 0.83{col 55}{space 4}     0.84{col 68}{space 3}     1.24
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     0.68{col 27}{space 2}     0.08{col 38}{space 1}   -3.19{col 47}{space 3} 0.00{col 55}{space 4}     0.54{col 68}{space 3}     0.86
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.04{col 27}{space 2}     0.01{col 38}{space 1}  -12.62{col 47}{space 3} 0.00{col 55}{space 4}     0.02{col 68}{space 3}     0.06
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -6.34{col 27}{space 2}    10.25{col 55}{space 4}   -26.44{col 68}{space 3}    13.75
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.04{col 27}{space 2}     0.22{col 55}{space 4}     0.00{col 68}{space 3}   969.76
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.01{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}{com}. {c )-}
{txt}
{com}. 
. 
{txt}end of do-file

{com}. do estimation/process_outcomes // Analyze process outcome data.
{txt}
{com}. version 16.1
{txt}
{com}. 
. foreach outcome of global process_outcomes {c -(}
{txt}  2{com}.   frame `outcome' {c -(}
{txt}  3{com}.     local vce_opts vce(cluster clusterid)
{txt}  4{com}.     if "`outcome'" == "malpresentation" local vce_opts ""
{txt}  5{com}.     xtlogit y i.arm $adj_vars, `vce_opts' or
{txt}  6{com}.     estimates store `outcome'_estimates
{txt}  7{com}.   {c )-}
{txt}  8{com}. {c )-}

{txt}Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res: -14715.62}  
Iteration 1:{space 3}log pseudolikelihood = {res:-14422.735}  
Iteration 2:{space 3}log pseudolikelihood = {res:-14422.429}  
Iteration 3:{space 3}log pseudolikelihood = {res:-14422.429}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log pseudolikelihood = {res}-14422.429
{txt}tau = {res} 0.1     {txt}log pseudolikelihood = {res}-14205.537
{txt}tau = {res} 0.2     {txt}log pseudolikelihood = {res}-14016.319
{txt}tau = {res} 0.3     {txt}log pseudolikelihood = {res}-13854.203
{txt}tau = {res} 0.4     {txt}log pseudolikelihood = {res}-13720.675
{txt}tau = {res} 0.5     {txt}log pseudolikelihood = {res}-13620.535
{txt}tau = {res} 0.6     {txt}log pseudolikelihood = {res}-13564.696
{txt}tau = {res} 0.7     {txt}log pseudolikelihood = {res}-13577.582

{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-13564.698}  
Iteration 1:{space 3}log pseudolikelihood = {res:-13537.064}  
Iteration 2:{space 3}log pseudolikelihood = {res:-13537.058}  
Iteration 3:{space 3}log pseudolikelihood = {res:-13537.058}  
{res}
{txt}Calculating robust standard errors:

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    21,430
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     5,139

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       4.2
{txt}{col 63}max{col 67}={col 69}{res}         5

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    80.39
{txt}Log pseudolikelihood  = {res}-13537.058{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 79:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     0.85{col 27}{space 2}     0.10{col 38}{space 1}   -1.47{col 47}{space 3} 0.14{col 55}{space 4}     0.68{col 68}{space 3}     1.06
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.58{col 27}{space 2}     0.11{col 38}{space 1}   -2.98{col 47}{space 3} 0.00{col 55}{space 4}     0.40{col 68}{space 3}     0.83
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     1.38{col 27}{space 2}     0.26{col 38}{space 1}    1.69{col 47}{space 3} 0.09{col 55}{space 4}     0.95{col 68}{space 3}     2.00
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.22{col 27}{space 2}     0.21{col 38}{space 1}    1.15{col 47}{space 3} 0.25{col 55}{space 4}     0.87{col 68}{space 3}     1.71
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.75{col 27}{space 2}     0.31{col 38}{space 1}    3.16{col 47}{space 3} 0.00{col 55}{space 4}     1.24{col 68}{space 3}     2.47
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     1.53{col 27}{space 2}     0.21{col 38}{space 1}    3.17{col 47}{space 3} 0.00{col 55}{space 4}     1.18{col 68}{space 3}     2.00
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.01{col 27}{space 2}     0.01{col 38}{space 1}    1.39{col 47}{space 3} 0.16{col 55}{space 4}     1.00{col 68}{space 3}     1.02
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.99{col 27}{space 2}     0.12{col 38}{space 1}   -0.07{col 47}{space 3} 0.95{col 55}{space 4}     0.78{col 68}{space 3}     1.27
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.01{col 27}{space 2}     0.07{col 38}{space 1}    0.13{col 47}{space 3} 0.89{col 55}{space 4}     0.89{col 68}{space 3}     1.15
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.40{col 27}{space 2}     0.10{col 38}{space 1}   -3.76{col 47}{space 3} 0.00{col 55}{space 4}     0.25{col 68}{space 3}     0.64
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}     0.60{col 27}{space 2}     0.08{col 55}{space 4}     0.44{col 68}{space 3}     0.76
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     1.35{col 27}{space 2}     0.05{col 55}{space 4}     1.25{col 68}{space 3}     1.46
{txt}          rho {c |}{col 15}{res}{space 2}     0.36{col 27}{space 2}     0.02{col 55}{space 4}     0.32{col 68}{space 3}     0.39
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-2742.4295}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2711.9504}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2711.2821}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2711.2818}  
Iteration 4:{space 3}log pseudolikelihood = {res:-2711.2818}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log pseudolikelihood = {res}-2711.2818
{txt}tau = {res} 0.1     {txt}log pseudolikelihood = {res}-2707.4933
{txt}tau = {res} 0.2     {txt}log pseudolikelihood = {res} -2705.944
{txt}tau = {res} 0.3     {txt}log pseudolikelihood = {res}-2708.8421

{txt}Iteration 0:{space 3}log pseudolikelihood = {res: -2705.944}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2699.4132}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2693.9911}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2693.8031}  
Iteration 4:{space 3}log pseudolikelihood = {res:-2693.7964}  
Iteration 5:{space 3}log pseudolikelihood = {res:-2693.7964}  
{res}
{txt}Calculating robust standard errors:

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    15,383
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     5,946

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       2.6
{txt}{col 63}max{col 67}={col 69}{res}         6

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    52.00
{txt}Log pseudolikelihood  = {res}-2693.7964{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 79:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.62{col 27}{space 2}     0.19{col 38}{space 1}    4.07{col 47}{space 3} 0.00{col 55}{space 4}     1.29{col 68}{space 3}     2.05
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.18{col 27}{space 2}     0.24{col 38}{space 1}    0.83{col 47}{space 3} 0.41{col 55}{space 4}     0.79{col 68}{space 3}     1.77
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     1.51{col 27}{space 2}     0.26{col 38}{space 1}    2.37{col 47}{space 3} 0.02{col 55}{space 4}     1.07{col 68}{space 3}     2.12
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.28{col 27}{space 2}     0.24{col 38}{space 1}    1.33{col 47}{space 3} 0.18{col 55}{space 4}     0.89{col 68}{space 3}     1.85
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.78{col 27}{space 2}     0.32{col 38}{space 1}    3.24{col 47}{space 3} 0.00{col 55}{space 4}     1.26{col 68}{space 3}     2.53
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.93{col 27}{space 2}     0.10{col 38}{space 1}   -0.65{col 47}{space 3} 0.51{col 55}{space 4}     0.75{col 68}{space 3}     1.15
{txt}{space 10}age {c |}{col 15}{res}{space 2}     0.98{col 27}{space 2}     0.01{col 38}{space 1}   -2.25{col 47}{space 3} 0.02{col 55}{space 4}     0.96{col 68}{space 3}     1.00
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.16{col 27}{space 2}     0.15{col 38}{space 1}    1.14{col 47}{space 3} 0.25{col 55}{space 4}     0.90{col 68}{space 3}     1.49
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     0.93{col 27}{space 2}     0.10{col 38}{space 1}   -0.67{col 47}{space 3} 0.50{col 55}{space 4}     0.74{col 68}{space 3}     1.16
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}    32.99{col 27}{space 2}     9.50{col 38}{space 1}   12.14{col 47}{space 3} 0.00{col 55}{space 4}    18.76{col 68}{space 3}    58.02
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -0.13{col 27}{space 2}     0.25{col 55}{space 4}    -0.61{col 68}{space 3}     0.36
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.94{col 27}{space 2}     0.12{col 55}{space 4}     0.74{col 68}{space 3}     1.20
{txt}          rho {c |}{col 15}{res}{space 2}     0.21{col 27}{space 2}     0.04{col 55}{space 4}     0.14{col 68}{space 3}     0.30
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-6126.1098}  
Iteration 1:{space 3}log pseudolikelihood = {res:-5876.5412}  
Iteration 2:{space 3}log pseudolikelihood = {res: -5870.101}  
Iteration 3:{space 3}log pseudolikelihood = {res:-5870.0944}  
Iteration 4:{space 3}log pseudolikelihood = {res:-5870.0944}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log pseudolikelihood = {res}-5870.0944
{txt}tau = {res} 0.1     {txt}log pseudolikelihood = {res}-5905.0457

{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-5905.0457}  
Iteration 1:{space 3}log pseudolikelihood = {res:-5870.5399}  
Iteration 2:{space 3}log pseudolikelihood = {res:-5870.1901}  
Iteration 3:{space 3}log pseudolikelihood = {res: -5870.116}  
Iteration 4:{space 3}log pseudolikelihood = {res:-5870.0995}  
Iteration 5:{space 3}log pseudolikelihood = {res:-5870.0955}  
Iteration 6:{space 3}log pseudolikelihood = {res:-5870.0953}  
Iteration 7:{space 3}log pseudolikelihood = {res: -5870.095}  
Iteration 8:{space 3}log pseudolikelihood = {res:-5870.0949}  
{res}
{txt}Calculating robust standard errors:

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    11,994
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     6,298

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       1.9
{txt}{col 63}max{col 67}={col 69}{res}         3

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    84.28
{txt}Log pseudolikelihood  = {res}-5870.0949{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 79:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.45{col 27}{space 2}     0.17{col 38}{space 1}    3.08{col 47}{space 3} 0.00{col 55}{space 4}     1.14{col 68}{space 3}     1.83
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.68{col 27}{space 2}     0.12{col 38}{space 1}   -2.10{col 47}{space 3} 0.04{col 55}{space 4}     0.48{col 68}{space 3}     0.97
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.58{col 27}{space 2}     0.13{col 38}{space 1}   -2.42{col 47}{space 3} 0.02{col 55}{space 4}     0.37{col 68}{space 3}     0.90
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.50{col 27}{space 2}     0.10{col 38}{space 1}   -3.30{col 47}{space 3} 0.00{col 55}{space 4}     0.33{col 68}{space 3}     0.76
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.72{col 27}{space 2}     0.11{col 38}{space 1}   -2.10{col 47}{space 3} 0.04{col 55}{space 4}     0.53{col 68}{space 3}     0.98
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     1.39{col 27}{space 2}     0.20{col 38}{space 1}    2.29{col 47}{space 3} 0.02{col 55}{space 4}     1.05{col 68}{space 3}     1.85
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.01{col 27}{space 2}     0.00{col 38}{space 1}    2.26{col 47}{space 3} 0.02{col 55}{space 4}     1.00{col 68}{space 3}     1.02
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.98{col 27}{space 2}     0.29{col 38}{space 1}    4.60{col 47}{space 3} 0.00{col 55}{space 4}     1.48{col 68}{space 3}     2.65
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.11{col 27}{space 2}     0.05{col 38}{space 1}    2.16{col 47}{space 3} 0.03{col 55}{space 4}     1.01{col 68}{space 3}     1.22
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.12{col 27}{space 2}     0.02{col 38}{space 1}  -10.86{col 47}{space 3} 0.00{col 55}{space 4}     0.08{col 68}{space 3}     0.17
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}   -13.38{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-996.79522}  
Iteration 1:{space 3}log likelihood = {res:-947.86719}  
Iteration 2:{space 3}log likelihood = {res:-944.35037}  
Iteration 3:{space 3}log likelihood = {res:-944.32951}  
Iteration 4:{space 3}log likelihood = {res: -944.3295}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log likelihood = {res} -944.3295
{txt}tau = {res} 0.1     {txt}log likelihood = {res}-920.66432
{txt}tau = {res} 0.2     {txt}log likelihood = {res}-908.89935
{txt}tau = {res} 0.3     {txt}log likelihood = {res}-902.96601
{txt}tau = {res} 0.4     {txt}log likelihood = {res}-900.63674
{txt}tau = {res} 0.5     {txt}log likelihood = {res}-901.52728

{txt}Iteration 0:{space 3}log likelihood = {res:-900.73478}  
Iteration 1:{space 3}log likelihood = {res:-898.18649}  
Iteration 2:{space 3}log likelihood = {res:-898.13664}  
Iteration 3:{space 3}log likelihood = {res:-898.13663}  
{res}
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     1,919
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       116

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}      16.5
{txt}{col 63}max{col 67}={col 69}{res}       113

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    31.83
{txt}Log likelihood  = {res}-898.13663{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0002

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.42{col 27}{space 2}     0.31{col 38}{space 1}    1.57{col 47}{space 3} 0.12{col 55}{space 4}     0.92{col 68}{space 3}     2.19
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.42{col 27}{space 2}     0.56{col 38}{space 1}    0.88{col 47}{space 3} 0.38{col 55}{space 4}     0.65{col 68}{space 3}     3.07
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     3.55{col 27}{space 2}     1.86{col 38}{space 1}    2.43{col 47}{space 3} 0.02{col 55}{space 4}     1.28{col 68}{space 3}     9.89
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.27{col 27}{space 2}     0.46{col 38}{space 1}    0.67{col 47}{space 3} 0.51{col 55}{space 4}     0.63{col 68}{space 3}     2.60
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.74{col 27}{space 2}     0.65{col 38}{space 1}    1.49{col 47}{space 3} 0.14{col 55}{space 4}     0.84{col 68}{space 3}     3.61
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     2.50{col 27}{space 2}     0.85{col 38}{space 1}    2.70{col 47}{space 3} 0.01{col 55}{space 4}     1.28{col 68}{space 3}     4.86
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.00{col 27}{space 2}     0.01{col 38}{space 1}    0.10{col 47}{space 3} 0.92{col 55}{space 4}     0.98{col 68}{space 3}     1.03
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.56{col 27}{space 2}     0.41{col 38}{space 1}    1.71{col 47}{space 3} 0.09{col 55}{space 4}     0.94{col 68}{space 3}     2.61
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.48{col 27}{space 2}     0.25{col 38}{space 1}    2.38{col 47}{space 3} 0.02{col 55}{space 4}     1.07{col 68}{space 3}     2.05
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.85{col 27}{space 2}     0.44{col 38}{space 1}   -0.31{col 47}{space 3} 0.76{col 55}{space 4}     0.31{col 68}{space 3}     2.33
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -0.24{col 27}{space 2}     0.24{col 55}{space 4}    -0.71{col 68}{space 3}     0.23
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.89{col 27}{space 2}     0.11{col 55}{space 4}     0.70{col 68}{space 3}     1.12
{txt}          rho {c |}{col 15}{res}{space 2}     0.19{col 27}{space 2}     0.04{col 55}{space 4}     0.13{col 68}{space 3}     0.28
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}92.39{col 56}{txt}Prob >= chibar2 = {res}0.000

{txt}Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-6814.0141}  
Iteration 1:{space 3}log pseudolikelihood = {res:-6358.4233}  
Iteration 2:{space 3}log pseudolikelihood = {res:-6355.0358}  
Iteration 3:{space 3}log pseudolikelihood = {res:-6355.0341}  
Iteration 4:{space 3}log pseudolikelihood = {res:-6355.0341}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log pseudolikelihood = {res}-6355.0341
{txt}tau = {res} 0.1     {txt}log pseudolikelihood = {res}-6350.4621
{txt}tau = {res} 0.2     {txt}log pseudolikelihood = {res}-6349.7649
{txt}tau = {res} 0.3     {txt}log pseudolikelihood = {res}-6354.4945

{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-6349.7649}  
Iteration 1:{space 3}log pseudolikelihood = {res:-6347.9828}  
Iteration 2:{space 3}log pseudolikelihood = {res:-6347.9789}  
Iteration 3:{space 3}log pseudolikelihood = {res:-6347.9789}  
{res}
{txt}Calculating robust standard errors:

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    10,387
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     6,057

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       1.7
{txt}{col 63}max{col 67}={col 69}{res}         4

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}   221.98
{txt}Log pseudolikelihood  = {res}-6347.9789{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 79:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.88{col 27}{space 2}     0.20{col 38}{space 1}    5.89{col 47}{space 3} 0.00{col 55}{space 4}     1.52{col 68}{space 3}     2.32
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.61{col 27}{space 2}     0.12{col 38}{space 1}   -2.63{col 47}{space 3} 0.01{col 55}{space 4}     0.42{col 68}{space 3}     0.88
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     1.02{col 27}{space 2}     0.23{col 38}{space 1}    0.09{col 47}{space 3} 0.93{col 55}{space 4}     0.65{col 68}{space 3}     1.60
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.58{col 27}{space 2}     0.10{col 38}{space 1}   -3.06{col 47}{space 3} 0.00{col 55}{space 4}     0.41{col 68}{space 3}     0.82
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.74{col 27}{space 2}     0.13{col 38}{space 1}   -1.75{col 47}{space 3} 0.08{col 55}{space 4}     0.53{col 68}{space 3}     1.04
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     1.67{col 27}{space 2}     0.18{col 38}{space 1}    4.76{col 47}{space 3} 0.00{col 55}{space 4}     1.35{col 68}{space 3}     2.06
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.01{col 27}{space 2}     0.01{col 38}{space 1}    2.55{col 47}{space 3} 0.01{col 55}{space 4}     1.00{col 68}{space 3}     1.02
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.91{col 27}{space 2}     0.24{col 38}{space 1}    5.10{col 47}{space 3} 0.00{col 55}{space 4}     1.49{col 68}{space 3}     2.45
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.19{col 27}{space 2}     0.09{col 38}{space 1}    2.32{col 47}{space 3} 0.02{col 55}{space 4}     1.03{col 68}{space 3}     1.38
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.17{col 27}{space 2}     0.04{col 38}{space 1}   -8.35{col 47}{space 3} 0.00{col 55}{space 4}     0.11{col 68}{space 3}     0.26
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -1.34{col 27}{space 2}     0.46{col 55}{space 4}    -2.25{col 68}{space 3}    -0.43
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.51{col 27}{space 2}     0.12{col 55}{space 4}     0.32{col 68}{space 3}     0.80
{txt}          rho {c |}{col 15}{res}{space 2}     0.07{col 27}{space 2}     0.03{col 55}{space 4}     0.03{col 68}{space 3}     0.16
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}

Fitting comparison model:

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-670.81141}  
Iteration 1:{space 3}log pseudolikelihood = {res:-633.16372}  
Iteration 2:{space 3}log pseudolikelihood = {res:-631.46742}  
Iteration 3:{space 3}log pseudolikelihood = {res:-631.45626}  
Iteration 4:{space 3}log pseudolikelihood = {res:-631.45626}  
{res}
{txt}Fitting full model:

tau = {res} 0.0     {txt}log pseudolikelihood = {res}-631.45626
{txt}tau = {res} 0.1     {txt}log pseudolikelihood = {res}-631.53719

{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-631.53719}  
Iteration 1:{space 3}log pseudolikelihood = {res: -631.4704}  
Iteration 2:{space 3}log pseudolikelihood = {res:-631.46841}  
Iteration 3:{space 3}log pseudolikelihood = {res:-631.46021}  
Iteration 4:{space 3}log pseudolikelihood = {res:-631.45857}  
Iteration 5:{space 3}log pseudolikelihood = {res:-631.45689}  
Iteration 6:{space 3}log pseudolikelihood = {res:-631.45646}  
Iteration 7:{space 3}log pseudolikelihood = {res:-631.45637}  
Iteration 8:{space 3}log pseudolikelihood = {res:-631.45636}  
{res}
{txt}Calculating robust standard errors:

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     1,155
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     1,154

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       1.0
{txt}{col 63}max{col 67}={col 69}{res}         2

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    31.62
{txt}Log pseudolikelihood  = {res}-631.45636{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0002

{txt}{ralign 79:(Std. Err. adjusted for {res:116} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     0.59{col 27}{space 2}     0.15{col 38}{space 1}   -2.11{col 47}{space 3} 0.03{col 55}{space 4}     0.37{col 68}{space 3}     0.96
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.19{col 27}{space 2}     0.46{col 38}{space 1}    0.44{col 47}{space 3} 0.66{col 55}{space 4}     0.55{col 68}{space 3}     2.56
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.33{col 27}{space 2}     0.21{col 38}{space 1}   -1.70{col 47}{space 3} 0.09{col 55}{space 4}     0.09{col 68}{space 3}     1.18
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.27{col 27}{space 2}     0.51{col 38}{space 1}    0.59{col 47}{space 3} 0.56{col 55}{space 4}     0.57{col 68}{space 3}     2.81
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     3.92{col 27}{space 2}     1.69{col 38}{space 1}    3.16{col 47}{space 3} 0.00{col 55}{space 4}     1.68{col 68}{space 3}     9.14
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.99{col 27}{space 2}     0.36{col 38}{space 1}   -0.03{col 47}{space 3} 0.98{col 55}{space 4}     0.49{col 68}{space 3}     2.02
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.00{col 27}{space 2}     0.02{col 38}{space 1}   -0.25{col 47}{space 3} 0.80{col 55}{space 4}     0.97{col 68}{space 3}     1.03
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.20{col 27}{space 2}     0.37{col 38}{space 1}    0.61{col 47}{space 3} 0.54{col 55}{space 4}     0.66{col 68}{space 3}     2.19
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.24{col 27}{space 2}     0.25{col 38}{space 1}    1.06{col 47}{space 3} 0.29{col 55}{space 4}     0.83{col 68}{space 3}     1.85
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     2.75{col 27}{space 2}     1.63{col 38}{space 1}    1.71{col 47}{space 3} 0.09{col 55}{space 4}     0.86{col 68}{space 3}     8.77
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -7.40{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.02{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}

{com}. 
{txt}end of do-file

{com}. do estimation/margins          // Compute marginal probabilities.
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Define the names of variables over which to compute margins.
. local margin_vars = ustrtrim(usubinstr("$adj_var_names", "strat_var", "", .))
{txt}
{com}. 
. // Create an associative array to map between (outcome, variable) name pairs and
. // corresponding names used to store margins estimates.
. mata: margins_map = asarray_create("string")
{res}{txt}
{com}. 
. // Define a program to query the associative array. The name used to store the
. // margins estimates for the given outcome and variable is returned in
. // r(estimates_name).
. capture program drop margin_name
{txt}
{com}. program margin_name, rclass
{txt}  1{com}.   args outcome var
{txt}  2{com}.   tempname ret_val
{txt}  3{com}.   mata: i = asarray(margins_map, "`outcome'_`var'")
{txt}  4{com}.   mata: st_local("`ret_val'", strofreal(i))
{txt}  5{com}.   return local estimates_name = "margins_``ret_val''"
{txt}  6{com}. end
{txt}
{com}. 
. local i = 1
{txt}
{com}. foreach outcome of global process_outcomes {c -(}
{txt}  2{com}.   frame `outcome' {c -(}
{txt}  3{com}.     foreach var of local margin_vars {c -(}
{txt}  4{com}.       estimates restore `outcome'_estimates
{txt}  5{com}.       // If var is a factor, we use the following syntax, otherwise we 
.       // specialize for the continuous variables.
.       local margins margins `var'#i.arm, post
{txt}  6{com}.       if "`var'" == "cluster_size" {c -(}
{txt}  7{com}.         local margins margins i.arm, at(cluster_size = (0.1 1 2)) post
{txt}  8{com}.       {c )-}
{txt}  9{com}.       if "`var'" == "age" {c -(}
{txt} 10{com}.         local margins margins i.arm, at(age = (15(10)45)) post
{txt} 11{com}.       {c )-}
{txt} 12{com}.       
.       // Compute the margins.
.       `margins'
{txt} 13{com}. 
.       // Store the estimated results in the map.
.       local name margins_`i'
{txt} 14{com}.       estimates store `name'
{txt} 15{com}.       mata: asarray(margins_map, "`outcome'_`var'", `i')
{txt} 16{com}.       local i = `i' + 1
{txt} 17{com}.     {c )-}
{txt} 18{com}.   {c )-}
{txt} 19{com}. {c )-}
{txt}(results {stata estimates replay attendance_estimates:attendance_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    21,430
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 9}.1}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}_at#arm {c |}
{space 5}1#Control  {c |}{col 17}{res}{space 2}     0.40{col 29}{space 2}     0.02{col 40}{space 1}   23.13{col 49}{space 3} 0.00{col 57}{space 4}     0.36{col 70}{space 3}     0.43
{txt}1#Intervention  {c |}{col 17}{res}{space 2}     0.37{col 29}{space 2}     0.02{col 40}{space 1}   17.28{col 49}{space 3} 0.00{col 57}{space 4}     0.33{col 70}{space 3}     0.41
{txt}{space 5}2#Control  {c |}{col 17}{res}{space 2}     0.47{col 29}{space 2}     0.02{col 40}{space 1}   25.48{col 49}{space 3} 0.00{col 57}{space 4}     0.43{col 70}{space 3}     0.50
{txt}2#Intervention  {c |}{col 17}{res}{space 2}     0.44{col 29}{space 2}     0.01{col 40}{space 1}   33.77{col 49}{space 3} 0.00{col 57}{space 4}     0.41{col 70}{space 3}     0.46
{txt}{space 5}3#Control  {c |}{col 17}{res}{space 2}     0.54{col 29}{space 2}     0.04{col 40}{space 1}   13.94{col 49}{space 3} 0.00{col 57}{space 4}     0.47{col 70}{space 3}     0.62
{txt}3#Intervention  {c |}{col 17}{res}{space 2}     0.51{col 29}{space 2}     0.03{col 40}{space 1}   16.47{col 49}{space 3} 0.00{col 57}{space 4}     0.45{col 70}{space 3}     0.58
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay attendance_estimates:attendance_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    21,430
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}15}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}25}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}35}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}45}{p_end}
{p2colreset}{...}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}_at#arm {c |}
{space 5}1#Control  {c |}{col 17}{res}{space 2}     0.43{col 29}{space 2}     0.02{col 40}{space 1}   23.15{col 49}{space 3} 0.00{col 57}{space 4}     0.40{col 70}{space 3}     0.47
{txt}1#Intervention  {c |}{col 17}{res}{space 2}     0.41{col 29}{space 2}     0.02{col 40}{space 1}   23.16{col 49}{space 3} 0.00{col 57}{space 4}     0.37{col 70}{space 3}     0.44
{txt}{space 5}2#Control  {c |}{col 17}{res}{space 2}     0.45{col 29}{space 2}     0.02{col 40}{space 1}   29.11{col 49}{space 3} 0.00{col 57}{space 4}     0.42{col 70}{space 3}     0.48
{txt}2#Intervention  {c |}{col 17}{res}{space 2}     0.42{col 29}{space 2}     0.01{col 40}{space 1}   33.71{col 49}{space 3} 0.00{col 57}{space 4}     0.40{col 70}{space 3}     0.44
{txt}{space 5}3#Control  {c |}{col 17}{res}{space 2}     0.47{col 29}{space 2}     0.02{col 40}{space 1}   24.59{col 49}{space 3} 0.00{col 57}{space 4}     0.43{col 70}{space 3}     0.50
{txt}3#Intervention  {c |}{col 17}{res}{space 2}     0.44{col 29}{space 2}     0.02{col 40}{space 1}   28.70{col 49}{space 3} 0.00{col 57}{space 4}     0.41{col 70}{space 3}     0.47
{txt}{space 5}4#Control  {c |}{col 17}{res}{space 2}     0.48{col 29}{space 2}     0.03{col 40}{space 1}   17.97{col 49}{space 3} 0.00{col 57}{space 4}     0.43{col 70}{space 3}     0.53
{txt}4#Intervention  {c |}{col 17}{res}{space 2}     0.45{col 29}{space 2}     0.02{col 40}{space 1}   19.38{col 49}{space 3} 0.00{col 57}{space 4}     0.40{col 70}{space 3}     0.50
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay attendance_estimates:attendance_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    21,430
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 22}{c |}{col 34} Delta-method
{col 22}{c |}     Margin{col 34}   Std. Err.{col 46}      z{col 54}   P>|z|{col 62}     [95% Con{col 75}f. Interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}lab_available#arm {c |}
{space 5}No lab#Control  {c |}{col 22}{res}{space 2}     0.45{col 34}{space 2}     0.02{col 45}{space 1}   22.55{col 54}{space 3} 0.00{col 62}{space 4}     0.41{col 75}{space 3}     0.49
{txt}No lab#Intervention  {c |}{col 22}{res}{space 2}     0.42{col 34}{space 2}     0.02{col 45}{space 1}   23.45{col 54}{space 3} 0.00{col 62}{space 4}     0.39{col 75}{space 3}     0.46
{txt}{space 8}Lab#Control  {c |}{col 22}{res}{space 2}     0.45{col 34}{space 2}     0.02{col 45}{space 1}   24.77{col 54}{space 3} 0.00{col 62}{space 4}     0.41{col 75}{space 3}     0.49
{txt}{space 3}Lab#Intervention  {c |}{col 22}{res}{space 2}     0.42{col 34}{space 2}     0.02{col 45}{space 1}   27.54{col 54}{space 3} 0.00{col 62}{space 4}     0.39{col 75}{space 3}     0.45
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay attendance_estimates:attendance_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    21,430
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33} Delta-method
{col 21}{c |}     Margin{col 33}   Std. Err.{col 45}      z{col 53}   P>|z|{col 61}     [95% Con{col 74}f. Interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}primiparous#arm {c |}
{space 5}Multi#Control  {c |}{col 21}{res}{space 2}     0.45{col 33}{space 2}     0.02{col 44}{space 1}   29.71{col 53}{space 3} 0.00{col 61}{space 4}     0.42{col 74}{space 3}     0.48
{txt}Multi#Intervention  {c |}{col 21}{res}{space 2}     0.42{col 33}{space 2}     0.01{col 44}{space 1}   31.70{col 53}{space 3} 0.00{col 61}{space 4}     0.39{col 74}{space 3}     0.45
{txt}{space 5}Primi#Control  {c |}{col 21}{res}{space 2}     0.45{col 33}{space 2}     0.02{col 44}{space 1}   23.37{col 53}{space 3} 0.00{col 61}{space 4}     0.41{col 74}{space 3}     0.49
{txt}Primi#Intervention  {c |}{col 21}{res}{space 2}     0.42{col 33}{space 2}     0.01{col 44}{space 1}   31.34{col 53}{space 3} 0.00{col 61}{space 4}     0.40{col 74}{space 3}     0.45
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay hypertension_estimates:hypertension_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    15,383
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 9}.1}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}_at#arm {c |}
{space 5}1#Control  {c |}{col 17}{res}{space 2}     0.95{col 29}{space 2}     0.00{col 40}{space 1}  222.77{col 49}{space 3} 0.00{col 57}{space 4}     0.94{col 70}{space 3}     0.96
{txt}1#Intervention  {c |}{col 17}{res}{space 2}     0.97{col 29}{space 2}     0.00{col 40}{space 1}  233.75{col 49}{space 3} 0.00{col 57}{space 4}     0.96{col 70}{space 3}     0.98
{txt}{space 5}2#Control  {c |}{col 17}{res}{space 2}     0.95{col 29}{space 2}     0.00{col 40}{space 1}  297.20{col 49}{space 3} 0.00{col 57}{space 4}     0.94{col 70}{space 3}     0.95
{txt}2#Intervention  {c |}{col 17}{res}{space 2}     0.97{col 29}{space 2}     0.00{col 40}{space 1}  313.59{col 49}{space 3} 0.00{col 57}{space 4}     0.96{col 70}{space 3}     0.97
{txt}{space 5}3#Control  {c |}{col 17}{res}{space 2}     0.94{col 29}{space 2}     0.01{col 40}{space 1}  126.76{col 49}{space 3} 0.00{col 57}{space 4}     0.93{col 70}{space 3}     0.96
{txt}3#Intervention  {c |}{col 17}{res}{space 2}     0.96{col 29}{space 2}     0.00{col 40}{space 1}  196.95{col 49}{space 3} 0.00{col 57}{space 4}     0.95{col 70}{space 3}     0.97
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay hypertension_estimates:hypertension_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    15,383
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}15}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}25}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}35}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}45}{p_end}
{p2colreset}{...}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}_at#arm {c |}
{space 5}1#Control  {c |}{col 17}{res}{space 2}     0.96{col 29}{space 2}     0.00{col 40}{space 1}  202.86{col 49}{space 3} 0.00{col 57}{space 4}     0.95{col 70}{space 3}     0.97
{txt}1#Intervention  {c |}{col 17}{res}{space 2}     0.97{col 29}{space 2}     0.00{col 40}{space 1}  265.23{col 49}{space 3} 0.00{col 57}{space 4}     0.97{col 70}{space 3}     0.98
{txt}{space 5}2#Control  {c |}{col 17}{res}{space 2}     0.95{col 29}{space 2}     0.00{col 40}{space 1}  324.36{col 49}{space 3} 0.00{col 57}{space 4}     0.94{col 70}{space 3}     0.95
{txt}2#Intervention  {c |}{col 17}{res}{space 2}     0.97{col 29}{space 2}     0.00{col 40}{space 1}  315.15{col 49}{space 3} 0.00{col 57}{space 4}     0.96{col 70}{space 3}     0.97
{txt}{space 5}3#Control  {c |}{col 17}{res}{space 2}     0.94{col 29}{space 2}     0.01{col 40}{space 1}  168.81{col 49}{space 3} 0.00{col 57}{space 4}     0.93{col 70}{space 3}     0.95
{txt}3#Intervention  {c |}{col 17}{res}{space 2}     0.96{col 29}{space 2}     0.00{col 40}{space 1}  203.52{col 49}{space 3} 0.00{col 57}{space 4}     0.95{col 70}{space 3}     0.97
{txt}{space 5}4#Control  {c |}{col 17}{res}{space 2}     0.93{col 29}{space 2}     0.01{col 40}{space 1}   78.71{col 49}{space 3} 0.00{col 57}{space 4}     0.90{col 70}{space 3}     0.95
{txt}4#Intervention  {c |}{col 17}{res}{space 2}     0.95{col 29}{space 2}     0.01{col 40}{space 1}  108.79{col 49}{space 3} 0.00{col 57}{space 4}     0.93{col 70}{space 3}     0.97
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay hypertension_estimates:hypertension_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    15,383
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 22}{c |}{col 34} Delta-method
{col 22}{c |}     Margin{col 34}   Std. Err.{col 46}      z{col 54}   P>|z|{col 62}     [95% Con{col 75}f. Interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}lab_available#arm {c |}
{space 5}No lab#Control  {c |}{col 22}{res}{space 2}     0.94{col 34}{space 2}     0.00{col 45}{space 1}  192.79{col 54}{space 3} 0.00{col 62}{space 4}     0.93{col 75}{space 3}     0.95
{txt}No lab#Intervention  {c |}{col 22}{res}{space 2}     0.96{col 34}{space 2}     0.00{col 45}{space 1}  215.21{col 54}{space 3} 0.00{col 62}{space 4}     0.95{col 75}{space 3}     0.97
{txt}{space 8}Lab#Control  {c |}{col 22}{res}{space 2}     0.95{col 34}{space 2}     0.00{col 45}{space 1}  257.07{col 54}{space 3} 0.00{col 62}{space 4}     0.94{col 75}{space 3}     0.96
{txt}{space 3}Lab#Intervention  {c |}{col 22}{res}{space 2}     0.97{col 34}{space 2}     0.00{col 45}{space 1}  308.10{col 54}{space 3} 0.00{col 62}{space 4}     0.96{col 75}{space 3}     0.97
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay hypertension_estimates:hypertension_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    15,383
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33} Delta-method
{col 21}{c |}     Margin{col 33}   Std. Err.{col 45}      z{col 53}   P>|z|{col 61}     [95% Con{col 74}f. Interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}primiparous#arm {c |}
{space 5}Multi#Control  {c |}{col 21}{res}{space 2}     0.95{col 33}{space 2}     0.00{col 44}{space 1}  319.90{col 53}{space 3} 0.00{col 61}{space 4}     0.94{col 74}{space 3}     0.95
{txt}Multi#Intervention  {c |}{col 21}{res}{space 2}     0.97{col 33}{space 2}     0.00{col 44}{space 1}  316.08{col 53}{space 3} 0.00{col 61}{space 4}     0.96{col 74}{space 3}     0.97
{txt}{space 5}Primi#Control  {c |}{col 21}{res}{space 2}     0.94{col 33}{space 2}     0.01{col 44}{space 1}  168.66{col 53}{space 3} 0.00{col 61}{space 4}     0.93{col 74}{space 3}     0.96
{txt}Primi#Intervention  {c |}{col 21}{res}{space 2}     0.96{col 33}{space 2}     0.00{col 44}{space 1}  207.84{col 53}{space 3} 0.00{col 61}{space 4}     0.96{col 74}{space 3}     0.97
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay diabetes_estimates:diabetes_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    11,994
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 9}.1}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}_at#arm {c |}
{space 5}1#Control  {c |}{col 17}{res}{space 2}     0.14{col 29}{space 2}     0.01{col 40}{space 1}   10.17{col 49}{space 3} 0.00{col 57}{space 4}     0.12{col 70}{space 3}     0.17
{txt}1#Intervention  {c |}{col 17}{res}{space 2}     0.20{col 29}{space 2}     0.02{col 40}{space 1}   10.04{col 49}{space 3} 0.00{col 57}{space 4}     0.16{col 70}{space 3}     0.23
{txt}{space 5}2#Control  {c |}{col 17}{res}{space 2}     0.18{col 29}{space 2}     0.01{col 40}{space 1}   14.31{col 49}{space 3} 0.00{col 57}{space 4}     0.16{col 70}{space 3}     0.21
{txt}2#Intervention  {c |}{col 17}{res}{space 2}     0.24{col 29}{space 2}     0.02{col 40}{space 1}   14.00{col 49}{space 3} 0.00{col 57}{space 4}     0.21{col 70}{space 3}     0.28
{txt}{space 5}3#Control  {c |}{col 17}{res}{space 2}     0.24{col 29}{space 2}     0.04{col 40}{space 1}    6.64{col 49}{space 3} 0.00{col 57}{space 4}     0.17{col 70}{space 3}     0.31
{txt}3#Intervention  {c |}{col 17}{res}{space 2}     0.31{col 29}{space 2}     0.04{col 40}{space 1}    7.24{col 49}{space 3} 0.00{col 57}{space 4}     0.23{col 70}{space 3}     0.39
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay diabetes_estimates:diabetes_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    11,994
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}15}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}25}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}35}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}45}{p_end}
{p2colreset}{...}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}_at#arm {c |}
{space 5}1#Control  {c |}{col 17}{res}{space 2}     0.16{col 29}{space 2}     0.01{col 40}{space 1}   13.18{col 49}{space 3} 0.00{col 57}{space 4}     0.14{col 70}{space 3}     0.19
{txt}1#Intervention  {c |}{col 17}{res}{space 2}     0.22{col 29}{space 2}     0.02{col 40}{space 1}   12.64{col 49}{space 3} 0.00{col 57}{space 4}     0.18{col 70}{space 3}     0.25
{txt}{space 5}2#Control  {c |}{col 17}{res}{space 2}     0.18{col 29}{space 2}     0.01{col 40}{space 1}   15.56{col 49}{space 3} 0.00{col 57}{space 4}     0.15{col 70}{space 3}     0.20
{txt}2#Intervention  {c |}{col 17}{res}{space 2}     0.23{col 29}{space 2}     0.02{col 40}{space 1}   14.90{col 49}{space 3} 0.00{col 57}{space 4}     0.20{col 70}{space 3}     0.26
{txt}{space 5}3#Control  {c |}{col 17}{res}{space 2}     0.19{col 29}{space 2}     0.01{col 40}{space 1}   14.59{col 49}{space 3} 0.00{col 57}{space 4}     0.16{col 70}{space 3}     0.21
{txt}3#Intervention  {c |}{col 17}{res}{space 2}     0.25{col 29}{space 2}     0.02{col 40}{space 1}   14.67{col 49}{space 3} 0.00{col 57}{space 4}     0.22{col 70}{space 3}     0.28
{txt}{space 5}4#Control  {c |}{col 17}{res}{space 2}     0.20{col 29}{space 2}     0.02{col 40}{space 1}   11.77{col 49}{space 3} 0.00{col 57}{space 4}     0.17{col 70}{space 3}     0.24
{txt}4#Intervention  {c |}{col 17}{res}{space 2}     0.27{col 29}{space 2}     0.02{col 40}{space 1}   12.47{col 49}{space 3} 0.00{col 57}{space 4}     0.23{col 70}{space 3}     0.31
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay diabetes_estimates:diabetes_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    11,994
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 22}{c |}{col 34} Delta-method
{col 22}{c |}     Margin{col 34}   Std. Err.{col 46}      z{col 54}   P>|z|{col 62}     [95% Con{col 75}f. Interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}lab_available#arm {c |}
{space 5}No lab#Control  {c |}{col 22}{res}{space 2}     0.12{col 34}{space 2}     0.01{col 45}{space 1}    8.77{col 54}{space 3} 0.00{col 62}{space 4}     0.09{col 75}{space 3}     0.15
{txt}No lab#Intervention  {c |}{col 22}{res}{space 2}     0.17{col 34}{space 2}     0.02{col 45}{space 1}    9.48{col 54}{space 3} 0.00{col 62}{space 4}     0.13{col 75}{space 3}     0.20
{txt}{space 8}Lab#Control  {c |}{col 22}{res}{space 2}     0.21{col 34}{space 2}     0.02{col 45}{space 1}   14.19{col 54}{space 3} 0.00{col 62}{space 4}     0.19{col 75}{space 3}     0.24
{txt}{space 3}Lab#Intervention  {c |}{col 22}{res}{space 2}     0.28{col 34}{space 2}     0.02{col 45}{space 1}   13.27{col 54}{space 3} 0.00{col 62}{space 4}     0.24{col 75}{space 3}     0.32
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay diabetes_estimates:diabetes_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    11,994
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33} Delta-method
{col 21}{c |}     Margin{col 33}   Std. Err.{col 45}      z{col 53}   P>|z|{col 61}     [95% Con{col 74}f. Interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}primiparous#arm {c |}
{space 5}Multi#Control  {c |}{col 21}{res}{space 2}     0.17{col 33}{space 2}     0.01{col 44}{space 1}   15.67{col 53}{space 3} 0.00{col 61}{space 4}     0.15{col 74}{space 3}     0.20
{txt}Multi#Intervention  {c |}{col 21}{res}{space 2}     0.23{col 33}{space 2}     0.02{col 44}{space 1}   15.24{col 53}{space 3} 0.00{col 61}{space 4}     0.20{col 74}{space 3}     0.26
{txt}{space 5}Primi#Control  {c |}{col 21}{res}{space 2}     0.19{col 33}{space 2}     0.01{col 44}{space 1}   13.83{col 53}{space 3} 0.00{col 61}{space 4}     0.16{col 74}{space 3}     0.22
{txt}Primi#Intervention  {c |}{col 21}{res}{space 2}     0.25{col 33}{space 2}     0.02{col 44}{space 1}   13.23{col 53}{space 3} 0.00{col 61}{space 4}     0.21{col 74}{space 3}     0.29
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay malpresentation_estimates:malpresentation_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}     1,919
{txt}{col 1}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 9}.1}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}_at#arm {c |}
{space 5}1#Control  {c |}{col 17}{res}{space 2}     0.66{col 29}{space 2}     0.04{col 40}{space 1}   14.94{col 49}{space 3} 0.00{col 57}{space 4}     0.57{col 70}{space 3}     0.74
{txt}1#Intervention  {c |}{col 17}{res}{space 2}     0.72{col 29}{space 2}     0.04{col 40}{space 1}   17.12{col 49}{space 3} 0.00{col 57}{space 4}     0.64{col 70}{space 3}     0.80
{txt}{space 5}2#Control  {c |}{col 17}{res}{space 2}     0.79{col 29}{space 2}     0.03{col 40}{space 1}   27.61{col 49}{space 3} 0.00{col 57}{space 4}     0.74{col 70}{space 3}     0.85
{txt}2#Intervention  {c |}{col 17}{res}{space 2}     0.84{col 29}{space 2}     0.02{col 40}{space 1}   34.42{col 49}{space 3} 0.00{col 57}{space 4}     0.79{col 70}{space 3}     0.89
{txt}{space 5}3#Control  {c |}{col 17}{res}{space 2}     0.90{col 29}{space 2}     0.04{col 40}{space 1}   21.34{col 49}{space 3} 0.00{col 57}{space 4}     0.81{col 70}{space 3}     0.98
{txt}3#Intervention  {c |}{col 17}{res}{space 2}     0.92{col 29}{space 2}     0.03{col 40}{space 1}   28.37{col 49}{space 3} 0.00{col 57}{space 4}     0.86{col 70}{space 3}     0.99
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay malpresentation_estimates:malpresentation_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}     1,919
{txt}{col 1}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}15}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}25}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}35}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}45}{p_end}
{p2colreset}{...}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}_at#arm {c |}
{space 5}1#Control  {c |}{col 17}{res}{space 2}     0.76{col 29}{space 2}     0.03{col 40}{space 1}   24.05{col 49}{space 3} 0.00{col 57}{space 4}     0.70{col 70}{space 3}     0.82
{txt}1#Intervention  {c |}{col 17}{res}{space 2}     0.81{col 29}{space 2}     0.03{col 40}{space 1}   28.95{col 49}{space 3} 0.00{col 57}{space 4}     0.75{col 70}{space 3}     0.86
{txt}{space 5}2#Control  {c |}{col 17}{res}{space 2}     0.76{col 29}{space 2}     0.02{col 40}{space 1}   32.05{col 49}{space 3} 0.00{col 57}{space 4}     0.71{col 70}{space 3}     0.81
{txt}2#Intervention  {c |}{col 17}{res}{space 2}     0.81{col 29}{space 2}     0.02{col 40}{space 1}   37.75{col 49}{space 3} 0.00{col 57}{space 4}     0.77{col 70}{space 3}     0.85
{txt}{space 5}3#Control  {c |}{col 17}{res}{space 2}     0.76{col 29}{space 2}     0.03{col 40}{space 1}   26.23{col 49}{space 3} 0.00{col 57}{space 4}     0.70{col 70}{space 3}     0.82
{txt}3#Intervention  {c |}{col 17}{res}{space 2}     0.81{col 29}{space 2}     0.03{col 40}{space 1}   31.24{col 49}{space 3} 0.00{col 57}{space 4}     0.76{col 70}{space 3}     0.86
{txt}{space 5}4#Control  {c |}{col 17}{res}{space 2}     0.76{col 29}{space 2}     0.04{col 40}{space 1}   17.91{col 49}{space 3} 0.00{col 57}{space 4}     0.68{col 70}{space 3}     0.85
{txt}4#Intervention  {c |}{col 17}{res}{space 2}     0.81{col 29}{space 2}     0.04{col 40}{space 1}   21.70{col 49}{space 3} 0.00{col 57}{space 4}     0.74{col 70}{space 3}     0.89
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay malpresentation_estimates:malpresentation_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}     1,919
{txt}{col 1}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 22}{c |}{col 34} Delta-method
{col 22}{c |}     Margin{col 34}   Std. Err.{col 46}      z{col 54}   P>|z|{col 62}     [95% Con{col 75}f. Interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}lab_available#arm {c |}
{space 5}No lab#Control  {c |}{col 22}{res}{space 2}     0.72{col 34}{space 2}     0.04{col 45}{space 1}   19.81{col 54}{space 3} 0.00{col 62}{space 4}     0.65{col 75}{space 3}     0.79
{txt}No lab#Intervention  {c |}{col 22}{res}{space 2}     0.77{col 34}{space 2}     0.03{col 45}{space 1}   23.76{col 54}{space 3} 0.00{col 62}{space 4}     0.71{col 75}{space 3}     0.84
{txt}{space 8}Lab#Control  {c |}{col 22}{res}{space 2}     0.79{col 34}{space 2}     0.03{col 45}{space 1}   28.82{col 54}{space 3} 0.00{col 62}{space 4}     0.74{col 75}{space 3}     0.84
{txt}{space 3}Lab#Intervention  {c |}{col 22}{res}{space 2}     0.83{col 34}{space 2}     0.02{col 45}{space 1}   34.87{col 54}{space 3} 0.00{col 62}{space 4}     0.79{col 75}{space 3}     0.88
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay malpresentation_estimates:malpresentation_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}     1,919
{txt}{col 1}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33} Delta-method
{col 21}{c |}     Margin{col 33}   Std. Err.{col 45}      z{col 53}   P>|z|{col 61}     [95% Con{col 74}f. Interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}primiparous#arm {c |}
{space 5}Multi#Control  {c |}{col 21}{res}{space 2}     0.75{col 33}{space 2}     0.03{col 44}{space 1}   29.58{col 53}{space 3} 0.00{col 61}{space 4}     0.70{col 74}{space 3}     0.80
{txt}Multi#Intervention  {c |}{col 21}{res}{space 2}     0.80{col 33}{space 2}     0.02{col 44}{space 1}   35.07{col 53}{space 3} 0.00{col 61}{space 4}     0.75{col 74}{space 3}     0.84
{txt}{space 5}Primi#Control  {c |}{col 21}{res}{space 2}     0.80{col 33}{space 2}     0.03{col 44}{space 1}   29.83{col 53}{space 3} 0.00{col 61}{space 4}     0.75{col 74}{space 3}     0.86
{txt}Primi#Intervention  {c |}{col 21}{res}{space 2}     0.85{col 33}{space 2}     0.02{col 44}{space 1}   35.60{col 53}{space 3} 0.00{col 61}{space 4}     0.80{col 74}{space 3}     0.89
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay anemia_estimates:anemia_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    10,387
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 9}.1}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}_at#arm {c |}
{space 5}1#Control  {c |}{col 17}{res}{space 2}     0.23{col 29}{space 2}     0.02{col 40}{space 1}   12.40{col 49}{space 3} 0.00{col 57}{space 4}     0.19{col 70}{space 3}     0.27
{txt}1#Intervention  {c |}{col 17}{res}{space 2}     0.35{col 29}{space 2}     0.02{col 40}{space 1}   14.75{col 49}{space 3} 0.00{col 57}{space 4}     0.30{col 70}{space 3}     0.40
{txt}{space 5}2#Control  {c |}{col 17}{res}{space 2}     0.32{col 29}{space 2}     0.02{col 40}{space 1}   19.12{col 49}{space 3} 0.00{col 57}{space 4}     0.28{col 70}{space 3}     0.35
{txt}2#Intervention  {c |}{col 17}{res}{space 2}     0.45{col 29}{space 2}     0.02{col 40}{space 1}   27.89{col 49}{space 3} 0.00{col 57}{space 4}     0.42{col 70}{space 3}     0.48
{txt}{space 5}3#Control  {c |}{col 17}{res}{space 2}     0.42{col 29}{space 2}     0.03{col 40}{space 1}   12.47{col 49}{space 3} 0.00{col 57}{space 4}     0.36{col 70}{space 3}     0.49
{txt}3#Intervention  {c |}{col 17}{res}{space 2}     0.57{col 29}{space 2}     0.03{col 40}{space 1}   18.18{col 49}{space 3} 0.00{col 57}{space 4}     0.51{col 70}{space 3}     0.63
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay anemia_estimates:anemia_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    10,387
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}15}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}25}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}35}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}45}{p_end}
{p2colreset}{...}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}_at#arm {c |}
{space 5}1#Control  {c |}{col 17}{res}{space 2}     0.27{col 29}{space 2}     0.02{col 40}{space 1}   15.05{col 49}{space 3} 0.00{col 57}{space 4}     0.24{col 70}{space 3}     0.31
{txt}1#Intervention  {c |}{col 17}{res}{space 2}     0.40{col 29}{space 2}     0.02{col 40}{space 1}   21.69{col 49}{space 3} 0.00{col 57}{space 4}     0.36{col 70}{space 3}     0.44
{txt}{space 5}2#Control  {c |}{col 17}{res}{space 2}     0.30{col 29}{space 2}     0.02{col 40}{space 1}   19.62{col 49}{space 3} 0.00{col 57}{space 4}     0.27{col 70}{space 3}     0.33
{txt}2#Intervention  {c |}{col 17}{res}{space 2}     0.43{col 29}{space 2}     0.02{col 40}{space 1}   27.44{col 49}{space 3} 0.00{col 57}{space 4}     0.40{col 70}{space 3}     0.46
{txt}{space 5}3#Control  {c |}{col 17}{res}{space 2}     0.32{col 29}{space 2}     0.02{col 40}{space 1}   18.88{col 49}{space 3} 0.00{col 57}{space 4}     0.29{col 70}{space 3}     0.36
{txt}3#Intervention  {c |}{col 17}{res}{space 2}     0.45{col 29}{space 2}     0.02{col 40}{space 1}   23.58{col 49}{space 3} 0.00{col 57}{space 4}     0.42{col 70}{space 3}     0.49
{txt}{space 5}4#Control  {c |}{col 17}{res}{space 2}     0.35{col 29}{space 2}     0.02{col 40}{space 1}   14.73{col 49}{space 3} 0.00{col 57}{space 4}     0.30{col 70}{space 3}     0.39
{txt}4#Intervention  {c |}{col 17}{res}{space 2}     0.48{col 29}{space 2}     0.03{col 40}{space 1}   17.72{col 49}{space 3} 0.00{col 57}{space 4}     0.43{col 70}{space 3}     0.54
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay anemia_estimates:anemia_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    10,387
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 22}{c |}{col 34} Delta-method
{col 22}{c |}     Margin{col 34}   Std. Err.{col 46}      z{col 54}   P>|z|{col 62}     [95% Con{col 75}f. Interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}lab_available#arm {c |}
{space 5}No lab#Control  {c |}{col 22}{res}{space 2}     0.23{col 34}{space 2}     0.02{col 45}{space 1}   11.09{col 54}{space 3} 0.00{col 62}{space 4}     0.19{col 75}{space 3}     0.27
{txt}No lab#Intervention  {c |}{col 22}{res}{space 2}     0.34{col 34}{space 2}     0.02{col 45}{space 1}   16.17{col 54}{space 3} 0.00{col 62}{space 4}     0.30{col 75}{space 3}     0.39
{txt}{space 8}Lab#Control  {c |}{col 22}{res}{space 2}     0.35{col 34}{space 2}     0.02{col 45}{space 1}   19.26{col 54}{space 3} 0.00{col 62}{space 4}     0.31{col 75}{space 3}     0.38
{txt}{space 3}Lab#Intervention  {c |}{col 22}{res}{space 2}     0.49{col 34}{space 2}     0.02{col 45}{space 1}   23.24{col 54}{space 3} 0.00{col 62}{space 4}     0.45{col 75}{space 3}     0.53
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay anemia_estimates:anemia_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}    10,387
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33} Delta-method
{col 21}{c |}     Margin{col 33}   Std. Err.{col 45}      z{col 53}   P>|z|{col 61}     [95% Con{col 74}f. Interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}primiparous#arm {c |}
{space 5}Multi#Control  {c |}{col 21}{res}{space 2}     0.29{col 33}{space 2}     0.02{col 44}{space 1}   18.80{col 53}{space 3} 0.00{col 61}{space 4}     0.26{col 74}{space 3}     0.32
{txt}Multi#Intervention  {c |}{col 21}{res}{space 2}     0.42{col 33}{space 2}     0.02{col 44}{space 1}   26.64{col 53}{space 3} 0.00{col 61}{space 4}     0.39{col 74}{space 3}     0.45
{txt}{space 5}Primi#Control  {c |}{col 21}{res}{space 2}     0.33{col 33}{space 2}     0.02{col 44}{space 1}   17.71{col 53}{space 3} 0.00{col 61}{space 4}     0.29{col 74}{space 3}     0.36
{txt}Primi#Intervention  {c |}{col 21}{res}{space 2}     0.46{col 33}{space 2}     0.02{col 44}{space 1}   22.06{col 53}{space 3} 0.00{col 61}{space 4}     0.42{col 74}{space 3}     0.50
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay fetalgrowth_estimates:fetalgrowth_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}     1,155
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 9}.1}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:cluster_size}{space 4}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}_at#arm {c |}
{space 5}1#Control  {c |}{col 17}{res}{space 2}     0.79{col 29}{space 2}     0.05{col 40}{space 1}   16.89{col 49}{space 3} 0.00{col 57}{space 4}     0.70{col 70}{space 3}     0.88
{txt}1#Intervention  {c |}{col 17}{res}{space 2}     0.69{col 29}{space 2}     0.05{col 40}{space 1}   12.68{col 49}{space 3} 0.00{col 57}{space 4}     0.59{col 70}{space 3}     0.80
{txt}{space 5}2#Control  {c |}{col 17}{res}{space 2}     0.79{col 29}{space 2}     0.03{col 40}{space 1}   24.73{col 49}{space 3} 0.00{col 57}{space 4}     0.72{col 70}{space 3}     0.85
{txt}2#Intervention  {c |}{col 17}{res}{space 2}     0.69{col 29}{space 2}     0.04{col 40}{space 1}   16.92{col 49}{space 3} 0.00{col 57}{space 4}     0.61{col 70}{space 3}     0.77
{txt}{space 5}3#Control  {c |}{col 17}{res}{space 2}     0.79{col 29}{space 2}     0.08{col 40}{space 1}   10.00{col 49}{space 3} 0.00{col 57}{space 4}     0.63{col 70}{space 3}     0.94
{txt}3#Intervention  {c |}{col 17}{res}{space 2}     0.69{col 29}{space 2}     0.10{col 40}{space 1}    6.79{col 49}{space 3} 0.00{col 57}{space 4}     0.49{col 70}{space 3}     0.89
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay fetalgrowth_estimates:fetalgrowth_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}     1,155
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}15}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}25}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}35}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}45}{p_end}
{p2colreset}{...}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   Std. Err.{col 41}      z{col 49}   P>|z|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}_at#arm {c |}
{space 5}1#Control  {c |}{col 17}{res}{space 2}     0.79{col 29}{space 2}     0.03{col 40}{space 1}   23.84{col 49}{space 3} 0.00{col 57}{space 4}     0.73{col 70}{space 3}     0.86
{txt}1#Intervention  {c |}{col 17}{res}{space 2}     0.70{col 29}{space 2}     0.04{col 40}{space 1}   15.81{col 49}{space 3} 0.00{col 57}{space 4}     0.61{col 70}{space 3}     0.79
{txt}{space 5}2#Control  {c |}{col 17}{res}{space 2}     0.79{col 29}{space 2}     0.03{col 40}{space 1}   28.63{col 49}{space 3} 0.00{col 57}{space 4}     0.73{col 70}{space 3}     0.84
{txt}2#Intervention  {c |}{col 17}{res}{space 2}     0.69{col 29}{space 2}     0.03{col 40}{space 1}   20.47{col 49}{space 3} 0.00{col 57}{space 4}     0.63{col 70}{space 3}     0.76
{txt}{space 5}3#Control  {c |}{col 17}{res}{space 2}     0.78{col 29}{space 2}     0.04{col 40}{space 1}   19.67{col 49}{space 3} 0.00{col 57}{space 4}     0.70{col 70}{space 3}     0.86
{txt}3#Intervention  {c |}{col 17}{res}{space 2}     0.69{col 29}{space 2}     0.05{col 40}{space 1}   14.77{col 49}{space 3} 0.00{col 57}{space 4}     0.60{col 70}{space 3}     0.78
{txt}{space 5}4#Control  {c |}{col 17}{res}{space 2}     0.78{col 29}{space 2}     0.06{col 40}{space 1}   12.73{col 49}{space 3} 0.00{col 57}{space 4}     0.66{col 70}{space 3}     0.90
{txt}4#Intervention  {c |}{col 17}{res}{space 2}     0.68{col 29}{space 2}     0.07{col 40}{space 1}    9.47{col 49}{space 3} 0.00{col 57}{space 4}     0.54{col 70}{space 3}     0.82
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay fetalgrowth_estimates:fetalgrowth_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}     1,155
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 22}{c |}{col 34} Delta-method
{col 22}{c |}     Margin{col 34}   Std. Err.{col 46}      z{col 54}   P>|z|{col 62}     [95% Con{col 75}f. Interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}lab_available#arm {c |}
{space 5}No lab#Control  {c |}{col 22}{res}{space 2}     0.77{col 34}{space 2}     0.04{col 45}{space 1}   18.52{col 54}{space 3} 0.00{col 62}{space 4}     0.69{col 75}{space 3}     0.85
{txt}No lab#Intervention  {c |}{col 22}{res}{space 2}     0.67{col 34}{space 2}     0.05{col 45}{space 1}   13.02{col 54}{space 3} 0.00{col 62}{space 4}     0.57{col 75}{space 3}     0.78
{txt}{space 8}Lab#Control  {c |}{col 22}{res}{space 2}     0.80{col 34}{space 2}     0.03{col 45}{space 1}   24.40{col 54}{space 3} 0.00{col 62}{space 4}     0.74{col 75}{space 3}     0.86
{txt}{space 3}Lab#Intervention  {c |}{col 22}{res}{space 2}     0.71{col 34}{space 2}     0.04{col 45}{space 1}   17.93{col 54}{space 3} 0.00{col 62}{space 4}     0.63{col 75}{space 3}     0.79
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay fetalgrowth_estimates:fetalgrowth_estimates} are active now)
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}     1,155
{txt}{col 1}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(y=1), predict(pr)}{p_end}
{p2colreset}{...}

{res}{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33} Delta-method
{col 21}{c |}     Margin{col 33}   Std. Err.{col 45}      z{col 53}   P>|z|{col 61}     [95% Con{col 74}f. Interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}primiparous#arm {c |}
{space 5}Multi#Control  {c |}{col 21}{res}{space 2}     0.78{col 33}{space 2}     0.03{col 44}{space 1}   26.23{col 53}{space 3} 0.00{col 61}{space 4}     0.72{col 74}{space 3}     0.84
{txt}Multi#Intervention  {c |}{col 21}{res}{space 2}     0.68{col 33}{space 2}     0.04{col 44}{space 1}   18.84{col 53}{space 3} 0.00{col 61}{space 4}     0.61{col 74}{space 3}     0.76
{txt}{space 5}Primi#Control  {c |}{col 21}{res}{space 2}     0.81{col 33}{space 2}     0.03{col 44}{space 1}   23.64{col 53}{space 3} 0.00{col 61}{space 4}     0.75{col 74}{space 3}     0.88
{txt}Primi#Intervention  {c |}{col 21}{res}{space 2}     0.73{col 33}{space 2}     0.04{col 44}{space 1}   16.89{col 53}{space 3} 0.00{col 61}{space 4}     0.64{col 74}{space 3}     0.81
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. 
. // Make figures
. do figures/imputation
{txt}
{com}. version 16.1
{txt}
{com}. 
. set graphics off
{txt}
{com}. 
. // Define the number of imputations to plot.
. local imputations_to_plot 5
{txt}
{com}. assert `imputations_to_plot' <= $m_imputations
{txt}
{com}. 
. // Make the plots.
. tempname this_frame
{txt}
{com}. frame copy imputed `this_frame'
{txt}
{com}. frame `this_frame' {c -(}
.   mi set M = `imputations_to_plot'
{txt}{p}
(passive variables
{res}__000000 __000001
{txt}unregistered because not in {it:m}=0)
{p_end}
(45 imputations dropped; {it:M} = 5)
{com}. 
.   // Generate a variable for each imputed variable that contains the original
.   // values (with the missing data), repeated for each imputed data set.
.   mi convert wide, clear
{res}{com}.   foreach var of varlist $imputeds y1-y5 y {c -(}
{txt}  2{com}.     generate `var'_orig = `var'
{txt}  3{com}.   {c )-}
{txt}(69 missing values generated)
(938 missing values generated)
(203 missing values generated)
(404 missing values generated)
(119 missing values generated)
(1,743 missing values generated)
(2,258 missing values generated)
(752 missing values generated)
(875 missing values generated)
(752 missing values generated)
(2,153 missing values generated)
{com}.   mi convert flong, clear
{res}{com}. 
.   // Create readable value labels for the imputations, and order them so that
.   // the original data will appear first in the plots.
.   generate imputation_str = ""
{txt}(38,202 missing values generated)
{com}.   replace imputation_str = "Original" if _mi_m == 0
{txt}variable {bf}imputation_str{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str8{sf}
{txt}(6,367 real changes made)
{com}.   replace imputation_str = "Imputation " + string(_mi_m) if _mi_m != 0
{txt}variable {bf}imputation_str{sf} was {bf}{res}str8{sf}{txt} now {bf}{res}str12{sf}
{txt}(31,835 real changes made)
{com}.   encode imputation_str, generate(imputation)
.   replace imputation = (`imputations_to_plot' + 1) - imputation
{txt}(31,835 real changes made)
{com}.   local label_var: value label imputation
.   label define `label_var' 0 "Original", modify
. 
.   // Plot the density of each of the continuous imputed variables.
.   local cont_imputed = ustrtrim(usubinstr("$imputeds", "primiparous", "", .))
.   foreach var of local cont_imputed {c -(}
{txt}  2{com}.     local pc_miss = string(${c -(}pc_miss_`var'{c )-}, "%8.1f") + "% missing"
{txt}  3{com}. 
.     local var_label : variable label `var'
{txt}  4{com}.     twoway (kdensity `var'_orig)                                   ///
>            (kdensity `var'),                                       ///
>            by(imputation arm, note("")                             ///
>               graphregion(color(white))                            ///
>               plotregion(color(white))                             ///
>               bgcolor(white))                                      ///
>            xtitle("`var_label' (`pc_miss')")                       ///
>            yscale(lcolor(white))                                   ///
>            subtitle(, bcolor(white) lcolor(white))                 ///
>            ylabel(none)                                            ///
>            legend(label(1 "Original") label(2 "Imputed")           ///
>                   region(color(white)))
{txt}  5{com}.     global `var'_plot_fname "products/Imputations - `var_label'"
{txt}  6{com}.     graph export "${c -(}`var'_plot_fname{c )-}.pdf", replace
{txt}  7{com}.     graph export "${c -(}`var'_plot_fname{c )-}.png", replace
{txt}  8{com}.   {c )-}
{res}{txt}(file products/Imputations - Age (years).pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Imputations - Age (years).png written in PNG format)
{res}{txt}(file products/Imputations - Body mass index.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Imputations - Body mass index.png written in PNG format)
{res}{txt}(file products/Imputations - Education (years).pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Imputations - Education (years).png written in PNG format)
{res}{txt}(file products/Imputations - Monthly household income (ILS; log scale).pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Imputations - Monthly household income (ILS; log scale).png written in PNG format)
{com}. 
.   // Plot the distribution of each of the dichotomous imputed variables.
.   foreach var of varlist y y1-y5 primiparous {c -(}
{txt}  2{com}.     local pc_miss = string(${c -(}pc_miss_`var'{c )-}, "%8.1f") + "% missing"
{txt}  3{com}.     local var_label : variable label `var'
{txt}  4{com}. 
.     splitvallabels imputation, recode
{txt}  5{com}.     graph hbar (count),                                             ///
>       over(`var', label(labsize(small)))                            ///
>       over(arm, label(labsize(small)))                              ///
>       over(imputation, label(labsize(small)) relabel(`r(relabel)')) ///
>       blabel(bar) intensity(25)                                     ///
>       ytitle("`var_label' (`pc_miss')") yscale(range(0 3500))       ///
>       legend(region(lcolor(white)))                                 ///
>       graphregion(color(white)) plotregion(color(white)) bgcolor(white)
{txt}  6{com}.     global `var'_plot_fname "products/Imputations - `var_label'"
{txt}  7{com}.     graph export "${c -(}`var'_plot_fname{c )-}.pdf", replace
{txt}  8{com}.     graph export "${c -(}`var'_plot_fname{c )-}.png", replace
{txt}  9{com}.   {c )-}
{res}{txt}(file products/Imputations - Adverse pregnancy outcome.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Imputations - Adverse pregnancy outcome.png written in PNG format)
{res}{txt}(file products/Imputations - Anemia at birth.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Imputations - Anemia at birth.png written in PNG format)
{res}{txt}(file products/Imputations - Severe hypertension at birth.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Imputations - Severe hypertension at birth.png written in PNG format)
{res}{txt}(file products/Imputations - SGA undetected at birth.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Imputations - SGA undetected at birth.png written in PNG format)
{res}{txt}(file products/Imputations - Malpresentation undetected at birth.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Imputations - Malpresentation undetected at birth.png written in PNG format)
{res}{txt}(file products/Imputations - Large for gestational age.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Imputations - Large for gestational age.png written in PNG format)
{res}{txt}(file products/Imputations - Parity.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Imputations - Parity.png written in PNG format)
{com}. {c )-}
{txt}
{com}. 
. set graphics on
{txt}
{com}. 
{txt}end of do-file

{com}. do figures/margins
{txt}
{com}. version 16.1
{txt}
{com}. 
. // TODO: Use different marker shapes and perhaps try to stagger things to avoid
. // overplotting.
. 
. set graphics off
{txt}
{com}. 
. // Define titles to use for the margins plots.
. local mpo "Marginal probability of"
{txt}
{com}. local attendance_margins_title      "`mpo' ANC attendance"
{txt}
{com}. local hypertension_margins_title    "`mpo' hypertension" "screening & management"
{txt}
{com}. local diabetes_margins_title        "`mpo' diabetes" "screening & management"
{txt}
{com}. local malpresentation_margins_title "`mpo' malpresentation" "screening & management"
{txt}
{com}. local anemia_margins_title          "`mpo' anemia" "screening & management"
{txt}
{com}. local fetalgrowth_margins_title     "`mpo' fetal growth" "screening & management"
{txt}
{com}. 
. // Define the names and number of variables over which to make marginsplots.
. local margin_vars = ustrtrim(usubinstr("$adj_var_names", "strat_var", "", .))
{txt}
{com}. local n_plots = wordcount("`margin_vars'")
{txt}
{com}. 
. // Define the ticks and labels used for the vertical axes of the left-most plot.
. local y_ticks 0 "0%" 0.2 "20%" 0.4 "40%" 0.6 "60%" 0.8 "80%" 1.0 "100%"
{txt}
{com}. 
. // Define the symbols for the arms.
. local symbols plot1opts(msymbol(D)) plot2opts(msymbol(O))
{txt}
{com}. 
. foreach outcome of global process_outcomes {c -(}
{txt}  2{com}.   frame `outcome' {c -(}
{txt}  3{com}.     foreach var of local margin_vars {c -(}
{txt}  4{com}.       // Cluster size will be plotted left-most, and will be given labels
.       // on the y axis. All others will use the following "blanked" labels.
.       local ylabel ylabel(0 " " 0.2 " " 0.4 " " 0.6 " " 0.8 " " 1.0 " ")
{txt}  5{com}.       local xscale fxsize(20)
{txt}  6{com}.       local ytitle ytitle("")
{txt}  7{com}.       
.       if "`var'" == "cluster_size" {c -(}
{txt}  8{com}.         local xscale          xscale(range(0 2.25)) 
{txt}  9{com}.         local xscale `xscale' xlabel(0.1 "10" 1 "100" 2 "200")
{txt} 10{com}.         local xscale `xscale' fxsize(30)
{txt} 11{com}.         local ylabel ylabel(`y_ticks', angle(horizontal))
{txt} 12{com}.         local ytitle ytitle("``outcome'_margins_title'")
{txt} 13{com}.       {c )-}
{txt} 14{com}.       if "`var'" == "age" {c -(}
{txt} 15{com}.         local xscale          xscale(range(10 50)) 
{txt} 16{com}.         local xscale `xscale' xlabel(15 25 35 45)
{txt} 17{com}.         local xscale `xscale' fxsize(30)
{txt} 18{com}.       {c )-}
{txt} 19{com}.       
.       // Restore the estimates for this (outcome, var) pair.
.       margin_name `outcome' `var'
{txt} 20{com}.       local estimates_name = r(estimates_name)
{txt} 21{com}.       estimates restore `estimates_name'
{txt} 22{com}. 
.       // Plot the margins.
.       local var_label : variable label `var'
{txt} 23{com}.       marginsplot, yscale(range(0 1)) `ylabel' `ytitle'   ///
>                   `xscale'                                ///
>                   legend(rows(1) region(color(white)))    ///
>                   title("")                               ///
>                   graphregion(color(white))               ///
>                   plotregion(color(white))                ///
>                   bgcolor(white)                          ///
>                   `symbols'                               ///
>                   name(`var', replace)
{txt} 24{com}.     {c )-}
{txt} 25{com}. 
.     // Combine and save the margins plots.
.     set scheme white_background // Hack to address thin lines around plot.
{txt} 26{com}.     grc1leg `margin_vars', cols(`n_plots')                        ///
>                            legendfrom(cluster_size)               ///
>                            graphregion(color(white) lwidth(none)) ///
>                            plotregion(color(white))
{txt} 27{com}.     global `outcome'_margins_fname "products/Margins - `outcome'"
{txt} 28{com}.     graph export "${c -(}`outcome'_margins_fname{c )-}.pdf", replace
{txt} 29{com}.     graph export "${c -(}`outcome'_margins_fname{c )-}.png", replace
{txt} 30{com}.   {c )-}
{txt} 31{com}. {c )-}
{res}{txt}(results {stata estimates replay margins_1:margins_1} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: cluster_size arm{p_end}
{res}{txt}(results {stata estimates replay margins_2:margins_2} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: age arm{p_end}
{res}{txt}(results {stata estimates replay margins_3:margins_3} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: lab_available arm{p_end}
{res}{txt}(results {stata estimates replay margins_4:margins_4} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: primiparous arm{p_end}
{res}{txt}(file products/Margins - attendance.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Margins - attendance.png written in PNG format)
{res}{txt}(results {stata estimates replay margins_5:margins_5} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: cluster_size arm{p_end}
{res}{txt}(results {stata estimates replay margins_6:margins_6} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: age arm{p_end}
{res}{txt}(results {stata estimates replay margins_7:margins_7} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: lab_available arm{p_end}
{res}{txt}(results {stata estimates replay margins_8:margins_8} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: primiparous arm{p_end}
{res}{txt}(file products/Margins - hypertension.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Margins - hypertension.png written in PNG format)
{res}{txt}(results {stata estimates replay margins_9:margins_9} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: cluster_size arm{p_end}
{res}{txt}(results {stata estimates replay margins_10:margins_10} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: age arm{p_end}
{res}{txt}(results {stata estimates replay margins_11:margins_11} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: lab_available arm{p_end}
{res}{txt}(results {stata estimates replay margins_12:margins_12} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: primiparous arm{p_end}
{res}{txt}(file products/Margins - diabetes.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Margins - diabetes.png written in PNG format)
{res}{txt}(results {stata estimates replay margins_13:margins_13} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: cluster_size arm{p_end}
{res}{txt}(results {stata estimates replay margins_14:margins_14} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: age arm{p_end}
{res}{txt}(results {stata estimates replay margins_15:margins_15} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: lab_available arm{p_end}
{res}{txt}(results {stata estimates replay margins_16:margins_16} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: primiparous arm{p_end}
{res}{txt}(file products/Margins - malpresentation.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Margins - malpresentation.png written in PNG format)
{res}{txt}(results {stata estimates replay margins_17:margins_17} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: cluster_size arm{p_end}
{res}{txt}(results {stata estimates replay margins_18:margins_18} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: age arm{p_end}
{res}{txt}(results {stata estimates replay margins_19:margins_19} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: lab_available arm{p_end}
{res}{txt}(results {stata estimates replay margins_20:margins_20} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: primiparous arm{p_end}
{res}{txt}(file products/Margins - anemia.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Margins - anemia.png written in PNG format)
{res}{txt}(results {stata estimates replay margins_21:margins_21} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: cluster_size arm{p_end}
{res}{txt}(results {stata estimates replay margins_22:margins_22} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: age arm{p_end}
{res}{txt}(results {stata estimates replay margins_23:margins_23} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: lab_available arm{p_end}
{res}{txt}(results {stata estimates replay margins_24:margins_24} are active now)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: primiparous arm{p_end}
{res}{txt}(file products/Margins - fetalgrowth.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.eRegQual.2020/products/Margins - fetalgrowth.png written in PNG format)

{com}. 
. set graphics on
{txt}
{com}. 
{txt}end of do-file

{com}. 
. // Obtain the git revision hash, which is used in the reports.
. tempfile git_revision_filename
{txt}
{com}. tempname revision_file
{txt}
{com}. shell git rev-parse --short HEAD > "`git_revision_filename'"
{txt}

{com}. file open `revision_file' using `git_revision_filename', read text
{txt}
{com}. file read `revision_file' line
{txt}
{com}. global git_revision = "`macval(line)'"
{txt}
{com}. 
. // Make the report
. do reports/report products/report.docx
{txt}
{com}. version 16.1
{txt}
{com}. 
. args filename
{txt}
{com}. 
. // Some locals to make this file a little more readable.
. local heading putdocx paragraph, style(Heading1)
{txt}
{com}. local subhead putdocx paragraph, style(Heading2)
{txt}
{com}. local newpara putdocx textblock begin, halign(both)
{txt}
{com}. local putdocx textblock end putdocx textblock end
{txt}
{com}. 
. local p_fmt  %5.2f // Format used for P-values.
{txt}
{com}. local e_fmt  %5.2f // Format used for estimates.
{txt}
{com}. local pc_fmt %8.1f // Format used for percentages.
{txt}
{com}. 
. local tbl_num = 0  // A table counter.
{txt}
{com}. 
. // Start the document.
. putdocx begin
{res}{txt}
{com}. 
. // Title.
. putdocx paragraph, style(Title)
{res}{txt}
{com}. putdocx text ("eRegQual analysis")
{res}{txt}
{com}. 
. // Author and revision information.
. `newpara'
{res}{txt}
{com}. `newpara'
{res}{txt}
{com}. 
. // Introduction section.
. `heading'
{res}{txt}
{com}. putdocx text ("Introduction")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. // Methods section
. `heading'
{res}{txt}
{com}. putdocx text ("Methods")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. // Results section
. `heading'
{res}{txt}
{com}. putdocx text ("Results")
{res}{txt}
{com}. 
. `subhead'
{res}{txt}
{com}. putdocx text ("Adverse pregnancy outcomes")
{res}{txt}
{com}. 
. // Verify some assumptions in this section.
. assert ${c -(}p_mcar{c )-} > 0.05
{txt}
{com}. assert ${c -(}p_cdm{c )-}  > 0.05
{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. frame imputed {c -(}
.   foreach var of varlist y y1-y5 {c -(}
{txt}  2{com}.     local ++tbl_num
{txt}  3{com}.     local var_label : variable label `var'
{txt}  4{com}.     local title "Table `tbl_num'. `var_label' (multiply-imputed result)"
{txt}  5{com}.     estimates replay `var'_estimates, eform
{txt}  6{com}.     putdocx table tbl_`tbl_num' = etable, title("`title'")
{txt}  7{com}.     putdocx table tbl_`tbl_num'(2, 1) = (" ") // Remove outcome var name.
{txt}  8{com}.     putdocx table tbl_`tbl_num'(2, 2) = ("Odds Ratio"), halign(right)
{txt}  9{com}.     local n_rows  23
{txt} 10{com}.     local n_start 5
{txt} 11{com}.     if "`var'" == "y2" local n_rows  16
{txt} 12{com}.     if "`var'" == "y2" local n_start 5
{txt} 13{com}.     forvalues i = `n_rows'(-1)`n_start' {c -(} // Drop rows not of interest.
{txt} 14{com}.       putdocx table tbl_`tbl_num'(`i', .), drop
{txt} 15{com}.     {c )-}
{txt} 16{com}.   {c )-}

{txt}{hline}
{p 0 8}Model {hi:y_estimates}{p_end}
{hline}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable: {res:clusterid}{col 49}Number of groups{col 67}= {res}       119
{txt}Random effects u_i ~ {res:Gaussian}{col 49}Obs per group:
{col 49}              min{col 67}= {res}         9
{txt}Integration points = {res:12}{col 49}              avg{col 67}= {res}      53.5
{txt}{col 49}              max{col 67}= {res}       217
{txt}{col 49}Average RVI{col 67}= {res}    0.1744
{txt}{col 49}Largest FMI{col 67}= {res}    0.2199
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1,027.37
{txt}{col 49}        avg{col 67}= {res}  2,919.48
{txt}{col 49}        max{col 67}= {res} 13,007.76
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}17674.9{txt}){col 67}= {res}      3.91
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |}     exp(b){col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     0.99{col 27}{space 2}     0.06{col 38}{space 1}   -0.15{col 47}{space 3} 0.88{col 55}{space 4}     0.87{col 68}{space 3}     1.12
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.18{col 27}{space 2}     0.13{col 38}{space 1}    1.47{col 47}{space 3} 0.14{col 55}{space 4}     0.95{col 68}{space 3}     1.47
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.92{col 27}{space 2}     0.13{col 38}{space 1}   -0.59{col 47}{space 3} 0.55{col 55}{space 4}     0.69{col 68}{space 3}     1.22
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.06{col 27}{space 2}     0.12{col 38}{space 1}    0.54{col 47}{space 3} 0.59{col 55}{space 4}     0.85{col 68}{space 3}     1.34
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.21{col 27}{space 2}     0.13{col 38}{space 1}    1.73{col 47}{space 3} 0.08{col 55}{space 4}     0.98{col 68}{space 3}     1.50
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.87{col 27}{space 2}     0.07{col 38}{space 1}   -1.71{col 47}{space 3} 0.09{col 55}{space 4}     0.75{col 68}{space 3}     1.02
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.03{col 27}{space 2}     0.01{col 38}{space 1}    4.69{col 47}{space 3} 0.00{col 55}{space 4}     1.02{col 68}{space 3}     1.04
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.12{col 27}{space 2}     0.09{col 38}{space 1}    1.50{col 47}{space 3} 0.13{col 55}{space 4}     0.97{col 68}{space 3}     1.30
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.05{col 27}{space 2}     0.09{col 38}{space 1}    0.61{col 47}{space 3} 0.55{col 55}{space 4}     0.89{col 68}{space 3}     1.24
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.15{col 27}{space 2}     0.03{col 38}{space 1}   -9.26{col 47}{space 3} 0.00{col 55}{space 4}     0.10{col 68}{space 3}     0.22
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -9.32{col 27}{space 2}    11.10{col 55}{space 4}   -31.09{col 68}{space 3}    12.44
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.01{col 27}{space 2}     0.05{col 55}{space 4}     0.00{col 68}{space 3}   501.73
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:y1_estimates}{p_end}
{hline}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable: {res:clusterid}{col 49}Number of groups{col 67}= {res}       119
{txt}Random effects u_i ~ {res:Gaussian}{col 49}Obs per group:
{col 49}              min{col 67}= {res}         9
{txt}Integration points = {res:12}{col 49}              avg{col 67}= {res}      53.5
{txt}{col 49}              max{col 67}= {res}       217
{txt}{col 49}Average RVI{col 67}= {res}    0.3548
{txt}{col 49}Largest FMI{col 67}= {res}    0.3678
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}    369.01
{txt}{col 49}        avg{col 67}= {res}  1,239.33
{txt}{col 49}        max{col 67}= {res}  7,228.29
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res} 5568.4{txt}){col 67}= {res}      1.21
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.2849

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y1{col 15}{c |}     exp(b){col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     0.82{col 27}{space 2}     0.20{col 38}{space 1}   -0.83{col 47}{space 3} 0.41{col 55}{space 4}     0.51{col 68}{space 3}     1.31
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.51{col 27}{space 2}     0.69{col 38}{space 1}    0.90{col 47}{space 3} 0.37{col 55}{space 4}     0.62{col 68}{space 3}     3.69
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     1.20{col 27}{space 2}     0.67{col 38}{space 1}    0.33{col 47}{space 3} 0.74{col 55}{space 4}     0.41{col 68}{space 3}     3.57
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.54{col 27}{space 2}     0.66{col 38}{space 1}    1.00{col 47}{space 3} 0.32{col 55}{space 4}     0.66{col 68}{space 3}     3.56
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.69{col 27}{space 2}     0.72{col 38}{space 1}    1.24{col 47}{space 3} 0.22{col 55}{space 4}     0.74{col 68}{space 3}     3.91
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.62{col 27}{space 2}     0.20{col 38}{space 1}   -1.51{col 47}{space 3} 0.13{col 55}{space 4}     0.33{col 68}{space 3}     1.15
{txt}{space 10}age {c |}{col 15}{res}{space 2}     0.96{col 27}{space 2}     0.02{col 38}{space 1}   -1.80{col 47}{space 3} 0.07{col 55}{space 4}     0.91{col 68}{space 3}     1.00
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.42{col 27}{space 2}     0.39{col 38}{space 1}    1.29{col 47}{space 3} 0.20{col 55}{space 4}     0.83{col 68}{space 3}     2.43
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     0.50{col 27}{space 2}     0.18{col 38}{space 1}   -1.95{col 47}{space 3} 0.05{col 55}{space 4}     0.25{col 68}{space 3}     1.01
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.05{col 27}{space 2}     0.04{col 38}{space 1}   -3.73{col 47}{space 3} 0.00{col 55}{space 4}     0.01{col 68}{space 3}     0.25
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -5.58{col 27}{space 2}    14.69{col 55}{space 4}   -34.38{col 68}{space 3}    23.23
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.06{col 27}{space 2}     0.45{col 55}{space 4}     0.00{col 68}{space 3}110504.95
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.02{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:y2_estimates}{p_end}
{hline}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable: {res:clusterid}{col 49}Number of groups{col 67}= {res}       119
{txt}Random effects u_i ~ {res:Gaussian}{col 49}Obs per group:
{col 49}              min{col 67}= {res}         9
{txt}Integration points = {res:12}{col 49}              avg{col 67}= {res}      53.5
{txt}{col 49}              max{col 67}= {res}       217
{txt}{col 49}Average RVI{col 67}= {res}    0.6376
{txt}{col 49}Largest FMI{col 67}= {res}    0.5243
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}    181.87
{txt}{col 49}        avg{col 67}= {res}435,181.00
{txt}{col 49}        max{col 67}= {res}3044654.56
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   5{txt},{res} 1241.9{txt}){col 67}= {res}      5.89
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y2{col 15}{c |}     exp(b){col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     0.61{col 27}{space 2}     0.25{col 38}{space 1}   -1.21{col 47}{space 3} 0.23{col 55}{space 4}     0.27{col 68}{space 3}     1.36
{txt}{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.79{col 27}{space 2}     0.41{col 38}{space 1}   -0.44{col 47}{space 3} 0.66{col 55}{space 4}     0.29{col 68}{space 3}     2.20
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.19{col 27}{space 2}     0.04{col 38}{space 1}    4.80{col 47}{space 3} 0.00{col 55}{space 4}     1.11{col 68}{space 3}     1.28
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.93{col 27}{space 2}     0.41{col 38}{space 1}   -0.17{col 47}{space 3} 0.86{col 55}{space 4}     0.39{col 68}{space 3}     2.22
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     4.90{col 27}{space 2}     2.48{col 38}{space 1}    3.14{col 47}{space 3} 0.00{col 55}{space 4}     1.81{col 68}{space 3}    13.26
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 38}{space 1}   -7.94{col 47}{space 3} 0.00{col 55}{space 4}     0.00{col 68}{space 3}     0.00
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -5.22{col 27}{space 2}    70.80{col 55}{space 4}  -143.98{col 68}{space 3}   133.53
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.07{col 27}{space 2}     2.60{col 55}{space 4}     0.00{col 68}{space 3} 9.92e+28
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.12{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:y3_estimates}{p_end}
{hline}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable: {res:clusterid}{col 49}Number of groups{col 67}= {res}       119
{txt}Random effects u_i ~ {res:Gaussian}{col 49}Obs per group:
{col 49}              min{col 67}= {res}         9
{txt}Integration points = {res:12}{col 49}              avg{col 67}= {res}      53.5
{txt}{col 49}              max{col 67}= {res}       217
{txt}{col 49}Average RVI{col 67}= {res}    0.1141
{txt}{col 49}Largest FMI{col 67}= {res}    0.1792
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1,543.64
{txt}{col 49}        avg{col 67}= {res}  4,313.44
{txt}{col 49}        max{col 67}= {res}  6,433.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}39016.5{txt}){col 67}= {res}      3.25
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0006

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y3{col 15}{c |}     exp(b){col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.00{col 27}{space 2}     0.11{col 38}{space 1}    0.00{col 47}{space 3} 1.00{col 55}{space 4}     0.81{col 68}{space 3}     1.24
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.95{col 27}{space 2}     0.18{col 38}{space 1}   -0.30{col 47}{space 3} 0.77{col 55}{space 4}     0.65{col 68}{space 3}     1.37
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.65{col 27}{space 2}     0.17{col 38}{space 1}   -1.65{col 47}{space 3} 0.10{col 55}{space 4}     0.39{col 68}{space 3}     1.09
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.95{col 27}{space 2}     0.18{col 38}{space 1}   -0.25{col 47}{space 3} 0.80{col 55}{space 4}     0.66{col 68}{space 3}     1.38
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.01{col 27}{space 2}     0.19{col 38}{space 1}    0.05{col 47}{space 3} 0.96{col 55}{space 4}     0.70{col 68}{space 3}     1.45
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.88{col 27}{space 2}     0.13{col 38}{space 1}   -0.87{col 47}{space 3} 0.38{col 55}{space 4}     0.66{col 68}{space 3}     1.18
{txt}{space 10}age {c |}{col 15}{res}{space 2}     0.97{col 27}{space 2}     0.01{col 38}{space 1}   -2.64{col 47}{space 3} 0.01{col 55}{space 4}     0.95{col 68}{space 3}     0.99
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.26{col 27}{space 2}     0.16{col 38}{space 1}    1.75{col 47}{space 3} 0.08{col 55}{space 4}     0.97{col 68}{space 3}     1.62
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.34{col 27}{space 2}     0.16{col 38}{space 1}    2.39{col 47}{space 3} 0.02{col 55}{space 4}     1.05{col 68}{space 3}     1.71
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.17{col 27}{space 2}     0.06{col 38}{space 1}   -5.21{col 47}{space 3} 0.00{col 55}{space 4}     0.08{col 68}{space 3}     0.33
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -3.04{col 27}{space 2}     0.74{col 55}{space 4}    -4.50{col 68}{space 3}    -1.59
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.22{col 27}{space 2}     0.08{col 55}{space 4}     0.11{col 68}{space 3}     0.45
{txt}          rho {c |}{col 15}{res}{space 2}     0.01{col 27}{space 2}     0.01{col 55}{space 4}     0.00{col 68}{space 3}     0.06
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:y4_estimates}{p_end}
{hline}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable: {res:clusterid}{col 49}Number of groups{col 67}= {res}       119
{txt}Random effects u_i ~ {res:Gaussian}{col 49}Obs per group:
{col 49}              min{col 67}= {res}         9
{txt}Integration points = {res:12}{col 49}              avg{col 67}= {res}      53.5
{txt}{col 49}              max{col 67}= {res}       217
{txt}{col 49}Average RVI{col 67}= {res}    0.1584
{txt}{col 49}Largest FMI{col 67}= {res}    0.1953
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1,301.14
{txt}{col 49}        avg{col 67}= {res}  3,218.72
{txt}{col 49}        max{col 67}= {res} 12,835.65
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}20776.0{txt}){col 67}= {res}      3.35
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0004

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y4{col 15}{c |}     exp(b){col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     0.93{col 27}{space 2}     0.15{col 38}{space 1}   -0.44{col 47}{space 3} 0.66{col 55}{space 4}     0.68{col 68}{space 3}     1.27
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.23{col 27}{space 2}     0.39{col 38}{space 1}    0.67{col 47}{space 3} 0.51{col 55}{space 4}     0.66{col 68}{space 3}     2.29
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.76{col 27}{space 2}     0.36{col 38}{space 1}   -0.57{col 47}{space 3} 0.57{col 55}{space 4}     0.31{col 68}{space 3}     1.91
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.70{col 27}{space 2}     0.51{col 38}{space 1}    1.79{col 47}{space 3} 0.07{col 55}{space 4}     0.95{col 68}{space 3}     3.05
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.49{col 27}{space 2}     0.45{col 38}{space 1}    1.32{col 47}{space 3} 0.19{col 55}{space 4}     0.82{col 68}{space 3}     2.71
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.67{col 27}{space 2}     0.15{col 38}{space 1}   -1.80{col 47}{space 3} 0.07{col 55}{space 4}     0.43{col 68}{space 3}     1.04
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.05{col 27}{space 2}     0.02{col 38}{space 1}    3.26{col 47}{space 3} 0.00{col 55}{space 4}     1.02{col 68}{space 3}     1.08
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.98{col 27}{space 2}     0.19{col 38}{space 1}   -0.12{col 47}{space 3} 0.91{col 55}{space 4}     0.67{col 68}{space 3}     1.43
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.90{col 27}{space 2}     0.36{col 38}{space 1}    3.37{col 47}{space 3} 0.00{col 55}{space 4}     1.31{col 68}{space 3}     2.75
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.01{col 27}{space 2}     0.00{col 38}{space 1}   -9.26{col 47}{space 3} 0.00{col 55}{space 4}     0.00{col 68}{space 3}     0.02
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -6.96{col 27}{space 2}    16.65{col 55}{space 4}   -39.60{col 68}{space 3}    25.67
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.03{col 27}{space 2}     0.26{col 55}{space 4}     0.00{col 68}{space 3}375349.91
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:y5_estimates}{p_end}
{hline}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable: {res:clusterid}{col 49}Number of groups{col 67}= {res}       119
{txt}Random effects u_i ~ {res:Gaussian}{col 49}Obs per group:
{col 49}              min{col 67}= {res}         9
{txt}Integration points = {res:12}{col 49}              avg{col 67}= {res}      53.5
{txt}{col 49}              max{col 67}= {res}       217
{txt}{col 49}Average RVI{col 67}= {res}    0.1262
{txt}{col 49}Largest FMI{col 67}= {res}    0.1744
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1,630.26
{txt}{col 49}        avg{col 67}= {res}  3,551.43
{txt}{col 49}        max{col 67}= {res}  7,235.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}31113.5{txt}){col 67}= {res}      9.38
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y5{col 15}{c |}     exp(b){col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.06{col 27}{space 2}     0.09{col 38}{space 1}    0.73{col 47}{space 3} 0.46{col 55}{space 4}     0.90{col 68}{space 3}     1.25
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.21{col 27}{space 2}     0.18{col 38}{space 1}    1.31{col 47}{space 3} 0.19{col 55}{space 4}     0.91{col 68}{space 3}     1.61
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     1.13{col 27}{space 2}     0.21{col 38}{space 1}    0.67{col 47}{space 3} 0.51{col 55}{space 4}     0.79{col 68}{space 3}     1.63
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.96{col 27}{space 2}     0.15{col 38}{space 1}   -0.24{col 47}{space 3} 0.81{col 55}{space 4}     0.71{col 68}{space 3}     1.30
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.15{col 27}{space 2}     0.17{col 38}{space 1}    0.93{col 47}{space 3} 0.35{col 55}{space 4}     0.86{col 68}{space 3}     1.53
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.97{col 27}{space 2}     0.10{col 38}{space 1}   -0.32{col 47}{space 3} 0.75{col 55}{space 4}     0.79{col 68}{space 3}     1.18
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.05{col 27}{space 2}     0.01{col 38}{space 1}    6.61{col 47}{space 3} 0.00{col 55}{space 4}     1.03{col 68}{space 3}     1.06
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.02{col 27}{space 2}     0.10{col 38}{space 1}    0.21{col 47}{space 3} 0.83{col 55}{space 4}     0.84{col 68}{space 3}     1.24
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     0.68{col 27}{space 2}     0.08{col 38}{space 1}   -3.19{col 47}{space 3} 0.00{col 55}{space 4}     0.54{col 68}{space 3}     0.86
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.04{col 27}{space 2}     0.01{col 38}{space 1}  -12.62{col 47}{space 3} 0.00{col 55}{space 4}     0.02{col 68}{space 3}     0.06
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -6.34{col 27}{space 2}    10.25{col 55}{space 4}   -26.44{col 68}{space 3}    13.75
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.04{col 27}{space 2}     0.22{col 55}{space 4}     0.00{col 68}{space 3}   969.76
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.01{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{res}{com}. {c )-}
{txt}
{com}. 
. tempname original
{txt}
{com}. frame copy imputed `original'
{txt}
{com}. frame `original' {c -(}
.   mi extract 0, clear
.   xtset clusterid
{txt}{col 8}panel variable:  {res}clusterid (unbalanced)
{com}.   local var stillbirth
. 
.   local ++tbl_num
.   local var_label : variable label `var'
.   local title "Table `tbl_num'. `var_label' (complete case result)"
.   estimates replay `var'_estimates, or

{txt}{hline}
{p 0 8}Model {hi:stillbirth_estimates}{p_end}
{hline}

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     5,919
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       119

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         7
{txt}{col 63}avg{col 67}={col 69}{res}      49.7
{txt}{col 63}max{col 67}={col 69}{res}       216

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}     7.91
{txt}Log likelihood  = {res}-245.81337{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.5434

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   stillbirth{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.07{col 27}{space 2}     0.34{col 38}{space 1}    0.22{col 47}{space 3} 0.83{col 55}{space 4}     0.57{col 68}{space 3}     2.00
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.39{col 27}{space 2}     0.19{col 38}{space 1}   -1.94{col 47}{space 3} 0.05{col 55}{space 4}     0.15{col 68}{space 3}     1.01
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.61{col 27}{space 2}     0.38{col 38}{space 1}   -0.80{col 47}{space 3} 0.42{col 55}{space 4}     0.18{col 68}{space 3}     2.05
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.30{col 27}{space 2}     0.16{col 38}{space 1}   -2.25{col 47}{space 3} 0.02{col 55}{space 4}     0.11{col 68}{space 3}     0.86
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.42{col 27}{space 2}     0.20{col 38}{space 1}   -1.84{col 47}{space 3} 0.07{col 55}{space 4}     0.17{col 68}{space 3}     1.06
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.82{col 27}{space 2}     0.34{col 38}{space 1}   -0.47{col 47}{space 3} 0.64{col 55}{space 4}     0.37{col 68}{space 3}     1.85
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.03{col 27}{space 2}     0.03{col 38}{space 1}    0.94{col 47}{space 3} 0.35{col 55}{space 4}     0.97{col 68}{space 3}     1.09
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.81{col 27}{space 2}     0.32{col 38}{space 1}   -0.55{col 47}{space 3} 0.58{col 55}{space 4}     0.38{col 68}{space 3}     1.74
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.13{col 27}{space 2}     0.47{col 38}{space 1}    0.29{col 47}{space 3} 0.78{col 55}{space 4}     0.50{col 68}{space 3}     2.55
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.01{col 27}{space 2}     0.01{col 38}{space 1}   -4.94{col 47}{space 3} 0.00{col 55}{space 4}     0.00{col 68}{space 3}     0.06
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -2.62{col 27}{space 2}     5.39{col 55}{space 4}   -13.18{col 68}{space 3}     7.94
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.27{col 27}{space 2}     0.73{col 55}{space 4}     0.00{col 68}{space 3}    52.88
{txt}          rho {c |}{col 15}{res}{space 2}     0.02{col 27}{space 2}     0.11{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}0.04{col 56}{txt}Prob >= chibar2 = {res}0.425
{com}.   putdocx table tbl_`tbl_num' = etable, title("`title'")
{res}{com}.   putdocx table tbl_`tbl_num'(2, 1) = (" ") // Remove outcome var name.
{res}{com}.   putdocx table tbl_`tbl_num'(2, 2) = ("Odds Ratio"), halign(right)
{res}{com}.   local n_rows  23
.   local n_start 5
.   forvalues i = `n_rows'(-1)`n_start' {c -(} // Drop rows not of interest.
{txt}  2{com}.     putdocx table tbl_`tbl_num'(`i', .), drop
{txt}  3{com}.   {c )-}
{res}{com}. {c )-}
{txt}
{com}. 
. `subhead'
{res}{txt}
{com}. putdocx text ("Process outcomes — tables")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. foreach outcome of global process_outcomes {c -(}
{txt}  2{com}.   frame `outcome' {c -(}
{txt}  3{com}.     local ++tbl_num  
{txt}  4{com}.     local var_label : variable label y
{txt}  5{com}.     local title "Table `tbl_num'. `var_label' screening & management"
{txt}  6{com}.     estimates replay `outcome'_estimates, or
{txt}  7{com}.     putdocx table tbl_`tbl_num' = etable, title("`title'")
{txt}  8{com}.     putdocx table tbl_`tbl_num'(2, 1) = (" ") // Remove outcome var name.
{txt}  9{com}.     putdocx table tbl_`tbl_num'(2, 2) = ("Odds Ratio"), halign(right)
{txt} 10{com}.     putdocx table tbl_`tbl_num'(3, 2) = (""), halign(right) // Was "Coef."
{txt} 11{com}.     local n_rows  24
{txt} 12{com}.     local n_start 6
{txt} 13{com}.     if "`outcome'" == "malpresentation" local n_rows  23
{txt} 14{com}.     if "`outcome'" == "malpresentation" local n_start 5
{txt} 15{com}.     forvalues i = `n_rows'(-1)`n_start' {c -(} // Drop rows not of interest.
{txt} 16{com}.       putdocx table tbl_`tbl_num'(`i', .), drop
{txt} 17{com}.     {c )-}
{txt} 18{com}.   {c )-}
{txt} 19{com}. {c )-}

{txt}{hline}
{p 0 8}Model {hi:attendance_estimates}{p_end}
{hline}

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    21,430
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     5,139

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       4.2
{txt}{col 63}max{col 67}={col 69}{res}         5

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    80.39
{txt}Log pseudolikelihood  = {res}-13537.058{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 79:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     0.85{col 27}{space 2}     0.10{col 38}{space 1}   -1.47{col 47}{space 3} 0.14{col 55}{space 4}     0.68{col 68}{space 3}     1.06
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.58{col 27}{space 2}     0.11{col 38}{space 1}   -2.98{col 47}{space 3} 0.00{col 55}{space 4}     0.40{col 68}{space 3}     0.83
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     1.38{col 27}{space 2}     0.26{col 38}{space 1}    1.69{col 47}{space 3} 0.09{col 55}{space 4}     0.95{col 68}{space 3}     2.00
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.22{col 27}{space 2}     0.21{col 38}{space 1}    1.15{col 47}{space 3} 0.25{col 55}{space 4}     0.87{col 68}{space 3}     1.71
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.75{col 27}{space 2}     0.31{col 38}{space 1}    3.16{col 47}{space 3} 0.00{col 55}{space 4}     1.24{col 68}{space 3}     2.47
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     1.53{col 27}{space 2}     0.21{col 38}{space 1}    3.17{col 47}{space 3} 0.00{col 55}{space 4}     1.18{col 68}{space 3}     2.00
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.01{col 27}{space 2}     0.01{col 38}{space 1}    1.39{col 47}{space 3} 0.16{col 55}{space 4}     1.00{col 68}{space 3}     1.02
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.99{col 27}{space 2}     0.12{col 38}{space 1}   -0.07{col 47}{space 3} 0.95{col 55}{space 4}     0.78{col 68}{space 3}     1.27
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.01{col 27}{space 2}     0.07{col 38}{space 1}    0.13{col 47}{space 3} 0.89{col 55}{space 4}     0.89{col 68}{space 3}     1.15
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.40{col 27}{space 2}     0.10{col 38}{space 1}   -3.76{col 47}{space 3} 0.00{col 55}{space 4}     0.25{col 68}{space 3}     0.64
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}     0.60{col 27}{space 2}     0.08{col 55}{space 4}     0.44{col 68}{space 3}     0.76
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     1.35{col 27}{space 2}     0.05{col 55}{space 4}     1.25{col 68}{space 3}     1.46
{txt}          rho {c |}{col 15}{res}{space 2}     0.36{col 27}{space 2}     0.02{col 55}{space 4}     0.32{col 68}{space 3}     0.39
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:hypertension_estimates}{p_end}
{hline}

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    15,383
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     5,946

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       2.6
{txt}{col 63}max{col 67}={col 69}{res}         6

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    52.00
{txt}Log pseudolikelihood  = {res}-2693.7964{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 79:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.62{col 27}{space 2}     0.19{col 38}{space 1}    4.07{col 47}{space 3} 0.00{col 55}{space 4}     1.29{col 68}{space 3}     2.05
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.18{col 27}{space 2}     0.24{col 38}{space 1}    0.83{col 47}{space 3} 0.41{col 55}{space 4}     0.79{col 68}{space 3}     1.77
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     1.51{col 27}{space 2}     0.26{col 38}{space 1}    2.37{col 47}{space 3} 0.02{col 55}{space 4}     1.07{col 68}{space 3}     2.12
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.28{col 27}{space 2}     0.24{col 38}{space 1}    1.33{col 47}{space 3} 0.18{col 55}{space 4}     0.89{col 68}{space 3}     1.85
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.78{col 27}{space 2}     0.32{col 38}{space 1}    3.24{col 47}{space 3} 0.00{col 55}{space 4}     1.26{col 68}{space 3}     2.53
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.93{col 27}{space 2}     0.10{col 38}{space 1}   -0.65{col 47}{space 3} 0.51{col 55}{space 4}     0.75{col 68}{space 3}     1.15
{txt}{space 10}age {c |}{col 15}{res}{space 2}     0.98{col 27}{space 2}     0.01{col 38}{space 1}   -2.25{col 47}{space 3} 0.02{col 55}{space 4}     0.96{col 68}{space 3}     1.00
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.16{col 27}{space 2}     0.15{col 38}{space 1}    1.14{col 47}{space 3} 0.25{col 55}{space 4}     0.90{col 68}{space 3}     1.49
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     0.93{col 27}{space 2}     0.10{col 38}{space 1}   -0.67{col 47}{space 3} 0.50{col 55}{space 4}     0.74{col 68}{space 3}     1.16
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}    32.99{col 27}{space 2}     9.50{col 38}{space 1}   12.14{col 47}{space 3} 0.00{col 55}{space 4}    18.76{col 68}{space 3}    58.02
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -0.13{col 27}{space 2}     0.25{col 55}{space 4}    -0.61{col 68}{space 3}     0.36
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.94{col 27}{space 2}     0.12{col 55}{space 4}     0.74{col 68}{space 3}     1.20
{txt}          rho {c |}{col 15}{res}{space 2}     0.21{col 27}{space 2}     0.04{col 55}{space 4}     0.14{col 68}{space 3}     0.30
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:diabetes_estimates}{p_end}
{hline}

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    11,994
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     6,298

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       1.9
{txt}{col 63}max{col 67}={col 69}{res}         3

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    84.28
{txt}Log pseudolikelihood  = {res}-5870.0949{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 79:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.45{col 27}{space 2}     0.17{col 38}{space 1}    3.08{col 47}{space 3} 0.00{col 55}{space 4}     1.14{col 68}{space 3}     1.83
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.68{col 27}{space 2}     0.12{col 38}{space 1}   -2.10{col 47}{space 3} 0.04{col 55}{space 4}     0.48{col 68}{space 3}     0.97
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.58{col 27}{space 2}     0.13{col 38}{space 1}   -2.42{col 47}{space 3} 0.02{col 55}{space 4}     0.37{col 68}{space 3}     0.90
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.50{col 27}{space 2}     0.10{col 38}{space 1}   -3.30{col 47}{space 3} 0.00{col 55}{space 4}     0.33{col 68}{space 3}     0.76
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.72{col 27}{space 2}     0.11{col 38}{space 1}   -2.10{col 47}{space 3} 0.04{col 55}{space 4}     0.53{col 68}{space 3}     0.98
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     1.39{col 27}{space 2}     0.20{col 38}{space 1}    2.29{col 47}{space 3} 0.02{col 55}{space 4}     1.05{col 68}{space 3}     1.85
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.01{col 27}{space 2}     0.00{col 38}{space 1}    2.26{col 47}{space 3} 0.02{col 55}{space 4}     1.00{col 68}{space 3}     1.02
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.98{col 27}{space 2}     0.29{col 38}{space 1}    4.60{col 47}{space 3} 0.00{col 55}{space 4}     1.48{col 68}{space 3}     2.65
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.11{col 27}{space 2}     0.05{col 38}{space 1}    2.16{col 47}{space 3} 0.03{col 55}{space 4}     1.01{col 68}{space 3}     1.22
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.12{col 27}{space 2}     0.02{col 38}{space 1}  -10.86{col 47}{space 3} 0.00{col 55}{space 4}     0.08{col 68}{space 3}     0.17
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}   -13.38{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:malpresentation_estimates}{p_end}
{hline}

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     1,919
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       116

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}      16.5
{txt}{col 63}max{col 67}={col 69}{res}       113

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    31.83
{txt}Log likelihood  = {res}-898.13663{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0002

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.42{col 27}{space 2}     0.31{col 38}{space 1}    1.57{col 47}{space 3} 0.12{col 55}{space 4}     0.92{col 68}{space 3}     2.19
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.42{col 27}{space 2}     0.56{col 38}{space 1}    0.88{col 47}{space 3} 0.38{col 55}{space 4}     0.65{col 68}{space 3}     3.07
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     3.55{col 27}{space 2}     1.86{col 38}{space 1}    2.43{col 47}{space 3} 0.02{col 55}{space 4}     1.28{col 68}{space 3}     9.89
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.27{col 27}{space 2}     0.46{col 38}{space 1}    0.67{col 47}{space 3} 0.51{col 55}{space 4}     0.63{col 68}{space 3}     2.60
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.74{col 27}{space 2}     0.65{col 38}{space 1}    1.49{col 47}{space 3} 0.14{col 55}{space 4}     0.84{col 68}{space 3}     3.61
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     2.50{col 27}{space 2}     0.85{col 38}{space 1}    2.70{col 47}{space 3} 0.01{col 55}{space 4}     1.28{col 68}{space 3}     4.86
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.00{col 27}{space 2}     0.01{col 38}{space 1}    0.10{col 47}{space 3} 0.92{col 55}{space 4}     0.98{col 68}{space 3}     1.03
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.56{col 27}{space 2}     0.41{col 38}{space 1}    1.71{col 47}{space 3} 0.09{col 55}{space 4}     0.94{col 68}{space 3}     2.61
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.48{col 27}{space 2}     0.25{col 38}{space 1}    2.38{col 47}{space 3} 0.02{col 55}{space 4}     1.07{col 68}{space 3}     2.05
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.85{col 27}{space 2}     0.44{col 38}{space 1}   -0.31{col 47}{space 3} 0.76{col 55}{space 4}     0.31{col 68}{space 3}     2.33
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -0.24{col 27}{space 2}     0.24{col 55}{space 4}    -0.71{col 68}{space 3}     0.23
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.89{col 27}{space 2}     0.11{col 55}{space 4}     0.70{col 68}{space 3}     1.12
{txt}          rho {c |}{col 15}{res}{space 2}     0.19{col 27}{space 2}     0.04{col 55}{space 4}     0.13{col 68}{space 3}     0.28
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}92.39{col 56}{txt}Prob >= chibar2 = {res}0.000

{txt}{hline}
{p 0 8}Model {hi:anemia_estimates}{p_end}
{hline}

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    10,387
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     6,057

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       1.7
{txt}{col 63}max{col 67}={col 69}{res}         4

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}   221.98
{txt}Log pseudolikelihood  = {res}-6347.9789{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 79:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.88{col 27}{space 2}     0.20{col 38}{space 1}    5.89{col 47}{space 3} 0.00{col 55}{space 4}     1.52{col 68}{space 3}     2.32
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.61{col 27}{space 2}     0.12{col 38}{space 1}   -2.63{col 47}{space 3} 0.01{col 55}{space 4}     0.42{col 68}{space 3}     0.88
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     1.02{col 27}{space 2}     0.23{col 38}{space 1}    0.09{col 47}{space 3} 0.93{col 55}{space 4}     0.65{col 68}{space 3}     1.60
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.58{col 27}{space 2}     0.10{col 38}{space 1}   -3.06{col 47}{space 3} 0.00{col 55}{space 4}     0.41{col 68}{space 3}     0.82
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.74{col 27}{space 2}     0.13{col 38}{space 1}   -1.75{col 47}{space 3} 0.08{col 55}{space 4}     0.53{col 68}{space 3}     1.04
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     1.67{col 27}{space 2}     0.18{col 38}{space 1}    4.76{col 47}{space 3} 0.00{col 55}{space 4}     1.35{col 68}{space 3}     2.06
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.01{col 27}{space 2}     0.01{col 38}{space 1}    2.55{col 47}{space 3} 0.01{col 55}{space 4}     1.00{col 68}{space 3}     1.02
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.91{col 27}{space 2}     0.24{col 38}{space 1}    5.10{col 47}{space 3} 0.00{col 55}{space 4}     1.49{col 68}{space 3}     2.45
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.19{col 27}{space 2}     0.09{col 38}{space 1}    2.32{col 47}{space 3} 0.02{col 55}{space 4}     1.03{col 68}{space 3}     1.38
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.17{col 27}{space 2}     0.04{col 38}{space 1}   -8.35{col 47}{space 3} 0.00{col 55}{space 4}     0.11{col 68}{space 3}     0.26
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -1.34{col 27}{space 2}     0.46{col 55}{space 4}    -2.25{col 68}{space 3}    -0.43
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.51{col 27}{space 2}     0.12{col 55}{space 4}     0.32{col 68}{space 3}     0.80
{txt}          rho {c |}{col 15}{res}{space 2}     0.07{col 27}{space 2}     0.03{col 55}{space 4}     0.03{col 68}{space 3}     0.16
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:fetalgrowth_estimates}{p_end}
{hline}

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     1,155
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     1,154

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       1.0
{txt}{col 63}max{col 67}={col 69}{res}         2

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    31.62
{txt}Log pseudolikelihood  = {res}-631.45636{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0002

{txt}{ralign 79:(Std. Err. adjusted for {res:116} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     0.59{col 27}{space 2}     0.15{col 38}{space 1}   -2.11{col 47}{space 3} 0.03{col 55}{space 4}     0.37{col 68}{space 3}     0.96
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.19{col 27}{space 2}     0.46{col 38}{space 1}    0.44{col 47}{space 3} 0.66{col 55}{space 4}     0.55{col 68}{space 3}     2.56
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.33{col 27}{space 2}     0.21{col 38}{space 1}   -1.70{col 47}{space 3} 0.09{col 55}{space 4}     0.09{col 68}{space 3}     1.18
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.27{col 27}{space 2}     0.51{col 38}{space 1}    0.59{col 47}{space 3} 0.56{col 55}{space 4}     0.57{col 68}{space 3}     2.81
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     3.92{col 27}{space 2}     1.69{col 38}{space 1}    3.16{col 47}{space 3} 0.00{col 55}{space 4}     1.68{col 68}{space 3}     9.14
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.99{col 27}{space 2}     0.36{col 38}{space 1}   -0.03{col 47}{space 3} 0.98{col 55}{space 4}     0.49{col 68}{space 3}     2.02
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.00{col 27}{space 2}     0.02{col 38}{space 1}   -0.25{col 47}{space 3} 0.80{col 55}{space 4}     0.97{col 68}{space 3}     1.03
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.20{col 27}{space 2}     0.37{col 38}{space 1}    0.61{col 47}{space 3} 0.54{col 55}{space 4}     0.66{col 68}{space 3}     2.19
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.24{col 27}{space 2}     0.25{col 38}{space 1}    1.06{col 47}{space 3} 0.29{col 55}{space 4}     0.83{col 68}{space 3}     1.85
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     2.75{col 27}{space 2}     1.63{col 38}{space 1}    1.71{col 47}{space 3} 0.09{col 55}{space 4}     0.86{col 68}{space 3}     8.77
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -7.40{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.02{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}{txt}
{com}. 
. `subhead'
{res}{txt}
{com}. putdocx text ("Process outcomes — figures")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. foreach outcome of global process_outcomes {c -(}
{txt}  2{com}.   putdocx image "${c -(}`outcome'_margins_fname{c )-}.png", linebreak
{txt}  3{com}. {c )-}
{res}{txt}
{com}. 
. // References
. `heading'
{res}{txt}
{com}. putdocx text ("References")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. // Appendices
. 
. `heading'
{res}{txt}
{com}. putdocx text ("Appendix 1 — Protocol Deviations")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `heading'
{res}{txt}
{com}. putdocx text ("Appendix 2 — Imputation")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. foreach var of newlist y1-y5 y $imputeds {c -(} // newlist as vars only exist in (other) frames.
{txt}  2{com}.   display "${c -(}`var'_plot_fname{c )-}"
{txt}  3{com}.   putdocx image "${c -(}`var'_plot_fname{c )-}.png", linebreak
{txt}  4{com}. {c )-}
products/Imputations - Anemia at birth
{res}products/Imputations - Severe hypertension at birth
products/Imputations - SGA undetected at birth
products/Imputations - Malpresentation undetected at birth
products/Imputations - Large for gestational age
products/Imputations - Adverse pregnancy outcome
products/Imputations - Age (years)
products/Imputations - Body mass index
products/Imputations - Education (years)
products/Imputations - Monthly household income (ILS; log scale)
products/Imputations - Parity
{txt}
{com}. 
. `heading'
{res}{txt}
{com}. putdocx text ("Appendix 3 — Full Regression Results")
{res}{txt}
{com}. 
. `subhead'
{res}{txt}
{com}. putdocx text ("Health outcomes")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. frame imputed {c -(}
.   foreach var of varlist y y1-y5 {c -(}
{txt}  2{com}.     local ++tbl_num
{txt}  3{com}.     local var_label : variable label `var'
{txt}  4{com}.     local title "Table `tbl_num'. `var_label' (multiply-imputed result)"
{txt}  5{com}.     estimates replay `var'_estimates, eform
{txt}  6{com}.     putdocx table tbl_`tbl_num' = etable, title("`title'")
{txt}  7{com}.     putdocx table tbl_`tbl_num'(2, 2) = ("Odds Ratio"), halign(right)
{txt}  8{com}.   {c )-}

{txt}{hline}
{p 0 8}Model {hi:y_estimates}{p_end}
{hline}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable: {res:clusterid}{col 49}Number of groups{col 67}= {res}       119
{txt}Random effects u_i ~ {res:Gaussian}{col 49}Obs per group:
{col 49}              min{col 67}= {res}         9
{txt}Integration points = {res:12}{col 49}              avg{col 67}= {res}      53.5
{txt}{col 49}              max{col 67}= {res}       217
{txt}{col 49}Average RVI{col 67}= {res}    0.1744
{txt}{col 49}Largest FMI{col 67}= {res}    0.2199
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1,027.37
{txt}{col 49}        avg{col 67}= {res}  2,919.48
{txt}{col 49}        max{col 67}= {res} 13,007.76
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}17674.9{txt}){col 67}= {res}      3.91
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |}     exp(b){col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     0.99{col 27}{space 2}     0.06{col 38}{space 1}   -0.15{col 47}{space 3} 0.88{col 55}{space 4}     0.87{col 68}{space 3}     1.12
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.18{col 27}{space 2}     0.13{col 38}{space 1}    1.47{col 47}{space 3} 0.14{col 55}{space 4}     0.95{col 68}{space 3}     1.47
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.92{col 27}{space 2}     0.13{col 38}{space 1}   -0.59{col 47}{space 3} 0.55{col 55}{space 4}     0.69{col 68}{space 3}     1.22
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.06{col 27}{space 2}     0.12{col 38}{space 1}    0.54{col 47}{space 3} 0.59{col 55}{space 4}     0.85{col 68}{space 3}     1.34
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.21{col 27}{space 2}     0.13{col 38}{space 1}    1.73{col 47}{space 3} 0.08{col 55}{space 4}     0.98{col 68}{space 3}     1.50
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.87{col 27}{space 2}     0.07{col 38}{space 1}   -1.71{col 47}{space 3} 0.09{col 55}{space 4}     0.75{col 68}{space 3}     1.02
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.03{col 27}{space 2}     0.01{col 38}{space 1}    4.69{col 47}{space 3} 0.00{col 55}{space 4}     1.02{col 68}{space 3}     1.04
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.12{col 27}{space 2}     0.09{col 38}{space 1}    1.50{col 47}{space 3} 0.13{col 55}{space 4}     0.97{col 68}{space 3}     1.30
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.05{col 27}{space 2}     0.09{col 38}{space 1}    0.61{col 47}{space 3} 0.55{col 55}{space 4}     0.89{col 68}{space 3}     1.24
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.15{col 27}{space 2}     0.03{col 38}{space 1}   -9.26{col 47}{space 3} 0.00{col 55}{space 4}     0.10{col 68}{space 3}     0.22
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -9.32{col 27}{space 2}    11.10{col 55}{space 4}   -31.09{col 68}{space 3}    12.44
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.01{col 27}{space 2}     0.05{col 55}{space 4}     0.00{col 68}{space 3}   501.73
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:y1_estimates}{p_end}
{hline}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable: {res:clusterid}{col 49}Number of groups{col 67}= {res}       119
{txt}Random effects u_i ~ {res:Gaussian}{col 49}Obs per group:
{col 49}              min{col 67}= {res}         9
{txt}Integration points = {res:12}{col 49}              avg{col 67}= {res}      53.5
{txt}{col 49}              max{col 67}= {res}       217
{txt}{col 49}Average RVI{col 67}= {res}    0.3548
{txt}{col 49}Largest FMI{col 67}= {res}    0.3678
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}    369.01
{txt}{col 49}        avg{col 67}= {res}  1,239.33
{txt}{col 49}        max{col 67}= {res}  7,228.29
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res} 5568.4{txt}){col 67}= {res}      1.21
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.2849

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y1{col 15}{c |}     exp(b){col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     0.82{col 27}{space 2}     0.20{col 38}{space 1}   -0.83{col 47}{space 3} 0.41{col 55}{space 4}     0.51{col 68}{space 3}     1.31
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.51{col 27}{space 2}     0.69{col 38}{space 1}    0.90{col 47}{space 3} 0.37{col 55}{space 4}     0.62{col 68}{space 3}     3.69
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     1.20{col 27}{space 2}     0.67{col 38}{space 1}    0.33{col 47}{space 3} 0.74{col 55}{space 4}     0.41{col 68}{space 3}     3.57
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.54{col 27}{space 2}     0.66{col 38}{space 1}    1.00{col 47}{space 3} 0.32{col 55}{space 4}     0.66{col 68}{space 3}     3.56
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.69{col 27}{space 2}     0.72{col 38}{space 1}    1.24{col 47}{space 3} 0.22{col 55}{space 4}     0.74{col 68}{space 3}     3.91
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.62{col 27}{space 2}     0.20{col 38}{space 1}   -1.51{col 47}{space 3} 0.13{col 55}{space 4}     0.33{col 68}{space 3}     1.15
{txt}{space 10}age {c |}{col 15}{res}{space 2}     0.96{col 27}{space 2}     0.02{col 38}{space 1}   -1.80{col 47}{space 3} 0.07{col 55}{space 4}     0.91{col 68}{space 3}     1.00
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.42{col 27}{space 2}     0.39{col 38}{space 1}    1.29{col 47}{space 3} 0.20{col 55}{space 4}     0.83{col 68}{space 3}     2.43
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     0.50{col 27}{space 2}     0.18{col 38}{space 1}   -1.95{col 47}{space 3} 0.05{col 55}{space 4}     0.25{col 68}{space 3}     1.01
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.05{col 27}{space 2}     0.04{col 38}{space 1}   -3.73{col 47}{space 3} 0.00{col 55}{space 4}     0.01{col 68}{space 3}     0.25
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -5.58{col 27}{space 2}    14.69{col 55}{space 4}   -34.38{col 68}{space 3}    23.23
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.06{col 27}{space 2}     0.45{col 55}{space 4}     0.00{col 68}{space 3}110504.95
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.02{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:y2_estimates}{p_end}
{hline}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable: {res:clusterid}{col 49}Number of groups{col 67}= {res}       119
{txt}Random effects u_i ~ {res:Gaussian}{col 49}Obs per group:
{col 49}              min{col 67}= {res}         9
{txt}Integration points = {res:12}{col 49}              avg{col 67}= {res}      53.5
{txt}{col 49}              max{col 67}= {res}       217
{txt}{col 49}Average RVI{col 67}= {res}    0.6376
{txt}{col 49}Largest FMI{col 67}= {res}    0.5243
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}    181.87
{txt}{col 49}        avg{col 67}= {res}435,181.00
{txt}{col 49}        max{col 67}= {res}3044654.56
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   5{txt},{res} 1241.9{txt}){col 67}= {res}      5.89
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y2{col 15}{c |}     exp(b){col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     0.61{col 27}{space 2}     0.25{col 38}{space 1}   -1.21{col 47}{space 3} 0.23{col 55}{space 4}     0.27{col 68}{space 3}     1.36
{txt}{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.79{col 27}{space 2}     0.41{col 38}{space 1}   -0.44{col 47}{space 3} 0.66{col 55}{space 4}     0.29{col 68}{space 3}     2.20
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.19{col 27}{space 2}     0.04{col 38}{space 1}    4.80{col 47}{space 3} 0.00{col 55}{space 4}     1.11{col 68}{space 3}     1.28
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.93{col 27}{space 2}     0.41{col 38}{space 1}   -0.17{col 47}{space 3} 0.86{col 55}{space 4}     0.39{col 68}{space 3}     2.22
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     4.90{col 27}{space 2}     2.48{col 38}{space 1}    3.14{col 47}{space 3} 0.00{col 55}{space 4}     1.81{col 68}{space 3}    13.26
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 38}{space 1}   -7.94{col 47}{space 3} 0.00{col 55}{space 4}     0.00{col 68}{space 3}     0.00
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -5.22{col 27}{space 2}    70.80{col 55}{space 4}  -143.98{col 68}{space 3}   133.53
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.07{col 27}{space 2}     2.60{col 55}{space 4}     0.00{col 68}{space 3} 9.92e+28
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.12{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:y3_estimates}{p_end}
{hline}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable: {res:clusterid}{col 49}Number of groups{col 67}= {res}       119
{txt}Random effects u_i ~ {res:Gaussian}{col 49}Obs per group:
{col 49}              min{col 67}= {res}         9
{txt}Integration points = {res:12}{col 49}              avg{col 67}= {res}      53.5
{txt}{col 49}              max{col 67}= {res}       217
{txt}{col 49}Average RVI{col 67}= {res}    0.1141
{txt}{col 49}Largest FMI{col 67}= {res}    0.1792
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1,543.64
{txt}{col 49}        avg{col 67}= {res}  4,313.44
{txt}{col 49}        max{col 67}= {res}  6,433.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}39016.5{txt}){col 67}= {res}      3.25
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0006

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y3{col 15}{c |}     exp(b){col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.00{col 27}{space 2}     0.11{col 38}{space 1}    0.00{col 47}{space 3} 1.00{col 55}{space 4}     0.81{col 68}{space 3}     1.24
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.95{col 27}{space 2}     0.18{col 38}{space 1}   -0.30{col 47}{space 3} 0.77{col 55}{space 4}     0.65{col 68}{space 3}     1.37
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.65{col 27}{space 2}     0.17{col 38}{space 1}   -1.65{col 47}{space 3} 0.10{col 55}{space 4}     0.39{col 68}{space 3}     1.09
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.95{col 27}{space 2}     0.18{col 38}{space 1}   -0.25{col 47}{space 3} 0.80{col 55}{space 4}     0.66{col 68}{space 3}     1.38
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.01{col 27}{space 2}     0.19{col 38}{space 1}    0.05{col 47}{space 3} 0.96{col 55}{space 4}     0.70{col 68}{space 3}     1.45
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.88{col 27}{space 2}     0.13{col 38}{space 1}   -0.87{col 47}{space 3} 0.38{col 55}{space 4}     0.66{col 68}{space 3}     1.18
{txt}{space 10}age {c |}{col 15}{res}{space 2}     0.97{col 27}{space 2}     0.01{col 38}{space 1}   -2.64{col 47}{space 3} 0.01{col 55}{space 4}     0.95{col 68}{space 3}     0.99
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.26{col 27}{space 2}     0.16{col 38}{space 1}    1.75{col 47}{space 3} 0.08{col 55}{space 4}     0.97{col 68}{space 3}     1.62
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.34{col 27}{space 2}     0.16{col 38}{space 1}    2.39{col 47}{space 3} 0.02{col 55}{space 4}     1.05{col 68}{space 3}     1.71
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.17{col 27}{space 2}     0.06{col 38}{space 1}   -5.21{col 47}{space 3} 0.00{col 55}{space 4}     0.08{col 68}{space 3}     0.33
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -3.04{col 27}{space 2}     0.74{col 55}{space 4}    -4.50{col 68}{space 3}    -1.59
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.22{col 27}{space 2}     0.08{col 55}{space 4}     0.11{col 68}{space 3}     0.45
{txt}          rho {c |}{col 15}{res}{space 2}     0.01{col 27}{space 2}     0.01{col 55}{space 4}     0.00{col 68}{space 3}     0.06
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:y4_estimates}{p_end}
{hline}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable: {res:clusterid}{col 49}Number of groups{col 67}= {res}       119
{txt}Random effects u_i ~ {res:Gaussian}{col 49}Obs per group:
{col 49}              min{col 67}= {res}         9
{txt}Integration points = {res:12}{col 49}              avg{col 67}= {res}      53.5
{txt}{col 49}              max{col 67}= {res}       217
{txt}{col 49}Average RVI{col 67}= {res}    0.1584
{txt}{col 49}Largest FMI{col 67}= {res}    0.1953
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1,301.14
{txt}{col 49}        avg{col 67}= {res}  3,218.72
{txt}{col 49}        max{col 67}= {res} 12,835.65
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}20776.0{txt}){col 67}= {res}      3.35
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0004

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y4{col 15}{c |}     exp(b){col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     0.93{col 27}{space 2}     0.15{col 38}{space 1}   -0.44{col 47}{space 3} 0.66{col 55}{space 4}     0.68{col 68}{space 3}     1.27
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.23{col 27}{space 2}     0.39{col 38}{space 1}    0.67{col 47}{space 3} 0.51{col 55}{space 4}     0.66{col 68}{space 3}     2.29
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.76{col 27}{space 2}     0.36{col 38}{space 1}   -0.57{col 47}{space 3} 0.57{col 55}{space 4}     0.31{col 68}{space 3}     1.91
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.70{col 27}{space 2}     0.51{col 38}{space 1}    1.79{col 47}{space 3} 0.07{col 55}{space 4}     0.95{col 68}{space 3}     3.05
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.49{col 27}{space 2}     0.45{col 38}{space 1}    1.32{col 47}{space 3} 0.19{col 55}{space 4}     0.82{col 68}{space 3}     2.71
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.67{col 27}{space 2}     0.15{col 38}{space 1}   -1.80{col 47}{space 3} 0.07{col 55}{space 4}     0.43{col 68}{space 3}     1.04
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.05{col 27}{space 2}     0.02{col 38}{space 1}    3.26{col 47}{space 3} 0.00{col 55}{space 4}     1.02{col 68}{space 3}     1.08
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.98{col 27}{space 2}     0.19{col 38}{space 1}   -0.12{col 47}{space 3} 0.91{col 55}{space 4}     0.67{col 68}{space 3}     1.43
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.90{col 27}{space 2}     0.36{col 38}{space 1}    3.37{col 47}{space 3} 0.00{col 55}{space 4}     1.31{col 68}{space 3}     2.75
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.01{col 27}{space 2}     0.00{col 38}{space 1}   -9.26{col 47}{space 3} 0.00{col 55}{space 4}     0.00{col 68}{space 3}     0.02
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -6.96{col 27}{space 2}    16.65{col 55}{space 4}   -39.60{col 68}{space 3}    25.67
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.03{col 27}{space 2}     0.26{col 55}{space 4}     0.00{col 68}{space 3}375349.91
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.00{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:y5_estimates}{p_end}
{hline}
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}        50
{txt}Random-effects logistic regression{col 49}Number of obs{col 67}= {res}     6,367

{txt}Group variable: {res:clusterid}{col 49}Number of groups{col 67}= {res}       119
{txt}Random effects u_i ~ {res:Gaussian}{col 49}Obs per group:
{col 49}              min{col 67}= {res}         9
{txt}Integration points = {res:12}{col 49}              avg{col 67}= {res}      53.5
{txt}{col 49}              max{col 67}= {res}       217
{txt}{col 49}Average RVI{col 67}= {res}    0.1262
{txt}{col 49}Largest FMI{col 67}= {res}    0.1744
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1,630.26
{txt}{col 49}        avg{col 67}= {res}  3,551.43
{txt}{col 49}        max{col 67}= {res}  7,235.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}31113.5{txt}){col 67}= {res}      9.38
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y5{col 15}{c |}     exp(b){col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.06{col 27}{space 2}     0.09{col 38}{space 1}    0.73{col 47}{space 3} 0.46{col 55}{space 4}     0.90{col 68}{space 3}     1.25
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.21{col 27}{space 2}     0.18{col 38}{space 1}    1.31{col 47}{space 3} 0.19{col 55}{space 4}     0.91{col 68}{space 3}     1.61
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     1.13{col 27}{space 2}     0.21{col 38}{space 1}    0.67{col 47}{space 3} 0.51{col 55}{space 4}     0.79{col 68}{space 3}     1.63
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.96{col 27}{space 2}     0.15{col 38}{space 1}   -0.24{col 47}{space 3} 0.81{col 55}{space 4}     0.71{col 68}{space 3}     1.30
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.15{col 27}{space 2}     0.17{col 38}{space 1}    0.93{col 47}{space 3} 0.35{col 55}{space 4}     0.86{col 68}{space 3}     1.53
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.97{col 27}{space 2}     0.10{col 38}{space 1}   -0.32{col 47}{space 3} 0.75{col 55}{space 4}     0.79{col 68}{space 3}     1.18
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.05{col 27}{space 2}     0.01{col 38}{space 1}    6.61{col 47}{space 3} 0.00{col 55}{space 4}     1.03{col 68}{space 3}     1.06
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.02{col 27}{space 2}     0.10{col 38}{space 1}    0.21{col 47}{space 3} 0.83{col 55}{space 4}     0.84{col 68}{space 3}     1.24
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     0.68{col 27}{space 2}     0.08{col 38}{space 1}   -3.19{col 47}{space 3} 0.00{col 55}{space 4}     0.54{col 68}{space 3}     0.86
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.04{col 27}{space 2}     0.01{col 38}{space 1}  -12.62{col 47}{space 3} 0.00{col 55}{space 4}     0.02{col 68}{space 3}     0.06
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -6.34{col 27}{space 2}    10.25{col 55}{space 4}   -26.44{col 68}{space 3}    13.75
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.04{col 27}{space 2}     0.22{col 55}{space 4}     0.00{col 68}{space 3}   969.76
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}     0.01{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{res}{com}. {c )-}
{txt}
{com}. 
. tempname original
{txt}
{com}. frame copy imputed `original'
{txt}
{com}. frame `original' {c -(}
.   mi extract 0, clear
.   xtset clusterid
{txt}{col 8}panel variable:  {res}clusterid (unbalanced)
{com}.   local var stillbirth
. 
.   local ++tbl_num
.   local var_label : variable label `var'
.   local title "Table `tbl_num'. `var_label' (complete case result)"
.   estimates replay `var'_estimates, or

{txt}{hline}
{p 0 8}Model {hi:stillbirth_estimates}{p_end}
{hline}

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     5,919
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       119

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         7
{txt}{col 63}avg{col 67}={col 69}{res}      49.7
{txt}{col 63}max{col 67}={col 69}{res}       216

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}     7.91
{txt}Log likelihood  = {res}-245.81337{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.5434

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   stillbirth{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.07{col 27}{space 2}     0.34{col 38}{space 1}    0.22{col 47}{space 3} 0.83{col 55}{space 4}     0.57{col 68}{space 3}     2.00
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.39{col 27}{space 2}     0.19{col 38}{space 1}   -1.94{col 47}{space 3} 0.05{col 55}{space 4}     0.15{col 68}{space 3}     1.01
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.61{col 27}{space 2}     0.38{col 38}{space 1}   -0.80{col 47}{space 3} 0.42{col 55}{space 4}     0.18{col 68}{space 3}     2.05
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.30{col 27}{space 2}     0.16{col 38}{space 1}   -2.25{col 47}{space 3} 0.02{col 55}{space 4}     0.11{col 68}{space 3}     0.86
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.42{col 27}{space 2}     0.20{col 38}{space 1}   -1.84{col 47}{space 3} 0.07{col 55}{space 4}     0.17{col 68}{space 3}     1.06
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.82{col 27}{space 2}     0.34{col 38}{space 1}   -0.47{col 47}{space 3} 0.64{col 55}{space 4}     0.37{col 68}{space 3}     1.85
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.03{col 27}{space 2}     0.03{col 38}{space 1}    0.94{col 47}{space 3} 0.35{col 55}{space 4}     0.97{col 68}{space 3}     1.09
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.81{col 27}{space 2}     0.32{col 38}{space 1}   -0.55{col 47}{space 3} 0.58{col 55}{space 4}     0.38{col 68}{space 3}     1.74
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.13{col 27}{space 2}     0.47{col 38}{space 1}    0.29{col 47}{space 3} 0.78{col 55}{space 4}     0.50{col 68}{space 3}     2.55
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.01{col 27}{space 2}     0.01{col 38}{space 1}   -4.94{col 47}{space 3} 0.00{col 55}{space 4}     0.00{col 68}{space 3}     0.06
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -2.62{col 27}{space 2}     5.39{col 55}{space 4}   -13.18{col 68}{space 3}     7.94
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.27{col 27}{space 2}     0.73{col 55}{space 4}     0.00{col 68}{space 3}    52.88
{txt}          rho {c |}{col 15}{res}{space 2}     0.02{col 27}{space 2}     0.11{col 55}{space 4}     0.00{col 68}{space 3}     1.00
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}0.04{col 56}{txt}Prob >= chibar2 = {res}0.425
{com}.   putdocx table tbl_`tbl_num' = etable, title("`title'")
{res}{com}.   putdocx table tbl_`tbl_num'(2, 2) = ("Odds Ratio"), halign(right)
{res}{com}. {c )-}
{txt}
{com}. 
. `subhead'
{res}{txt}
{com}. putdocx text ("Process outcomes")
{res}{txt}
{com}. `newpara'
{res}{txt}
{com}. 
. foreach outcome of global process_outcomes {c -(}
{txt}  2{com}.   frame `outcome' {c -(}
{txt}  3{com}.     local ++tbl_num  
{txt}  4{com}.     local var_label : variable label y
{txt}  5{com}.     local title "Table `tbl_num'. `var_label' screening & management"
{txt}  6{com}.     estimates replay `outcome'_estimates, or
{txt}  7{com}.     putdocx table tbl_`tbl_num' = etable, title("`title'")
{txt}  8{com}.     putdocx table tbl_`tbl_num'(2, 2) = ("Odds Ratio"), halign(right)
{txt}  9{com}.     putdocx table tbl_`tbl_num'(3, 2) = (""), halign(right) // Was "Coef."
{txt} 10{com}.   {c )-}
{txt} 11{com}. {c )-}

{txt}{hline}
{p 0 8}Model {hi:attendance_estimates}{p_end}
{hline}

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    21,430
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     5,139

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       4.2
{txt}{col 63}max{col 67}={col 69}{res}         5

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    80.39
{txt}Log pseudolikelihood  = {res}-13537.058{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 79:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     0.85{col 27}{space 2}     0.10{col 38}{space 1}   -1.47{col 47}{space 3} 0.14{col 55}{space 4}     0.68{col 68}{space 3}     1.06
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.58{col 27}{space 2}     0.11{col 38}{space 1}   -2.98{col 47}{space 3} 0.00{col 55}{space 4}     0.40{col 68}{space 3}     0.83
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     1.38{col 27}{space 2}     0.26{col 38}{space 1}    1.69{col 47}{space 3} 0.09{col 55}{space 4}     0.95{col 68}{space 3}     2.00
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.22{col 27}{space 2}     0.21{col 38}{space 1}    1.15{col 47}{space 3} 0.25{col 55}{space 4}     0.87{col 68}{space 3}     1.71
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.75{col 27}{space 2}     0.31{col 38}{space 1}    3.16{col 47}{space 3} 0.00{col 55}{space 4}     1.24{col 68}{space 3}     2.47
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     1.53{col 27}{space 2}     0.21{col 38}{space 1}    3.17{col 47}{space 3} 0.00{col 55}{space 4}     1.18{col 68}{space 3}     2.00
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.01{col 27}{space 2}     0.01{col 38}{space 1}    1.39{col 47}{space 3} 0.16{col 55}{space 4}     1.00{col 68}{space 3}     1.02
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     0.99{col 27}{space 2}     0.12{col 38}{space 1}   -0.07{col 47}{space 3} 0.95{col 55}{space 4}     0.78{col 68}{space 3}     1.27
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.01{col 27}{space 2}     0.07{col 38}{space 1}    0.13{col 47}{space 3} 0.89{col 55}{space 4}     0.89{col 68}{space 3}     1.15
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.40{col 27}{space 2}     0.10{col 38}{space 1}   -3.76{col 47}{space 3} 0.00{col 55}{space 4}     0.25{col 68}{space 3}     0.64
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}     0.60{col 27}{space 2}     0.08{col 55}{space 4}     0.44{col 68}{space 3}     0.76
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     1.35{col 27}{space 2}     0.05{col 55}{space 4}     1.25{col 68}{space 3}     1.46
{txt}          rho {c |}{col 15}{res}{space 2}     0.36{col 27}{space 2}     0.02{col 55}{space 4}     0.32{col 68}{space 3}     0.39
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:hypertension_estimates}{p_end}
{hline}

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    15,383
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     5,946

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       2.6
{txt}{col 63}max{col 67}={col 69}{res}         6

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    52.00
{txt}Log pseudolikelihood  = {res}-2693.7964{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 79:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.62{col 27}{space 2}     0.19{col 38}{space 1}    4.07{col 47}{space 3} 0.00{col 55}{space 4}     1.29{col 68}{space 3}     2.05
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.18{col 27}{space 2}     0.24{col 38}{space 1}    0.83{col 47}{space 3} 0.41{col 55}{space 4}     0.79{col 68}{space 3}     1.77
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     1.51{col 27}{space 2}     0.26{col 38}{space 1}    2.37{col 47}{space 3} 0.02{col 55}{space 4}     1.07{col 68}{space 3}     2.12
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.28{col 27}{space 2}     0.24{col 38}{space 1}    1.33{col 47}{space 3} 0.18{col 55}{space 4}     0.89{col 68}{space 3}     1.85
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.78{col 27}{space 2}     0.32{col 38}{space 1}    3.24{col 47}{space 3} 0.00{col 55}{space 4}     1.26{col 68}{space 3}     2.53
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.93{col 27}{space 2}     0.10{col 38}{space 1}   -0.65{col 47}{space 3} 0.51{col 55}{space 4}     0.75{col 68}{space 3}     1.15
{txt}{space 10}age {c |}{col 15}{res}{space 2}     0.98{col 27}{space 2}     0.01{col 38}{space 1}   -2.25{col 47}{space 3} 0.02{col 55}{space 4}     0.96{col 68}{space 3}     1.00
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.16{col 27}{space 2}     0.15{col 38}{space 1}    1.14{col 47}{space 3} 0.25{col 55}{space 4}     0.90{col 68}{space 3}     1.49
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     0.93{col 27}{space 2}     0.10{col 38}{space 1}   -0.67{col 47}{space 3} 0.50{col 55}{space 4}     0.74{col 68}{space 3}     1.16
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}    32.99{col 27}{space 2}     9.50{col 38}{space 1}   12.14{col 47}{space 3} 0.00{col 55}{space 4}    18.76{col 68}{space 3}    58.02
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -0.13{col 27}{space 2}     0.25{col 55}{space 4}    -0.61{col 68}{space 3}     0.36
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.94{col 27}{space 2}     0.12{col 55}{space 4}     0.74{col 68}{space 3}     1.20
{txt}          rho {c |}{col 15}{res}{space 2}     0.21{col 27}{space 2}     0.04{col 55}{space 4}     0.14{col 68}{space 3}     0.30
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:diabetes_estimates}{p_end}
{hline}

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    11,994
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     6,298

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       1.9
{txt}{col 63}max{col 67}={col 69}{res}         3

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    84.28
{txt}Log pseudolikelihood  = {res}-5870.0949{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 79:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.45{col 27}{space 2}     0.17{col 38}{space 1}    3.08{col 47}{space 3} 0.00{col 55}{space 4}     1.14{col 68}{space 3}     1.83
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.68{col 27}{space 2}     0.12{col 38}{space 1}   -2.10{col 47}{space 3} 0.04{col 55}{space 4}     0.48{col 68}{space 3}     0.97
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.58{col 27}{space 2}     0.13{col 38}{space 1}   -2.42{col 47}{space 3} 0.02{col 55}{space 4}     0.37{col 68}{space 3}     0.90
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.50{col 27}{space 2}     0.10{col 38}{space 1}   -3.30{col 47}{space 3} 0.00{col 55}{space 4}     0.33{col 68}{space 3}     0.76
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.72{col 27}{space 2}     0.11{col 38}{space 1}   -2.10{col 47}{space 3} 0.04{col 55}{space 4}     0.53{col 68}{space 3}     0.98
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     1.39{col 27}{space 2}     0.20{col 38}{space 1}    2.29{col 47}{space 3} 0.02{col 55}{space 4}     1.05{col 68}{space 3}     1.85
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.01{col 27}{space 2}     0.00{col 38}{space 1}    2.26{col 47}{space 3} 0.02{col 55}{space 4}     1.00{col 68}{space 3}     1.02
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.98{col 27}{space 2}     0.29{col 38}{space 1}    4.60{col 47}{space 3} 0.00{col 55}{space 4}     1.48{col 68}{space 3}     2.65
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.11{col 27}{space 2}     0.05{col 38}{space 1}    2.16{col 47}{space 3} 0.03{col 55}{space 4}     1.01{col 68}{space 3}     1.22
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.12{col 27}{space 2}     0.02{col 38}{space 1}  -10.86{col 47}{space 3} 0.00{col 55}{space 4}     0.08{col 68}{space 3}     0.17
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}   -13.38{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:malpresentation_estimates}{p_end}
{hline}

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     1,919
{txt}Group variable: {res}clusterid{col 49}{txt}Number of groups{col 67}={col 69}{res}       116

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}      16.5
{txt}{col 63}max{col 67}={col 69}{res}       113

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    31.83
{txt}Log likelihood  = {res}-898.13663{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0002

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.42{col 27}{space 2}     0.31{col 38}{space 1}    1.57{col 47}{space 3} 0.12{col 55}{space 4}     0.92{col 68}{space 3}     2.19
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.42{col 27}{space 2}     0.56{col 38}{space 1}    0.88{col 47}{space 3} 0.38{col 55}{space 4}     0.65{col 68}{space 3}     3.07
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     3.55{col 27}{space 2}     1.86{col 38}{space 1}    2.43{col 47}{space 3} 0.02{col 55}{space 4}     1.28{col 68}{space 3}     9.89
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.27{col 27}{space 2}     0.46{col 38}{space 1}    0.67{col 47}{space 3} 0.51{col 55}{space 4}     0.63{col 68}{space 3}     2.60
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     1.74{col 27}{space 2}     0.65{col 38}{space 1}    1.49{col 47}{space 3} 0.14{col 55}{space 4}     0.84{col 68}{space 3}     3.61
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     2.50{col 27}{space 2}     0.85{col 38}{space 1}    2.70{col 47}{space 3} 0.01{col 55}{space 4}     1.28{col 68}{space 3}     4.86
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.00{col 27}{space 2}     0.01{col 38}{space 1}    0.10{col 47}{space 3} 0.92{col 55}{space 4}     0.98{col 68}{space 3}     1.03
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.56{col 27}{space 2}     0.41{col 38}{space 1}    1.71{col 47}{space 3} 0.09{col 55}{space 4}     0.94{col 68}{space 3}     2.61
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.48{col 27}{space 2}     0.25{col 38}{space 1}    2.38{col 47}{space 3} 0.02{col 55}{space 4}     1.07{col 68}{space 3}     2.05
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.85{col 27}{space 2}     0.44{col 38}{space 1}   -0.31{col 47}{space 3} 0.76{col 55}{space 4}     0.31{col 68}{space 3}     2.33
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -0.24{col 27}{space 2}     0.24{col 55}{space 4}    -0.71{col 68}{space 3}     0.23
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.89{col 27}{space 2}     0.11{col 55}{space 4}     0.70{col 68}{space 3}     1.12
{txt}          rho {c |}{col 15}{res}{space 2}     0.19{col 27}{space 2}     0.04{col 55}{space 4}     0.13{col 68}{space 3}     0.28
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}92.39{col 56}{txt}Prob >= chibar2 = {res}0.000

{txt}{hline}
{p 0 8}Model {hi:anemia_estimates}{p_end}
{hline}

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}    10,387
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     6,057

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       1.7
{txt}{col 63}max{col 67}={col 69}{res}         4

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}   221.98
{txt}Log pseudolikelihood  = {res}-6347.9789{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 79:(Std. Err. adjusted for {res:119} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     1.88{col 27}{space 2}     0.20{col 38}{space 1}    5.89{col 47}{space 3} 0.00{col 55}{space 4}     1.52{col 68}{space 3}     2.32
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     0.61{col 27}{space 2}     0.12{col 38}{space 1}   -2.63{col 47}{space 3} 0.01{col 55}{space 4}     0.42{col 68}{space 3}     0.88
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     1.02{col 27}{space 2}     0.23{col 38}{space 1}    0.09{col 47}{space 3} 0.93{col 55}{space 4}     0.65{col 68}{space 3}     1.60
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     0.58{col 27}{space 2}     0.10{col 38}{space 1}   -3.06{col 47}{space 3} 0.00{col 55}{space 4}     0.41{col 68}{space 3}     0.82
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     0.74{col 27}{space 2}     0.13{col 38}{space 1}   -1.75{col 47}{space 3} 0.08{col 55}{space 4}     0.53{col 68}{space 3}     1.04
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     1.67{col 27}{space 2}     0.18{col 38}{space 1}    4.76{col 47}{space 3} 0.00{col 55}{space 4}     1.35{col 68}{space 3}     2.06
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.01{col 27}{space 2}     0.01{col 38}{space 1}    2.55{col 47}{space 3} 0.01{col 55}{space 4}     1.00{col 68}{space 3}     1.02
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.91{col 27}{space 2}     0.24{col 38}{space 1}    5.10{col 47}{space 3} 0.00{col 55}{space 4}     1.49{col 68}{space 3}     2.45
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.19{col 27}{space 2}     0.09{col 38}{space 1}    2.32{col 47}{space 3} 0.02{col 55}{space 4}     1.03{col 68}{space 3}     1.38
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     0.17{col 27}{space 2}     0.04{col 38}{space 1}   -8.35{col 47}{space 3} 0.00{col 55}{space 4}     0.11{col 68}{space 3}     0.26
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -1.34{col 27}{space 2}     0.46{col 55}{space 4}    -2.25{col 68}{space 3}    -0.43
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.51{col 27}{space 2}     0.12{col 55}{space 4}     0.32{col 68}{space 3}     0.80
{txt}          rho {c |}{col 15}{res}{space 2}     0.07{col 27}{space 2}     0.03{col 55}{space 4}     0.03{col 68}{space 3}     0.16
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}
{txt}{hline}
{p 0 8}Model {hi:fetalgrowth_estimates}{p_end}
{hline}

Random-effects logistic regression{col 49}Number of obs{col 67}={col 69}{res}     1,155
{txt}Group variable: {res}pregnancy{col 49}{txt}Number of groups{col 67}={col 69}{res}     1,154

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       1.0
{txt}{col 63}max{col 67}={col 69}{res}         2

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}9{txt}){col 67}={col 70}{res}    31.62
{txt}Log pseudolikelihood  = {res}-631.45636{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0002

{txt}{ralign 79:(Std. Err. adjusted for {res:116} clusters in clusterid)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}            y{col 15}{c |} Odds Ratio{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}arm {c |}
Intervention  {c |}{col 15}{res}{space 2}     0.59{col 27}{space 2}     0.15{col 38}{space 1}   -2.11{col 47}{space 3} 0.03{col 55}{space 4}     0.37{col 68}{space 3}     0.96
{txt}{space 13} {c |}
{space 4}strat_var {c |}
{space 6}8d9c30  {c |}{col 15}{res}{space 2}     1.19{col 27}{space 2}     0.46{col 38}{space 1}    0.44{col 47}{space 3} 0.66{col 55}{space 4}     0.55{col 68}{space 3}     2.56
{txt}{space 6}9d5ed6  {c |}{col 15}{res}{space 2}     0.33{col 27}{space 2}     0.21{col 38}{space 1}   -1.70{col 47}{space 3} 0.09{col 55}{space 4}     0.09{col 68}{space 3}     1.18
{txt}{space 6}e1e1d3  {c |}{col 15}{res}{space 2}     1.27{col 27}{space 2}     0.51{col 38}{space 1}    0.59{col 47}{space 3} 0.56{col 55}{space 4}     0.57{col 68}{space 3}     2.81
{txt}{space 6}ff4457  {c |}{col 15}{res}{space 2}     3.92{col 27}{space 2}     1.69{col 38}{space 1}    3.16{col 47}{space 3} 0.00{col 55}{space 4}     1.68{col 68}{space 3}     9.14
{txt}{space 13} {c |}
{space 1}cluster_size {c |}{col 15}{res}{space 2}     0.99{col 27}{space 2}     0.36{col 38}{space 1}   -0.03{col 47}{space 3} 0.98{col 55}{space 4}     0.49{col 68}{space 3}     2.02
{txt}{space 10}age {c |}{col 15}{res}{space 2}     1.00{col 27}{space 2}     0.02{col 38}{space 1}   -0.25{col 47}{space 3} 0.80{col 55}{space 4}     0.97{col 68}{space 3}     1.03
{txt}{space 13} {c |}
lab_available {c |}
{space 9}Lab  {c |}{col 15}{res}{space 2}     1.20{col 27}{space 2}     0.37{col 38}{space 1}    0.61{col 47}{space 3} 0.54{col 55}{space 4}     0.66{col 68}{space 3}     2.19
{txt}{space 13} {c |}
{space 2}primiparous {c |}
{space 7}Primi  {c |}{col 15}{res}{space 2}     1.24{col 27}{space 2}     0.25{col 38}{space 1}    1.06{col 47}{space 3} 0.29{col 55}{space 4}     0.83{col 68}{space 3}     1.85
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}     2.75{col 27}{space 2}     1.63{col 38}{space 1}    1.71{col 47}{space 3} 0.09{col 55}{space 4}     0.86{col 68}{space 3}     8.77
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}/lnsig2u {c |}{col 15}{res}{space 2}    -7.40{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |}{col 15}{res}{space 2}     0.02{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}          rho {c |}{col 15}{res}{space 2}     0.00{col 27}{space 2}        .{col 55}{space 4}        .{col 68}{space 3}        .
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{res}{txt}
{com}. 
. // Save the report to the specified filename.
. putdocx save `"`filename'"', replace
{res}successfully replaced {browse "/Users/cjr/Repos/fhi.eRegQual.2020/products/report.docx":"/Users/cjr/Repos/fhi.eRegQual.2020/products/report.docx"}
{txt}
{com}. 
{txt}end of do-file

{com}. 
{txt}end of do-file

{com}. 